{
    "original_file_name": "astro.mp4",
    "language": "fr",
    "sentences": [
        {
            "start": 0,
            "end": 6,
            "text": "et de comment scientifiquement on étudie l'univers tout entier, ce qui n'est pas facile, on n'en a qu'un seul."
        },
        {
            "start": 6,
            "end": 8,
            "text": "Ça paraît bête, mais c'est le cas."
        },
        {
            "start": 8,
            "end": 12,
            "text": "Je vais vous parler de l'univers de manière scientifique."
        },
        {
            "start": 12,
            "end": 15,
            "text": "Je vais vous parler de l'univers de manière scientifique."
        },
        {
            "start": 15,
            "end": 18,
            "text": "Je vais m'assurer que mon bidule marche bien."
        },
        {
            "start": 18,
            "end": 19,
            "text": "Voilà."
        },
        {
            "start": 19,
            "end": 28,
            "text": "Et je vais vous parler du satellite Planck et de comment scientifiquement on étudie l'univers tout entier, ce qui n'est pas facile, on n'en a qu'un seul."
        },
        {
            "start": 28,
            "end": 33,
            "text": "Ça paraît bête, mais n'avoir qu'un seul univers, c'est un problème en science."
        },
        {
            "start": 33,
            "end": 40,
            "text": "Et l'histoire du satellite Planck, que je relate aussi dans ce livre, que vous avez peut-être vu."
        },
        {
            "start": 40,
            "end": 50,
            "text": "Je ne raconterai pas tout ce qu'il y a dans le livre, mais je vous donnerai l'essence de notre travail et de l'approche que l'on a pour étudier l'univers."
        },
        {
            "start": 50,
            "end": 56,
            "text": "Alors... Je ne sais pas s'il y a des interférences, mais ça devrait marcher."
        },
        {
            "start": 56,
            "end": 65,
            "text": "Avant d'attaquer le dur du sujet de la science, je profite d'avoir du public pour rappeler que la science, c'est d'abord des scientifiques, des femmes et des hommes."
        },
        {
            "start": 65,
            "end": 68,
            "text": "Ça paraît bête, mais c'est des gens."
        },
        {
            "start": 68,
            "end": 70,
            "text": "La science toute seule n'existe pas."
        },
        {
            "start": 70,
            "end": 78,
            "text": "Je crois que les orateurs, il y a beaucoup plus d'hommes que de femmes, alors qu'il y a beaucoup de femmes scientifiques et très valeureuses."
        },
        {
            "start": 78,
            "end": 80,
            "text": "Donc il y a des femmes scientifiques."
        },
        {
            "start": 80,
            "end": 83,
            "text": "Ce ne sont pas mes photos de vacances, mais de missions."
        },
        {
            "start": 83,
            "end": 85,
            "text": "Je ne faisais pas les pires."
        },
        {
            "start": 85,
            "end": 91,
            "text": "Parce que la science, ce sont des scientifiques qui se rencontrent et qui confrontent leurs idées."
        },
        {
            "start": 91,
            "end": 97,
            "text": "Le consensus n'émerge pas nécessairement tout de suite, n'émerge pas naturellement."
        },
        {
            "start": 97,
            "end": 99,
            "text": "La science, c'est la confrontation des idées."
        },
        {
            "start": 99,
            "end": 105,
            "text": "Confrontation dans le respect, avec une méthode scientifique, mais il y a des confrontations d'idées."
        },
        {
            "start": 105,
            "end": 111,
            "text": "On va dans des conférences, à Los Angeles, à Hawaii, à Rome, etc."
        },
        {
            "start": 111,
            "end": 117,
            "text": "La science, ce n'est pas que vous êtes seul dans votre coin, vous avez une idée géniale, tout va bien."
        },
        {
            "start": 117,
            "end": 121,
            "text": "Si vous avez une idée géniale, vous la confrontez aux autres, qui vont vous dire que c'est n'importe quoi."
        },
        {
            "start": 121,
            "end": 124,
            "text": "Vous devez les convaincre, ça prend du temps."
        },
        {
            "start": 124,
            "end": 126,
            "text": "Mais c'est pour ça que tout prend du temps."
        },
        {
            "start": 126,
            "end": 131,
            "text": "Si vous faites des maniples spatials, il faut trouver la broutille de 1 milliard d'euros."
        },
        {
            "start": 131,
            "end": 135,
            "text": "Ce n'est pas facile, ce ne sont pas vos banquiers, ce sont les agences spatiales."
        },
        {
            "start": 135,
            "end": 138,
            "text": "Il y a des procédures sélectives et compétitives."
        },
        {
            "start": 138,
            "end": 146,
            "text": "Ça prend des années de l'expertise, de l'énervement, du découragement, mais ce sont des ambitions scientifiques qui nous portent et qui nous guident."
        },
        {
            "start": 146,
            "end": 147,
            "text": "On aime ça."
        },
        {
            "start": 147,
            "end": 151,
            "text": "Mais ce n'est pas du tout cuit et pas aussi simple qu'on peut l'imaginer."
        },
        {
            "start": 151,
            "end": 152,
            "text": "Ça se fait en équipe."
        },
        {
            "start": 152,
            "end": 159,
            "text": "J'étais à Los Angeles et à Groningen avec Carina Caputi, une collègue, et Dr Brenda Fry."
        },
        {
            "start": 159,
            "end": 166,
            "text": "Les filles sont présentes dans la science et je souhaitais l'indiquer ici."
        },
        {
            "start": 166,
            "end": 171,
            "text": "La science se fait aussi dans des grands établissements, des laboratoires de recherche."
        },
        {
            "start": 171,
            "end": 177,
            "text": "Pour moi, c'est Paris-Sud et Paris-Saclay, où on a des grands équipements, comme tous les labos de recherche."
        },
        {
            "start": 177,
            "end": 183,
            "text": "Ici, on a une salle de test en environnement spatial où on teste nos instruments avant de les envoyer dans l'espace."
        },
        {
            "start": 183,
            "end": 187,
            "text": "Après, il y a des moyens informatiques, des data centers, etc."
        },
        {
            "start": 187,
            "end": 190,
            "text": "Il y a beaucoup de choses qui existent dans toutes les universités."
        },
        {
            "start": 190,
            "end": 196,
            "text": "Il y a une spécificité à Paris-Sud et Paris-Saclay, c'est la MIS, maison d'initiation et de sensibilisation aux sciences."
        },
        {
            "start": 196,
            "end": 198,
            "text": "Je ne sais pas s'il y a des enseignants ici."
        },
        {
            "start": 198,
            "end": 201,
            "text": "C'est plutôt réservé aux gens d'Île-de-France, mais tout le monde est bienvenu."
        },
        {
            "start": 201,
            "end": 215,
            "text": "On a un laboratoire pour les 9-15 ans, c'est-à-dire du CE2 à la 3e, où les élèves viennent une journée faire des manips scientifiques encadrés par des doctorants sur des ateliers vraiment conçus par les chercheurs et adaptés."
        },
        {
            "start": 215,
            "end": 224,
            "text": "Et on pense que promouvoir la science auprès des plus jeunes, bien sûr, auprès de nos étudiants, c'est notre mission première, mais aussi auprès des plus jeunes, ça fait partie de nos missions."
        },
        {
            "start": 224,
            "end": 228,
            "text": "On a mis les moyens avec des partenaires, dans un beau bâtiment, etc."
        },
        {
            "start": 228,
            "end": 233,
            "text": "C'est une expérience sur laquelle je participe et qui est très agréable, je dois dire."
        },
        {
            "start": 233,
            "end": 235,
            "text": "Venons-en au sujet."
        },
        {
            "start": 235,
            "end": 242,
            "text": "Je ne suis pas hyper fan de Star Wars, j'aime bien Star Wars, comme tout le monde, mais mon livre s'appelle le côté obscur de l'univers."
        },
        {
            "start": 242,
            "end": 248,
            "text": "Et pour des raisons de production du livre, le titre a été choisi très tardivement dans le processus."
        },
        {
            "start": 248,
            "end": 252,
            "text": "J'avais déjà écrit le livre quand le titre a été choisi."
        },
        {
            "start": 252,
            "end": 258,
            "text": "Le titre que j'avais proposé à mon éditrice, c'était 52 nuances d'univers avec Planck."
        },
        {
            "start": 258,
            "end": 264,
            "text": "Je trouvais ça sympa, mais elle a trouvé que c'était pas... 52 parce que Planck a 52 bolomètres, vous verrez dans quelques instants."
        },
        {
            "start": 264,
            "end": 267,
            "text": "L'éditrice a dit non."
        },
        {
            "start": 267,
            "end": 275,
            "text": "Et donc, dans le livre, je n'ai même mis aucune référence à Star Wars, parce que je n'avais pas imaginé ça."
        },
        {
            "start": 275,
            "end": 280,
            "text": "Donc, si jamais vous lisez le livre, ne vous étonnez pas, de ne pas avoir de référence à Star Wars."
        },
        {
            "start": 280,
            "end": 292,
            "text": "Pour me faire pardonner, pour les futurs lecteurs, je mets un peu de Star Wars dans la présentation pour vider la frustration que j'ai eue de ne pas pouvoir rajouter quelques petites incises à ce sujet-là."
        },
        {
            "start": 292,
            "end": 294,
            "text": "Il y aura des petits thèmes comme ça."
        },
        {
            "start": 294,
            "end": 297,
            "text": "L'idée, c'est de parler de l'univers il y a très longtemps."
        },
        {
            "start": 297,
            "end": 303,
            "text": "Et de manière scientifique, même si la science-fiction est formidable, on est ici pour parler de science."
        },
        {
            "start": 303,
            "end": 316,
            "text": "Ce qui est bien en science, c'est qu'on a une ambition scientifique qui est peut-être pas de prouver, mais en tout cas d'utiliser le fait que les lois de la physique sont universelles et qu'elles sont les mêmes partout dans l'univers."
        },
        {
            "start": 316,
            "end": 317,
            "text": "C'est un postulat."
        },
        {
            "start": 317,
            "end": 319,
            "text": "Vous savez que la science, c'est formidable."
        },
        {
            "start": 319,
            "end": 323,
            "text": "Il y a une méthode très carrée, très logique, très suivie."
        },
        {
            "start": 323,
            "end": 327,
            "text": "Mais si on réfléchit un peu, la science est un géant au pied d'argile."
        },
        {
            "start": 327,
            "end": 333,
            "text": "Quand vous n'avez qu'un seul univers et que les lois de la physique ne sont pas les mêmes partout dans l'univers, qu'est-ce que vous faites ?"
        },
        {
            "start": 333,
            "end": 334,
            "text": "Partez-vous en vacances ?"
        },
        {
            "start": 334,
            "end": 343,
            "text": "Non, on n'arrête pas, mais on doit mettre des postulats qu'on essaie de vérifier, mais le problème des postulats, c'est qu'on n'arrive pas à les vérifier."
        },
        {
            "start": 343,
            "end": 345,
            "text": "C'est un peu comme en physique quantique."
        },
        {
            "start": 345,
            "end": 347,
            "text": "Néanmoins, on prend ce parti pris."
        },
        {
            "start": 347,
            "end": 349,
            "text": "Les lois de la physique sont universelles."
        },
        {
            "start": 349,
            "end": 352,
            "text": "L'univers est isotrope et homogène à une très grande échelle."
        },
        {
            "start": 352,
            "end": 354,
            "text": "Et on avance."
        },
        {
            "start": 354,
            "end": 356,
            "text": "Il y a quand même des choses très belles avec ça."
        },
        {
            "start": 356,
            "end": 358,
            "text": "Ici, je vous montre deux images."
        },
        {
            "start": 358,
            "end": 363,
            "text": "D'ailleurs... D'ailleurs, qu'est-ce que sont ces images ?"
        },
        {
            "start": 363,
            "end": 371,
            "text": "A gauche, c'est le Soleil, pris par un astronome amateur à Orsay, qui peut-être est dans la salle où vous parlez, Fabrice Noël."
        },
        {
            "start": 371,
            "end": 380,
            "text": "C'est le Soleil pris en Hα, que vous connaissez, c'est notre étoile, avec des petites vibrations à la surface, des petites protubérances qu'on a mises en or et blanc."
        },
        {
            "start": 380,
            "end": 385,
            "text": "A droite, c'est une image qui ressemble, mais qui n'a rien à voir, c'est tout l'univers."
        },
        {
            "start": 385,
            "end": 389,
            "text": "C'est le fond cosmologique, dont je vais parler pendant une quarantaine de minutes."
        },
        {
            "start": 389,
            "end": 391,
            "text": "C'est la première lueur de l'univers."
        },
        {
            "start": 391,
            "end": 397,
            "text": "Pour être plus précis, c'est la première lueur qui peut nous parvenir, parce qu'avant, l'univers était opaque."
        },
        {
            "start": 397,
            "end": 403,
            "text": "C'est le fond cosmologique, CMB, Cosmic Macrowave Background, cette première lueur de l'univers."
        },
        {
            "start": 403,
            "end": 406,
            "text": "Ces deux objets n'ont rien à voir."
        },
        {
            "start": 406,
            "end": 408,
            "text": "C'est tout l'univers, c'est juste une petite étoile."
        },
        {
            "start": 408,
            "end": 415,
            "text": "Aujourd'hui, c'est tout l'univers, il y a 370 000 ans après le Big Bang, il y a 13,8 milliards d'années."
        },
        {
            "start": 415,
            "end": 418,
            "text": "Et pourtant, la physique est quasiment la même."
        },
        {
            "start": 418,
            "end": 424,
            "text": "C'est un plasma chaud 6 000 degrés à la surface, c'est un plasma chaud."
        },
        {
            "start": 424,
            "end": 427,
            "text": "3 000 degrés au moment de la recombinaison."
        },
        {
            "start": 427,
            "end": 430,
            "text": "Ça vibre, ça vibre."
        },
        {
            "start": 430,
            "end": 433,
            "text": "Il y a des électrons et des baryons, de la matière ordinaire."
        },
        {
            "start": 433,
            "end": 435,
            "text": "Il y a des électrons et des baryons."
        },
        {
            "start": 435,
            "end": 437,
            "text": "Il y a des petites subtilités."
        },
        {
            "start": 437,
            "end": 439,
            "text": "Ça, c'est tout petit, ça, c'est très grand."
        },
        {
            "start": 439,
            "end": 441,
            "text": "C'est beaucoup plus grand."
        },
        {
            "start": 441,
            "end": 444,
            "text": "Là, il y a beaucoup de matière noire, là, il n'y en a pas."
        },
        {
            "start": 444,
            "end": 448,
            "text": "Là, il y a 10 puissance 9 photons pour un baryon."
        },
        {
            "start": 448,
            "end": 453,
            "text": "Là, je ne sais pas combien il y en a, mais je pense que ce n'est pas forcément le même rapport."
        },
        {
            "start": 453,
            "end": 455,
            "text": "Mais la physique est la même."
        },
        {
            "start": 455,
            "end": 462,
            "text": "Pour aller même plus loin, peut-être que ceux qui étaient là hier l'ont déjà vu, pour ceux qui ne le voient pas, je vais vous faire la démonstration."
        },
        {
            "start": 462,
            "end": 466,
            "text": "Voici un petit pendule fait maison, qui oscille."
        },
        {
            "start": 466,
            "end": 475,
            "text": "C'est Galilée Ier, au début du XVIIe siècle, qui avait montré le formalisme mathématique et qui avait résolu l'équation du mouvement."
        },
        {
            "start": 475,
            "end": 476,
            "text": "C'est un petit mouvement oscillant."
        },
        {
            "start": 476,
            "end": 485,
            "text": "On appelle ça... L'équation mathématique, c'est une équation différentielle du deuxième ordre d'un coefficient constant linéaire qui a juste pour solution un petit cosinus."
        },
        {
            "start": 485,
            "end": 496,
            "text": "Figurez-vous que cette petite équation de l'oscillateur harmonique est la même équation qui régit les vibrations du Soleil à gauche et les vibrations de l'univers primordial à droite."
        },
        {
            "start": 496,
            "end": 501,
            "text": "C'est juste une petite équation différentielle toute simple, et c'est la même."
        },
        {
            "start": 501,
            "end": 509,
            "text": "C'est ça qu'on aime bien en physique et en science, c'est avoir une sorte d'unicité de l'outil mathématique et des lois physiques qui s'appliquent à plein d'échelles."
        },
        {
            "start": 509,
            "end": 517,
            "text": "Ça ne peut pas s'appliquer à tout, mais ça s'applique ici, du pendule de Galilée au Soleil à l'origine de l'univers."
        },
        {
            "start": 517,
            "end": 522,
            "text": "La forme de l'équation est la même, mais les termes et les paramètres ne sont pas les mêmes."
        },
        {
            "start": 522,
            "end": 528,
            "text": "Là, la masse de petit tube de colle, je ne sais pas combien ça fait, 20 g. Là, toute la masse du Soleil."
        },
        {
            "start": 528,
            "end": 530,
            "text": "Là, tout l'univers."
        },
        {
            "start": 530,
            "end": 536,
            "text": "Et les forces de rappel, là, c'était la gravité du Soleil, et puis... Enfin, la gravité de la Terre, pardon."
        },
        {
            "start": 536,
            "end": 540,
            "text": "Là, c'est la masse du Soleil."
        },
        {
            "start": 540,
            "end": 549,
            "text": "Et puis là, vous avez, parce que ce sont des équations locales, toute une quantité de matière noire et des baryons, c'est-à-dire la matière ordinaire."
        },
        {
            "start": 549,
            "end": 553,
            "text": "Les ordres de grandeur ne sont pas les mêmes, mais les équations."
        },
        {
            "start": 553,
            "end": 554,
            "text": "Pourquoi ça vibre ?"
        },
        {
            "start": 554,
            "end": 556,
            "text": "Ça sera important dans la suite."
        },
        {
            "start": 556,
            "end": 558,
            "text": "Vous avez la gravité qui attire, vous le savez."
        },
        {
            "start": 558,
            "end": 560,
            "text": "La gravité attire."
        },
        {
            "start": 560,
            "end": 563,
            "text": "Vous avez des petites fluctuations, des petites surdensités."
        },
        {
            "start": 563,
            "end": 565,
            "text": "Ça attire."
        },
        {
            "start": 565,
            "end": 568,
            "text": "Mais il y a quelque chose qui s'oppose à cette attraction."
        },
        {
            "start": 568,
            "end": 572,
            "text": "Quand vous êtes dans un plasma, vous avez des électrons libres."
        },
        {
            "start": 572,
            "end": 574,
            "text": "Je l'évoquerai tout à l'heure."
        },
        {
            "start": 574,
            "end": 576,
            "text": "Je fais un petit résumé."
        },
        {
            "start": 576,
            "end": 581,
            "text": "Ces électrons libres ont le bon ou le mauvais goût d'interagir fortement avec la lumière, avec les photons."
        },
        {
            "start": 581,
            "end": 586,
            "text": "On appelle ça la diffusion Thomson, ou Compton, si vous connaissez Compton."
        },
        {
            "start": 586,
            "end": 592,
            "text": "La gravité fait votre petit morceau de matière, ici ou là, se concentrer."
        },
        {
            "start": 592,
            "end": 601,
            "text": "Mais en se concentrant, comme la lumière et la matière sont couplées, c'est un terme technique qui dit que la lumière et la matière vont ensemble, vous avez plein de lumière qui est concentrée."
        },
        {
            "start": 601,
            "end": 604,
            "text": "La lumière n'aime pas ça, donc elle pousse vers l'extérieur."
        },
        {
            "start": 604,
            "end": 605,
            "text": "On appelle ça la pression de radiation."
        },
        {
            "start": 605,
            "end": 609,
            "text": "Vous avez compétition entre gravité et pression de radiation."
        },
        {
            "start": 609,
            "end": 610,
            "text": "Donc, ça se met à osciller."
        },
        {
            "start": 610,
            "end": 616,
            "text": "L'univers primordial vibre, tout comme le Soleil, aujourd'hui, vibre."
        },
        {
            "start": 616,
            "end": 617,
            "text": "C'est ça qu'on va étudier."
        },
        {
            "start": 617,
            "end": 623,
            "text": "Vous savez peut-être que tout système vibrant ne vibre pas par hasard."
        },
        {
            "start": 623,
            "end": 626,
            "text": "Il vibre selon des propriétés qui lui sont propres."
        },
        {
            "start": 626,
            "end": 629,
            "text": "On appelle ça des modes propres, en physique."
        },
        {
            "start": 629,
            "end": 632,
            "text": "Il vibre comme une cloche, un violon ou une guitare."
        },
        {
            "start": 632,
            "end": 635,
            "text": "Ça ne fait pas n'importe quel son, mais un son adapté à la cavité."
        },
        {
            "start": 635,
            "end": 638,
            "text": "Là, la cavité, c'est tout l'univers, le Soleil."
        },
        {
            "start": 638,
            "end": 642,
            "text": "Votre violon, votre tambour ou que sais-je, c'est votre instrument."
        },
        {
            "start": 642,
            "end": 652,
            "text": "Le son que ça donne dans un instrument de musique sur Terre, avec une onde de pression qui se propage, puisque là, c'est via l'air, vous caractérise quasiment complètement votre instrument."
        },
        {
            "start": 652,
            "end": 655,
            "text": "Là, ce sont des oscillations acoustiques."
        },
        {
            "start": 655,
            "end": 657,
            "text": "C'est comme du son."
        },
        {
            "start": 657,
            "end": 661,
            "text": "C'est acoustique, c'est la matière qui se déplace."
        },
        {
            "start": 661,
            "end": 664,
            "text": "Mais après, il n'y a pas d'air pour propager le son."
        },
        {
            "start": 664,
            "end": 666,
            "text": "Il n'y a rien qui se propage, il y a juste la lumière."
        },
        {
            "start": 666,
            "end": 675,
            "text": "Notre chance, nous, astrophysiciens, c'est que cette matière qui bouge selon des oscillations acoustiques engendre des oscillations de lumière."
        },
        {
            "start": 675,
            "end": 676,
            "text": "Nous, on voit la lumière."
        },
        {
            "start": 676,
            "end": 682,
            "text": "Ces oscillations acoustiques, on peut les voir avec de la lumière et savoir comment ça vibre."
        },
        {
            "start": 682,
            "end": 685,
            "text": "Si on sait comment ça vibre, on peut savoir de quoi c'est fait."
        },
        {
            "start": 685,
            "end": 688,
            "text": "Quelle est la température, la vitesse ?"
        },
        {
            "start": 688,
            "end": 690,
            "text": "On peut savoir plein de choses."
        },
        {
            "start": 690,
            "end": 699,
            "text": "Étudier l'origine de l'univers, notamment avec le satellite Planck, en étudiant le fond cosmologique, c'est étudier les vibrations de l'univers tout jeune."
        },
        {
            "start": 699,
            "end": 703,
            "text": "Les vibrations vous donnent une carte d'identité complète de ce qui se passe."
        },
        {
            "start": 703,
            "end": 705,
            "text": "Voilà pour l'introduction."
        },
        {
            "start": 705,
            "end": 711,
            "text": "Pour ceux qui seraient nouveaux en astronomie, je vais vous raconter les échelles importantes que l'on va discuter."
        },
        {
            "start": 711,
            "end": 715,
            "text": "Le système solaire, c'est une image d'artiste."
        },
        {
            "start": 715,
            "end": 718,
            "text": "Le système solaire a une taille de quelques heures-lumière."
        },
        {
            "start": 718,
            "end": 721,
            "text": "La lumière met quelques heures à aller au confins du système solaire."
        },
        {
            "start": 721,
            "end": 727,
            "text": "Elle met une seconde pour faire la distance Terre-Lune et huit minutes pour faire la distance Terre-Soleil."
        },
        {
            "start": 727,
            "end": 729,
            "text": "Le système solaire, on connaît bien."
        },
        {
            "start": 729,
            "end": 730,
            "text": "Je passe, pardon."
        },
        {
            "start": 730,
            "end": 732,
            "text": "On va un peu plus loin."
        },
        {
            "start": 732,
            "end": 737,
            "text": "Au niveau des étoiles dans notre voie lactée, on est à quelques années-lumière."
        },
        {
            "start": 737,
            "end": 742,
            "text": "L'étoile la plus proche est à 4,2 années-lumière, proxima du centaure."
        },
        {
            "start": 742,
            "end": 745,
            "text": "Les étoiles ont une couleur, elles sont très belles."
        },
        {
            "start": 745,
            "end": 748,
            "text": "Tout ce que je vais vous montrer, c'est des vraies images."
        },
        {
            "start": 748,
            "end": 753,
            "text": "Les étoiles sont à quelques années-lumière, jusqu'à quelques milliers d'années-lumière."
        },
        {
            "start": 753,
            "end": 756,
            "text": "L'ordre de l'année, centaines, milliers."
        },
        {
            "start": 756,
            "end": 761,
            "text": "Si on va plus loin autour de nous, on va dans le royaume des nébuleuses."
        },
        {
            "start": 761,
            "end": 764,
            "text": "Les nébuleuses, c'est très beau, formidable."
        },
        {
            "start": 764,
            "end": 771,
            "text": "C'est du gaz composé d'hydrogène et plein d'autres atomes, selon où vous êtes dans la galaxie et à l'époque de l'Univers."
        },
        {
            "start": 771,
            "end": 777,
            "text": "Vous avez plein d'atomes complexes, du silicium, des molécules, du OH, du HCN, plein de trucs."
        },
        {
            "start": 777,
            "end": 777,
            "text": "Et de l'eau."
        },
        {
            "start": 777,
            "end": 780,
            "text": "Il y en a partout dans l'Univers."
        },
        {
            "start": 780,
            "end": 785,
            "text": "Vous pointez le moins de radiotélescopes, il y a de la molécule d'eau partout."
        },
        {
            "start": 785,
            "end": 790,
            "text": "Ce n'est pas de l'eau liquide, ce n'est pas des océans, mais vous avez des molécules d'eau partout."
        },
        {
            "start": 790,
            "end": 794,
            "text": "C'est dans ces cocons de gaz que se forment les étoiles."
        },
        {
            "start": 794,
            "end": 801,
            "text": "Par instabilité gravitationnelle, votre nuage se met à s'effondrer et puis se met à former des étoiles."
        },
        {
            "start": 801,
            "end": 804,
            "text": "Ce sont des processus qu'on comprend à peu près."
        },
        {
            "start": 804,
            "end": 812,
            "text": "La taille, c'est quelques centaines d'années-lumière, voire plus, quelques milliers d'années-lumière, l'échelle de l'image."
        },
        {
            "start": 812,
            "end": 819,
            "text": "C'est le ciel vu par Planck, mais ce sont des zooms à gauche et à droite obtenus par le Hubble."
        },
        {
            "start": 819,
            "end": 823,
            "text": "Si on va encore un peu plus loin, on va dans les galaxies."
        },
        {
            "start": 823,
            "end": 826,
            "text": "Les galaxies sont très grandes."
        },
        {
            "start": 826,
            "end": 835,
            "text": "La taille, ici, serait quelque chose comme un demi-million d'années-lumière ou un quart de million d'années-lumière."
        },
        {
            "start": 835,
            "end": 838,
            "text": "Ce sont des vraies images, mais des fausses couleurs."
        },
        {
            "start": 838,
            "end": 841,
            "text": "On les voit par le satellite Spitzer dans l'infrarouge."
        },
        {
            "start": 841,
            "end": 843,
            "text": "Ce satellite est cher à mon cœur."
        },
        {
            "start": 843,
            "end": 849,
            "text": "Quand je travaillais pour la NASA aux États-Unis, j'ai vu lancer ce satellite, j'ai travaillé sur ses instruments."
        },
        {
            "start": 849,
            "end": 856,
            "text": "J'ai participé à la prise de ces images il y a très longtemps, il y a quasiment plus de 15 ans."
        },
        {
            "start": 856,
            "end": 861,
            "text": "Si mon système de vote marche, je vais vous poser une question."
        },
        {
            "start": 861,
            "end": 865,
            "text": "Selon vous, quel est le composant principal dans une galaxie ?"
        },
        {
            "start": 865,
            "end": 868,
            "text": "Est-ce des étoiles, des trous noirs ?"
        },
        {
            "start": 868,
            "end": 872,
            "text": "On va essayer de le faire fonctionner, ce petit bidule."
        },
        {
            "start": 872,
            "end": 873,
            "text": "Voilà."
        },
        {
            "start": 873,
            "end": 880,
            "text": "Je vais essayer de cacher... Vous pouvez voter."
        },
        {
            "start": 880,
            "end": 887,
            "text": "Si vous pensez que dans une galaxie, le plus important en masse, vous n'avez qu'un seul choix, ce sont les étoiles."
        },
        {
            "start": 887,
            "end": 890,
            "text": "Vous tapez A, B, etc."
        },
        {
            "start": 890,
            "end": 892,
            "text": "Si vous êtes par SMS, vous envoyez la lettre."
        },
        {
            "start": 892,
            "end": 894,
            "text": "Est-ce que ça marche ?"
        },
        {
            "start": 894,
            "end": 896,
            "text": "Je vois zéro réponse."
        },
        {
            "start": 896,
            "end": 898,
            "text": "C'est bon, ça marche."
        },
        {
            "start": 898,
            "end": 901,
            "text": "Merci, vous sauvez ma matinée."
        },
        {
            "start": 901,
            "end": 904,
            "text": "C'est vous qu'on doit remercier ?"
        },
        {
            "start": 904,
            "end": 906,
            "text": "Bon, merci."
        },
        {
            "start": 906,
            "end": 918,
            "text": "Selon vous, même si je pense que beaucoup connaissent la réponse, quel est le composant principal... J'ai mis pourcentage, mais je devrais corriger la question."
        },
        {
            "start": 918,
            "end": 921,
            "text": "Quel est le composant principal dans une galaxie, en masse ?"
        },
        {
            "start": 921,
            "end": 933,
            "text": "Ce sont des étoiles A, matière interstellaire, nébulose et gaz B, trous noirs C, planète D ou matière noire E. Réfléchissez, vous pouvez répondre ce que vous voulez."
        },
        {
            "start": 933,
            "end": 937,
            "text": "J'utilise ça avec mes étudiants en amphi, à Paris-Sud, à Orsay."
        },
        {
            "start": 937,
            "end": 942,
            "text": "Ils sont moins nombreux que vous, mais ils sont bien la moitié."
        },
        {
            "start": 942,
            "end": 945,
            "text": "Ça permet de voir s'ils suivent bien."
        },
        {
            "start": 945,
            "end": 952,
            "text": "Je vais voir si vous suivez bien."
        },
        {
            "start": 952,
            "end": 956,
            "text": "On va dévoiler les réponses, on est là pour parler de cosmologie."
        },
        {
            "start": 956,
            "end": 961,
            "text": "Vous pouvez toujours répondre."
        },
        {
            "start": 961,
            "end": 967,
            "text": "Suspense insoutenable."
        },
        {
            "start": 967,
            "end": 969,
            "text": "Ah oui, alors, c'est pas comme hier."
        },
        {
            "start": 969,
            "end": 976,
            "text": "Donc, alors... Ah oui, c'est pas la question que je voulais... Je me suis un peu trompé."
        },
        {
            "start": 976,
            "end": 983,
            "text": "C'est ce que je donne à mes étudiants, mais je voulais faire un truc comme hier avec les pourcentages."
        },
        {
            "start": 983,
            "end": 984,
            "text": "Je suis arrivé vite."
        },
        {
            "start": 984,
            "end": 988,
            "text": "Il fallait donner un pourcentage, c'était bien écrit."
        },
        {
            "start": 988,
            "end": 990,
            "text": "C'est pour ça qu'il y a pas beaucoup de réponses."
        },
        {
            "start": 990,
            "end": 997,
            "text": "Je proposais de donner des pourcentages, 10 % de gaz, de matière noire, etc."
        },
        {
            "start": 997,
            "end": 998,
            "text": "Et ça s'accumulait."
        },
        {
            "start": 998,
            "end": 1001,
            "text": "J'essaierai de faire mieux la prochaine fois."
        },
        {
            "start": 1001,
            "end": 1004,
            "text": "Mais on va quand même regarder les réponses."
        },
        {
            "start": 1004,
            "end": 1007,
            "text": "Mais je pense qu'elles ont pas été réinitialisées."
        },
        {
            "start": 1007,
            "end": 1012,
            "text": "Je pense que ça correspond à ce que racontaient mes étudiants."
        },
        {
            "start": 1012,
            "end": 1015,
            "text": "Les étoiles, c'est ce qu'on voit dans les galaxies."
        },
        {
            "start": 1015,
            "end": 1019,
            "text": "Donc, de fait, elles composent une grande partie des galaxies."
        },
        {
            "start": 1019,
            "end": 1020,
            "text": "C'est indéniable."
        },
        {
            "start": 1020,
            "end": 1029,
            "text": "Les nébuleuses, en revanche, composent qu'une toute petite partie."
        },
        {
            "start": 1029,
            "end": 1033,
            "text": "Le gaz et les nébuleuses reposent une toute petite partie."
        },
        {
            "start": 1033,
            "end": 1036,
            "text": "C'est quelque chose comme 1 %."
        },
        {
            "start": 1036,
            "end": 1044,
            "text": "C'est très important parce que les nébuleuses, le gaz, la poussière, changent la couleur des galaxies et leur émission de lumière."
        },
        {
            "start": 1044,
            "end": 1047,
            "text": "C'est très important pour nous qui observons la lumière."
        },
        {
            "start": 1047,
            "end": 1052,
            "text": "Les planètes sont importantes pour nous, mais en termes de masse, c'est rien du tout."
        },
        {
            "start": 1052,
            "end": 1055,
            "text": "Ce qui compte dans les galaxies, c'est la matière noire."
        },
        {
            "start": 1055,
            "end": 1060,
            "text": "La matière noire, c'est 80 % de leur composition en masse."
        },
        {
            "start": 1060,
            "end": 1064,
            "text": "Le reste étant essentiellement des étoiles."
        },
        {
            "start": 1064,
            "end": 1067,
            "text": "Il y a des trous noirs, mais c'est négligeable en masse."
        },
        {
            "start": 1067,
            "end": 1071,
            "text": "C'est un mystère, on ne sait pas ce que c'est que la matière noire."
        },
        {
            "start": 1071,
            "end": 1077,
            "text": "On arrive à tracer sa répartition, maintenant, avec plein de méthodes, du lentillage faible, etc."
        },
        {
            "start": 1077,
            "end": 1079,
            "text": "Je reviendrai à la fin pour Euclide."
        },
        {
            "start": 1079,
            "end": 1083,
            "text": "Mais c'est un mystère."
        },
        {
            "start": 1083,
            "end": 1088,
            "text": "Des alternatives à la matière noire, c'est de modifier les théories de gravité."
        },
        {
            "start": 1088,
            "end": 1091,
            "text": "Modifier la relativité générale, par exemple."
        },
        {
            "start": 1091,
            "end": 1093,
            "text": "C'est un gros travail."
        },
        {
            "start": 1093,
            "end": 1095,
            "text": "Des collègues s'y attellent."
        },
        {
            "start": 1095,
            "end": 1104,
            "text": "Je ne suis pas spécialiste, mais les résultats ne sont pas hyper probants pour expliquer ce qu'on va discuter dans un instant, ce qui se passe au tout début de l'Univers."
        },
        {
            "start": 1104,
            "end": 1110,
            "text": "Ces théories modifiées peuvent expliquer ce qui se passe dans les galaxies, mais pas au tout début de l'Univers."
        },
        {
            "start": 1110,
            "end": 1113,
            "text": "Les galaxies sont très grandes, composées de matière noire."
        },
        {
            "start": 1113,
            "end": 1129,
            "text": "Si on voulait représenter le système solaire à cette échelle, sur cet écran, cette image fait à peu près deux mètres, la taille du système solaire ne serait pas un pixel, un micron, mais la taille d'un atome."
        },
        {
            "start": 1129,
            "end": 1135,
            "text": "Le système solaire est tout petit, mais rapporté à cette échelle, c'est un atome sur l'écran."
        },
        {
            "start": 1135,
            "end": 1136,
            "text": "C'est tout petit."
        },
        {
            "start": 1136,
            "end": 1139,
            "text": "Nous ne sommes peu de choses, mais c'est confirmé."
        },
        {
            "start": 1139,
            "end": 1141,
            "text": "On va à plus grande échelle."
        },
        {
            "start": 1141,
            "end": 1143,
            "text": "Ce sont les amas de galaxies."
        },
        {
            "start": 1143,
            "end": 1147,
            "text": "Sur cette image réelle, ce sont des galaxies, sauf quatre étoiles."
        },
        {
            "start": 1147,
            "end": 1152,
            "text": "Une, deux, trois, quatre, qui sont des étoiles d'avant-plan de notre Voie lactée."
        },
        {
            "start": 1152,
            "end": 1158,
            "text": "La taille de cette image serait de l'ordre de 1 ou 2 millions, plutôt 2 millions d'années-lumière."
        },
        {
            "start": 1158,
            "end": 1160,
            "text": "Là, vous avez des centaines de galaxies."
        },
        {
            "start": 1160,
            "end": 1163,
            "text": "Ce sont les plus grosses structures de l'Univers."
        },
        {
            "start": 1163,
            "end": 1168,
            "text": "Ça pèse typiquement 10 puissance 15 masse solaire, donc un million de milliards d'étoiles."
        },
        {
            "start": 1168,
            "end": 1178,
            "text": "Sachant qu'une galaxie, c'est typiquement 10 puissance 9, 10, 11 masse solaire, ça dépend du type de galaxies, donc des milliards d'étoiles."
        },
        {
            "start": 1178,
            "end": 1181,
            "text": "Voilà les très grandes structures qu'on observe aujourd'hui."
        },
        {
            "start": 1181,
            "end": 1187,
            "text": "Et puis, quand vous allez le plus loin possible, c'est cette image, le fond cosmologique."
        },
        {
            "start": 1187,
            "end": 1191,
            "text": "C'est le plus loin que nous puissions observer avec de la lumière."
        },
        {
            "start": 1191,
            "end": 1198,
            "text": "C'est cette image prise par le satellite Planck, qu'on a relâchée il y a quelques mois, même si Planck a fonctionné il y a quelques années."
        },
        {
            "start": 1198,
            "end": 1201,
            "text": "Ça représente les petites fluctuations du fond cosmologique."
        },
        {
            "start": 1201,
            "end": 1203,
            "text": "Je vais en parler maintenant."
        },
        {
            "start": 1203,
            "end": 1208,
            "text": "On a mis une zone grisée, pour dire qu'on a triché dans cette zone à l'intérieur."
        },
        {
            "start": 1208,
            "end": 1211,
            "text": "À l'intérieur de cette zone, la veau lactée nous gêne."
        },
        {
            "start": 1211,
            "end": 1220,
            "text": "On a interpellé le signal pour faire une jolie image, mais nous, en faisant l'analyse scientifique, on exclut ces zones grisées."
        },
        {
            "start": 1220,
            "end": 1223,
            "text": "Mais ça fait une belle image."
        },
        {
            "start": 1223,
            "end": 1227,
            "text": "Nous utilisons de la lumière, nous, les astrophysiciens."
        },
        {
            "start": 1227,
            "end": 1228,
            "text": "Je vais enlever ce siège."
        },
        {
            "start": 1228,
            "end": 1231,
            "text": "Il y a d'autres vecteurs de l'information qui sont là."
        },
        {
            "start": 1231,
            "end": 1236,
            "text": "Il y a les astroparticules, les ondes gravitationnelles, les neutrinos."
        },
        {
            "start": 1236,
            "end": 1241,
            "text": "Je me concentrerai sur la lumière, parce que historiquement, c'est pluvieux."
        },
        {
            "start": 1241,
            "end": 1244,
            "text": "Et ça marche encore pas mal."
        },
        {
            "start": 1244,
            "end": 1251,
            "text": "Voici une image d'une belle galaxie d'Andromède prise dans le domaine visible, en ultraviolet et en infrarouge."
        },
        {
            "start": 1251,
            "end": 1254,
            "text": "On peut se demander quelle est la vraie couleur de la galaxie."
        },
        {
            "start": 1254,
            "end": 1259,
            "text": "Il n'y a pas de vraie couleur, il y a des couleurs, des fréquences, des longueurs d'onde."
        },
        {
            "start": 1259,
            "end": 1262,
            "text": "La galaxie présente un visage différent selon les trois longueurs d'onde."
        },
        {
            "start": 1262,
            "end": 1266,
            "text": "Dans le visible, vous voyez les étoiles et la poussière."
        },
        {
            "start": 1266,
            "end": 1270,
            "text": "La poussière, c'est tous ces nuages de gaz qui absorbent la lumière visible."
        },
        {
            "start": 1270,
            "end": 1271,
            "text": "Vous avez des voisins, ici et là."
        },
        {
            "start": 1271,
            "end": 1273,
            "text": "Là, vous voyez la poussière qui absorbe."
        },
        {
            "start": 1273,
            "end": 1281,
            "text": "Dans l'ultraviolet, vous voyez les jeunes étoiles, très massives et très chaudes, qui viennent juste de naître, mais qui sont nées hors de la poussière."
        },
        {
            "start": 1281,
            "end": 1283,
            "text": "Si il y a de la poussière, vous ne les voyez pas."
        },
        {
            "start": 1283,
            "end": 1285,
            "text": "C'est pour ça que vous avez des zones sombres."
        },
        {
            "start": 1285,
            "end": 1289,
            "text": "C'est probablement qu'il y a de la poussière qui cache."
        },
        {
            "start": 1289,
            "end": 1291,
            "text": "Là, vous voyez un peu mieux sur les côtés."
        },
        {
            "start": 1291,
            "end": 1303,
            "text": "Dans l'infrarouge, proche et moyen, vous voyez en bleu, en fausse couleur, les 3,6 microns d'un speedzer, les vieilles étoiles, qui sont froides, à 3000 degrés à leur surface, qui se concentrent surtout au centre."
        },
        {
            "start": 1303,
            "end": 1310,
            "text": "Et en rouge, c'est le 24 ou le 8 microns, je me souviens plus, c'est la poussière chauffée par les étoiles qui sont en train de naître, mais cachées dans la poussière."
        },
        {
            "start": 1310,
            "end": 1317,
            "text": "Avec une vision multicouleur, vous arrivez à avoir une carte d'identité de votre objet astrophysique."
        },
        {
            "start": 1317,
            "end": 1319,
            "text": "On ne peut pas y aller, c'est ça le problème."
        },
        {
            "start": 1319,
            "end": 1321,
            "text": "Il faut se débrouiller avec ce qu'on a."
        },
        {
            "start": 1321,
            "end": 1322,
            "text": "La lumière est un très bon vecteur."
        },
        {
            "start": 1322,
            "end": 1326,
            "text": "On fait ça aussi avec les rayons X, avec tout le spectre électromagnétique."
        },
        {
            "start": 1326,
            "end": 1329,
            "text": "Mais là, j'ai utilisé ces images car c'était particulièrement visible."
        },
        {
            "start": 1329,
            "end": 1351,
            "text": "Maintenant qu'on sait que la question... Enfin, on va se poser, on utilise la lumière, on n'a qu'un seul univers, on a une méthode scientifique, comment on va mettre tout ça ensemble pour répondre aux questions de quelle est l'origine de l'univers, ou quelles sont les origines de l'univers, et comment a-t-il évolué, et comment on s'y prend pour avoir une carte d'identité ultra précise."
        },
        {
            "start": 1351,
            "end": 1361,
            "text": "Les deux questions que les scientifiques essaient de résoudre, en tout cas, les deux questions qui se posent, on n'a pas les réponses sur tout, c'est deux familles de questions."
        },
        {
            "start": 1361,
            "end": 1364,
            "text": "Au début, pourquoi l'univers était très homogène ?"
        },
        {
            "start": 1364,
            "end": 1367,
            "text": "Homogène, ça veut dire pour simplifier le même partout."
        },
        {
            "start": 1367,
            "end": 1372,
            "text": "Et deuxièmement, pourquoi aujourd'hui l'univers est très hétérogène, très contrasté ?"
        },
        {
            "start": 1372,
            "end": 1376,
            "text": "Peut-être que vous vous demandez ce qu'il raconte avec son univers homogène."
        },
        {
            "start": 1376,
            "end": 1377,
            "text": "C'est quoi cette question ?"
        },
        {
            "start": 1377,
            "end": 1379,
            "text": "Je ne me pose pas la première question."
        },
        {
            "start": 1379,
            "end": 1380,
            "text": "Pourquoi l'univers est là ?"
        },
        {
            "start": 1380,
            "end": 1388,
            "text": "Pourquoi l'univers est là, c'est plus philosophique que scientifique, même si c'est très intéressant, mais je n'ai pas de réponse."
        },
        {
            "start": 1388,
            "end": 1395,
            "text": "Quand on fait des observations de ce fameux fond cosmologique, je vais y venir, on se rend compte que ce fond cosmologique est très homogène."
        },
        {
            "start": 1395,
            "end": 1400,
            "text": "Il est tellement homogène qu'on a mis beaucoup de temps à découvrir qu'il était un peu inhomogène."
        },
        {
            "start": 1400,
            "end": 1405,
            "text": "Ces petites variations sont plus petites qu'une partie pour 100 000."
        },
        {
            "start": 1405,
            "end": 1415,
            "text": "C'est très homogène, c'est un peu comme un lac ultraplat et calme, et vous avez des petites vaguelettes qui sont lors du cent millième de la surface."
        },
        {
            "start": 1415,
            "end": 1417,
            "text": "Vous ne les voyez pas."
        },
        {
            "start": 1417,
            "end": 1422,
            "text": "Ça nous prouve que 370 000 ans après le Big Bang, l'univers était ultra homogène."
        },
        {
            "start": 1422,
            "end": 1424,
            "text": "La matière et la lumière sont couplées."
        },
        {
            "start": 1424,
            "end": 1431,
            "text": "Si la lumière nous dit qu'il y a des petites fluctuations, hyper petites, c'est-à-dire que les fluctuations de densité sont hyper petites."
        },
        {
            "start": 1431,
            "end": 1436,
            "text": "L'univers n'était pas très contrasté, il était tout lisse, en quelque sorte, homogène."
        },
        {
            "start": 1436,
            "end": 1442,
            "text": "On a du mal à comprendre, parce que l'univers, entre le Big Bang et 370 000 ans, il s'est passé plein de choses."
        },
        {
            "start": 1442,
            "end": 1451,
            "text": "Si vous laissez un gaz s'étendre dans une pièce, c'est seulement au bout d'un moment qu'il sera homogéné en température, en pression, etc."
        },
        {
            "start": 1451,
            "end": 1454,
            "text": "Là, on pense que le temps n'était pas si grand que ça."
        },
        {
            "start": 1454,
            "end": 1458,
            "text": "Il aurait pu y avoir des variations de température, de pression, de densité."
        },
        {
            "start": 1458,
            "end": 1460,
            "text": "Non, l'univers est super homogène."
        },
        {
            "start": 1460,
            "end": 1468,
            "text": "C'était une question très épineuse, parce qu'on n'avait pas de mécanisme pour résoudre ce problème."
        },
        {
            "start": 1468,
            "end": 1470,
            "text": "La physique, a priori, ne prédisait pas ça."
        },
        {
            "start": 1470,
            "end": 1474,
            "text": "Les gens, dans les années 80 et un peu plus tard, ont invoqué des modèles d'inflation cosmique."
        },
        {
            "start": 1474,
            "end": 1476,
            "text": "Ce n'est pas une baguette magique."
        },
        {
            "start": 1476,
            "end": 1479,
            "text": "Quand vous avez un problème, vous essayez de trouver une solution."
        },
        {
            "start": 1479,
            "end": 1481,
            "text": "Les gens commencent à regarder."
        },
        {
            "start": 1481,
            "end": 1484,
            "text": "Cette solution est super élégante, super simple à calculer."
        },
        {
            "start": 1484,
            "end": 1485,
            "text": "Elle devient très populaire."
        },
        {
            "start": 1485,
            "end": 1486,
            "text": "Ça ne veut pas dire que c'est vrai."
        },
        {
            "start": 1486,
            "end": 1488,
            "text": "Il n'y a pas de vérité en science."
        },
        {
            "start": 1488,
            "end": 1491,
            "text": "Ça veut dire que ça marche et qu'on est content."
        },
        {
            "start": 1491,
            "end": 1493,
            "text": "Il faut se souvenir de la démarche scientifique."
        },
        {
            "start": 1493,
            "end": 1496,
            "text": "Vous avez des théories que vous confrontez aux données."
        },
        {
            "start": 1496,
            "end": 1499,
            "text": "Si les données ne vous tuent pas vos théories, vous gardez la théorie."
        },
        {
            "start": 1499,
            "end": 1501,
            "text": "Est-ce que c'est la meilleure ?"
        },
        {
            "start": 1501,
            "end": 1502,
            "text": "Je n'en sais rien."
        },
        {
            "start": 1502,
            "end": 1505,
            "text": "La meilleure reste jusqu'à ce qu'il y en ait une nouvelle."
        },
        {
            "start": 1505,
            "end": 1515,
            "text": "L'inflation a ce très bon goût de partir des fluctuations quantiques de l'Univers, qui sont relativement homogènes, et de plaquer à l'échelle macroscopique toutes ces petites fluctuations quantiques."
        },
        {
            "start": 1515,
            "end": 1521,
            "text": "Avec les mains et d'un point de vue sensible, l'Univers n'a pas le temps d'être hétérogène."
        },
        {
            "start": 1521,
            "end": 1529,
            "text": "Il est tellement étendu, très rapidement, en plus petit que 10,35 secondes, sur de très grandes échelles, qu'il n'a pas le loisir de dire qu'il va être plus ou moins dense."
        },
        {
            "start": 1529,
            "end": 1531,
            "text": "Il est tout de suite projeté sur de très grandes échelles."
        },
        {
            "start": 1531,
            "end": 1534,
            "text": "L'inflation résout ça, très simplement, très élégamment."
        },
        {
            "start": 1534,
            "end": 1536,
            "text": "Donc, ça marche, on comprend."
        },
        {
            "start": 1536,
            "end": 1538,
            "text": "Après, est-ce que c'est vraiment comme ça ?"
        },
        {
            "start": 1538,
            "end": 1541,
            "text": "On ne sait pas encore, mais c'est peut-être pas ça la question."
        },
        {
            "start": 1541,
            "end": 1543,
            "text": "On ne saura jamais, on n'y était pas."
        },
        {
            "start": 1543,
            "end": 1549,
            "text": "Il faut avoir une théorie scientifique basée sur une physique que l'on comprend, que l'on peut prédire, et d'évoquer des scénarios."
        },
        {
            "start": 1549,
            "end": 1555,
            "text": "Par exemple, l'inflation, qui est arrivée bien avant une partie de ces détections."
        },
        {
            "start": 1555,
            "end": 1557,
            "text": "En même temps, ça a été un aller-retour."
        },
        {
            "start": 1557,
            "end": 1562,
            "text": "Mais ces prédictions ont été défiées par les données, notamment du satellite Planck."
        },
        {
            "start": 1562,
            "end": 1563,
            "text": "C'est la démarche scientifique."
        },
        {
            "start": 1563,
            "end": 1567,
            "text": "Vous avez des données, une théorie, même si elle était calée pour que ça marche."
        },
        {
            "start": 1567,
            "end": 1571,
            "text": "Mais est-ce que votre théorie, dans ces derniers retranchements des toutes dernières données, survit ?"
        },
        {
            "start": 1571,
            "end": 1573,
            "text": "Vous serez étonnés d'apprendre que oui."
        },
        {
            "start": 1573,
            "end": 1576,
            "text": "Cette théorie aussi farfelue... En tout cas, selon moi, je ne suis pas théoricien."
        },
        {
            "start": 1576,
            "end": 1581,
            "text": "Cette théorie aussi farfelue de l'inflation résiste très bien à toutes les données jusqu'à aujourd'hui."
        },
        {
            "start": 1581,
            "end": 1582,
            "text": "Donc, on prend."
        },
        {
            "start": 1582,
            "end": 1583,
            "text": "Donc, le modèle d'inflation."
        },
        {
            "start": 1583,
            "end": 1591,
            "text": "Et ensuite, comment, à partir des petites fluctuations qui sont ici de densité, on arrive aux grands amas de galaxies, aux galaxies, aux étoiles, aux planètes, etc., et à nous ?"
        },
        {
            "start": 1591,
            "end": 1596,
            "text": "Eh bien, ça pourrait être un problème si on ne prend en compte que la matière visible."
        },
        {
            "start": 1596,
            "end": 1601,
            "text": "On sait depuis les années 30 qu'il y a de la matière noire, ou en tout cas, qu'il y a un problème avec la matière ou la gravité."
        },
        {
            "start": 1601,
            "end": 1603,
            "text": "On le résout en ce moment en disant qu'il y a de la matière noire."
        },
        {
            "start": 1603,
            "end": 1606,
            "text": "Mais si vous ne mettez pas de matière noire, ça ne marche pas."
        },
        {
            "start": 1606,
            "end": 1611,
            "text": "C'est pour moi l'argument le plus fort pour la présence d'une matière invisible et non baryonique."
        },
        {
            "start": 1611,
            "end": 1615,
            "text": "Si vous prenez les petites fluctuations et que vous laissez dérouler le temps, il n'y a pas assez de temps."
        },
        {
            "start": 1615,
            "end": 1617,
            "text": "Pourtant, c'est long, 13,8 milliards d'années."
        },
        {
            "start": 1617,
            "end": 1622,
            "text": "Vous n'avez pas assez de temps pour former des gros amas de galaxies, des grosses galaxies, des étoiles, etc."
        },
        {
            "start": 1622,
            "end": 1625,
            "text": "Il faut vraiment beaucoup de matière dès le début."
        },
        {
            "start": 1625,
            "end": 1627,
            "text": "Donc, il faut cette matière noire."
        },
        {
            "start": 1627,
            "end": 1629,
            "text": "On n'y arrive pas autrement."
        },
        {
            "start": 1629,
            "end": 1631,
            "text": "On a invoqué le modèle lambda-CDM."
        },
        {
            "start": 1631,
            "end": 1636,
            "text": "Lambda signifie constante cosmologique qui traduit l'expansion accélérée de l'Univers."
        },
        {
            "start": 1636,
            "end": 1639,
            "text": "Je ne l'ai pas évoqué, mais l'Univers est en expansion accélérée."
        },
        {
            "start": 1639,
            "end": 1641,
            "text": "Ce sont les observations faites depuis 20 ans."
        },
        {
            "start": 1641,
            "end": 1645,
            "text": "CDM pour Cold Dark Matter, donc matière noire froide."
        },
        {
            "start": 1645,
            "end": 1650,
            "text": "C'est cette fameuse matière noire qui aide à la structuration des grandes structures."
        },
        {
            "start": 1650,
            "end": 1653,
            "text": "Cold, froid, ça veut dire non relativiste."
        },
        {
            "start": 1653,
            "end": 1655,
            "text": "Il ne faut pas être relativiste, sinon ça ne marche pas."
        },
        {
            "start": 1655,
            "end": 1661,
            "text": "La matière noire est très vite non relativiste et permet à la matière baryonique de s'accréter."
        },
        {
            "start": 1661,
            "end": 1663,
            "text": "On essaie de répondre à ces questions."
        },
        {
            "start": 1663,
            "end": 1670,
            "text": "On a des modèles, mais qui ont plein de paramètres libres, qui peuvent être ajustés et qui ont parfois des prédictions sur un spectre très large."
        },
        {
            "start": 1670,
            "end": 1671,
            "text": "L'idée, c'est de faire le ménage."
        },
        {
            "start": 1671,
            "end": 1673,
            "text": "C'est pour ça qu'on a fait le satellite Planck."
        },
        {
            "start": 1673,
            "end": 1681,
            "text": "Le fonds cosmologique, je vais vous passer quelques instants là-dessus, est une observation importante."
        },
        {
            "start": 1681,
            "end": 1682,
            "text": "Ce n'est pas la seule."
        },
        {
            "start": 1682,
            "end": 1686,
            "text": "Il y a des gens qui font des relevés de galaxies, des gens qui font des corrélations de galaxies."
        },
        {
            "start": 1686,
            "end": 1688,
            "text": "C'est une des mesures importantes."
        },
        {
            "start": 1688,
            "end": 1691,
            "text": "J'insiste, j'ai travaillé dessus avec Planck, mais il n'y a pas que celle-là."
        },
        {
            "start": 1691,
            "end": 1695,
            "text": "Cette idée du fonds cosmologique est très naturelle."
        },
        {
            "start": 1695,
            "end": 1698,
            "text": "C'est ce que j'essaie de vous présenter en une minute et demie."
        },
        {
            "start": 1698,
            "end": 1708,
            "text": "Il y a très longtemps, depuis l'aube de l'humanité, les gens se sont probablement posés la question, mais on a les publications qu'à partir du XVIe siècle."
        },
        {
            "start": 1708,
            "end": 1713,
            "text": "Les gens se sont demandé... Les publications sont toujours importantes pour les scientifiques."
        },
        {
            "start": 1713,
            "end": 1715,
            "text": "Pourquoi la nuit est-elle noire ?"
        },
        {
            "start": 1715,
            "end": 1716,
            "text": "Je pourrais vous en parler des heures."
        },
        {
            "start": 1716,
            "end": 1718,
            "text": "Pourquoi la nuit est noire ?"
        },
        {
            "start": 1718,
            "end": 1723,
            "text": "Cette question peut paraître saugrenue, mais si on y réfléchit un instant, elle n'est pas si saugrenue que ça."
        },
        {
            "start": 1723,
            "end": 1726,
            "text": "Si vous regardez le ciel étoilé, il y a plein d'étoiles."
        },
        {
            "start": 1726,
            "end": 1727,
            "text": "C'est noir entre les étoiles."
        },
        {
            "start": 1727,
            "end": 1730,
            "text": "Maintenant, si on réfléchit, vous avez vu les images de galaxies."
        },
        {
            "start": 1730,
            "end": 1732,
            "text": "Il y a plein de galaxies dans l'Univers."
        },
        {
            "start": 1732,
            "end": 1738,
            "text": "On peut se dire que n'importe quelle ligne de visée que l'on pointe avec notre doigt tombera sur une galaxie, donc sur une étoile."
        },
        {
            "start": 1738,
            "end": 1747,
            "text": "Si on admet cette hypothèse, qui est fausse, mais peu importe, que dans chaque direction, à un moment, on tombera bien sur une étoile, pourquoi la nuit est-elle noire ?"
        },
        {
            "start": 1747,
            "end": 1751,
            "text": "Elle devrait être tapissée d'un fond lumineux d'étoiles ou de galaxies."
        },
        {
            "start": 1751,
            "end": 1752,
            "text": "Or, la nuit est noire."
        },
        {
            "start": 1752,
            "end": 1759,
            "text": "Il y a un paradoxe, comme tous les paradoxes, un problème mal posé, connu sous le nom de paradoxe d'Alberts, je ne sais plus où je l'ai mis."
        },
        {
            "start": 1759,
            "end": 1769,
            "text": "Alberts, qui évoquait l'apparente contradiction entre l'infinitude de l'Univers et du nombre d'étoiles et la nuit noire."
        },
        {
            "start": 1769,
            "end": 1772,
            "text": "S'il y a une infinité d'étoiles, la nuit devrait être brillante."
        },
        {
            "start": 1772,
            "end": 1777,
            "text": "C'est le premier à trouver une explication qui n'est pas scientifique."
        },
        {
            "start": 1777,
            "end": 1787,
            "text": "C'est Edgar Allan Poe, qui n'est pas scientifique, que vous connaissez peut-être, dans son poème en prose, Eureka, de 1848, qui est le premier à donner une explication considérée scientifiquement valide."
        },
        {
            "start": 1787,
            "end": 1790,
            "text": "Il ne pouvait pas la prouver, il n'était pas scientifique."
        },
        {
            "start": 1790,
            "end": 1794,
            "text": "Mais il a dit que si les étoiles ne sont pas éternelles, ça résout le problème."
        },
        {
            "start": 1794,
            "end": 1800,
            "text": "Il peut y avoir une infinité d'étoiles, mais si elles vivent qu'une fraction de l'âge de l'Univers, elles s'éteignent."
        },
        {
            "start": 1800,
            "end": 1804,
            "text": "La grande baignoire de l'Univers ne se remplira pas de lumière."
        },
        {
            "start": 1804,
            "end": 1807,
            "text": "Une baignoire remplie d'eau, ça déborde quand il y a trop de lumière."
        },
        {
            "start": 1807,
            "end": 1812,
            "text": "Comme les étoiles s'éteignent, à certains moments, l'Univers ne se remplit pas de lumière."
        },
        {
            "start": 1812,
            "end": 1821,
            "text": "Ça a été démontré par Lord Kelvin, qui est quelqu'un de très respecté en physique, qui a démontré par le calcul que c'était ça."
        },
        {
            "start": 1821,
            "end": 1829,
            "text": "Il ne faut pas oublier qu'avant les années 1930, les gens pensaient que l'Univers était éternel, immuable."
        },
        {
            "start": 1829,
            "end": 1834,
            "text": "Les gens ne se disaient pas, il n'y avait pas de données qui permettaient de contredire ça."
        },
        {
            "start": 1834,
            "end": 1836,
            "text": "Il faut se remettre dans ce contexte."
        },
        {
            "start": 1836,
            "end": 1850,
            "text": "Lord Kelvin, bien qu'il n'était pas au courant des processus physiques ayant lieu à l'intérieur des étoiles, fusion thermonucléaire, il s'est trompé d'un facteur 100 sur l'âge des étoiles."
        },
        {
            "start": 1850,
            "end": 1854,
            "text": "Néanmoins, ce facteur a suffi à prouver que les étoiles ne vivaient pas à un temps infini."
        },
        {
            "start": 1854,
            "end": 1856,
            "text": "Fin du XIXe siècle."
        },
        {
            "start": 1856,
            "end": 1861,
            "text": "Je crois que ce sont ses conférences aux États-Unis en 1897 et qu'il a publiées en 1907."
        },
        {
            "start": 1861,
            "end": 1868,
            "text": "Donc il a dit, fin du jeu, fin du game, comme disait... La nuit n'est pas noire, les étoiles ont une durée de vie finie, tout va bien."
        },
        {
            "start": 1868,
            "end": 1872,
            "text": "Arrive Hubble, fin des années 1920."
        },
        {
            "start": 1872,
            "end": 1874,
            "text": "Il découvre que les galaxies s'éloignent de nous."
        },
        {
            "start": 1874,
            "end": 1878,
            "text": "Je fais ça à mes étudiants aussi, je leur fais faire la loi de Hubble."
        },
        {
            "start": 1878,
            "end": 1881,
            "text": "Personne n'a demandé à ce que les galaxies s'éloignent de nous."
        },
        {
            "start": 1881,
            "end": 1887,
            "text": "On observe quasiment toutes, à part les proches attirés par nous, que toutes les galaxies s'éloignent de nous."
        },
        {
            "start": 1887,
            "end": 1893,
            "text": "Comment vous faites un modèle physique qui explique, ou qui décrit le fait que toutes les galaxies s'éloignent de nous ?"
        },
        {
            "start": 1893,
            "end": 1896,
            "text": "Vous pouvez dire que vous êtes le centre de l'Univers."
        },
        {
            "start": 1896,
            "end": 1899,
            "text": "Les humains ont l'habitude de faire ça depuis la nuit des temps."
        },
        {
            "start": 1899,
            "end": 1903,
            "text": "On peut garder ça comme explication, mais ce n'est pas l'approche qu'on va prendre ici."
        },
        {
            "start": 1903,
            "end": 1906,
            "text": "Ça viole le principe cosmologique de tout être pareil partout."
        },
        {
            "start": 1906,
            "end": 1909,
            "text": "On arrive rapidement à l'idée qu'il y a un univers en expansion."
        },
        {
            "start": 1909,
            "end": 1912,
            "text": "C'est l'espace-temps qui se dilate à très grande échelle."
        },
        {
            "start": 1912,
            "end": 1916,
            "text": "Ça ne nous concerne pas, ni la distance Terre-Lune, mais que les très grandes échelles."
        },
        {
            "start": 1916,
            "end": 1919,
            "text": "Vous avez un univers en expansion, tout va bien."
        },
        {
            "start": 1919,
            "end": 1922,
            "text": "La théorie d'Einstein était prête."
        },
        {
            "start": 1922,
            "end": 1932,
            "text": "L'abbé le Maître, Friedmann, Robertson, Walker, tout un tas de travaux théoriques ont permis de donner un cadre théorique à cette expansion de l'Univers qui pouvait être paramétrisée."
        },
        {
            "start": 1932,
            "end": 1939,
            "text": "Mais il y a des esprits chagrins comme Gamow qui se sont dit qu'il y a la théorie, l'expansion, on ne sait pas pourquoi, mais ça marche."
        },
        {
            "start": 1939,
            "end": 1950,
            "text": "Si on remet le film à l'envers de cette expansion de l'Univers, si on met le temps vers les temps passés, l'Univers était plus petit, je n'aime pas ce terme, mais on n'a pas beaucoup de temps, on va faire vite."
        },
        {
            "start": 1950,
            "end": 1954,
            "text": "L'Univers était plus petit et de plus en plus dense dans le passé."
        },
        {
            "start": 1954,
            "end": 1962,
            "text": "C'est un des premiers, à l'avoir publié, qui s'est dit que si on va très loin dans le passé, l'Univers sera très chaud et très dense."
        },
        {
            "start": 1962,
            "end": 1969,
            "text": "L'abbé le Maître l'avait aussi évoqué avec son atome primitif, mais lui a calculé l'implication que ça donnait."
        },
        {
            "start": 1969,
            "end": 1974,
            "text": "Il a calculé qu'au-delà d'une certaine température, la matière et la lumière devaient être liées."
        },
        {
            "start": 1974,
            "end": 1978,
            "text": "C'est ce que je vous disais au début, c'était la notion physique moderne."
        },
        {
            "start": 1978,
            "end": 1986,
            "text": "En étant liées, il devrait y avoir une lumière résiduelle dans l'Univers qui est due à ce passé où l'Univers était très chaud et très dense."
        },
        {
            "start": 1986,
            "end": 1992,
            "text": "Le fait que la matière et la lumière soient liées, la lumière doit avoir un spectre de corps noir, spécial en physique."
        },
        {
            "start": 1992,
            "end": 2002,
            "text": "C'est le premier qui s'est dit que si le Big Bang a eu lieu, il y a nécessairement un résidu lumineux dans l'Univers qui est dû à cette époque très chaude et très dense dans le passé."
        },
        {
            "start": 2002,
            "end": 2007,
            "text": "C'est nos amis Arnaud Penzias et Bob Wilson qui ont découvert ça fortuitement."
        },
        {
            "start": 2007,
            "end": 2011,
            "text": "Ils avaient un radiotélescope et ils ont détecté un signal qu'ils ne comprenaient pas."
        },
        {
            "start": 2011,
            "end": 2016,
            "text": "Ils avaient le détecteur le plus sensible de l'époque, refroidi à l'hélium, l'hélium liquide."
        },
        {
            "start": 2016,
            "end": 2022,
            "text": "Ils avaient un signal résiduel qu'ils mesuraient parfaitement, mais ils ne connaissaient pas l'origine."
        },
        {
            "start": 2022,
            "end": 2033,
            "text": "Ils ont bien vu qu'il y avait le signal qui provenait de la galaxie, le signal qui provenait de l'atmosphère, le bruit de leur détecteur, mais en faisant toutes ces soustractions, il restait le signal à 3 Kelvin."
        },
        {
            "start": 2033,
            "end": 2041,
            "text": "Ils ont peut-être découvert l'émission micro-ondes des fientes de pigeons, car le radiotélescope nichait de nombreux couples de pigeons."
        },
        {
            "start": 2041,
            "end": 2045,
            "text": "Ils ont envoyé des étudiants pour nettoyer tout ça."
        },
        {
            "start": 2045,
            "end": 2047,
            "text": "C'est véridique."
        },
        {
            "start": 2047,
            "end": 2052,
            "text": "Ils ont dit qu'ils avaient l'air ballots si ils découvraient l'émission micro-ondes des pigeons."
        },
        {
            "start": 2052,
            "end": 2056,
            "text": "Ce serait intéressant, mais peut-être pas pour la cosmologie."
        },
        {
            "start": 2056,
            "end": 2058,
            "text": "D'ailleurs, ils ne cherchaient pas la cosmologie."
        },
        {
            "start": 2058,
            "end": 2060,
            "text": "Le signal était toujours là."
        },
        {
            "start": 2060,
            "end": 2062,
            "text": "Qu'est-ce qu'on fait avec ça ?"
        },
        {
            "start": 2062,
            "end": 2070,
            "text": "Ils ont attendu 6 mois, le temps que la Terre fasse un demi-tour sur son orbite, en se disant qu'il y a peut-être un truc autour de la Terre."
        },
        {
            "start": 2070,
            "end": 2073,
            "text": "Les ceintures de Van Halen avaient été découvertes peu de temps avant."
        },
        {
            "start": 2073,
            "end": 2076,
            "text": "Ils ont dit qu'il y avait peut-être un truc bizarre."
        },
        {
            "start": 2076,
            "end": 2082,
            "text": "Toujours pareil, rayonnement isotrope significatif, froid, 3 Kelvin, mais présent partout."
        },
        {
            "start": 2082,
            "end": 2087,
            "text": "Penzias et Wilson avaient découvert ce résidu lumineux du Big Bang, le fond cosmologique."
        },
        {
            "start": 2087,
            "end": 2090,
            "text": "C'est une recréation."
        },
        {
            "start": 2090,
            "end": 2093,
            "text": "C'est tout le ciel qu'on représente comme une map-monde."
        },
        {
            "start": 2093,
            "end": 2094,
            "text": "C'est tout le ciel."
        },
        {
            "start": 2094,
            "end": 2098,
            "text": "La température de l'univers est super homogène à 3 Kelvin."
        },
        {
            "start": 2098,
            "end": 2100,
            "text": "Donc, moins 270 degrés Celsius."
        },
        {
            "start": 2100,
            "end": 2101,
            "text": "Super homogène."
        },
        {
            "start": 2101,
            "end": 2108,
            "text": "La preuve du Big Bang... Vous ne pouvez pas prouver une théorie, mais la prédiction du Big Bang était vérifiée."
        },
        {
            "start": 2108,
            "end": 2115,
            "text": "C'est important en science que vous fassiez des observations qui confirment ou qui infirment des résultats théoriques."
        },
        {
            "start": 2115,
            "end": 2118,
            "text": "Maintenant, l'univers, on le comprend de la manière suivante."
        },
        {
            "start": 2118,
            "end": 2133,
            "text": "Avec l'inflation cosmique qui provoque une expansion très forte pendant 10,35 secondes à peu près, qui garde cet univers très homogène à très grande échelle."
        },
        {
            "start": 2133,
            "end": 2142,
            "text": "Ensuite, les trois premières minutes de l'univers où s'effectue la nucléosynthèse primordiale, la génération des noyaux au tout début de l'univers."
        },
        {
            "start": 2142,
            "end": 2151,
            "text": "Quand je vais dans les écoles, toute l'eau dont nous sommes faits ou l'eau dans la bouteille est composée de H2O, deux atomes d'hydrogène et un atome d'oxygène."
        },
        {
            "start": 2151,
            "end": 2155,
            "text": "Tout l'hydrogène a été synthétisé durant les trois premières minutes."
        },
        {
            "start": 2155,
            "end": 2156,
            "text": "On en est certain."
        },
        {
            "start": 2156,
            "end": 2159,
            "text": "On l'a encore mesuré avec Planck récemment."
        },
        {
            "start": 2159,
            "end": 2162,
            "text": "La Big Bang nucléosynthèse marchait très bien."
        },
        {
            "start": 2162,
            "end": 2167,
            "text": "Dans les trois premières minutes, vous ne synthétisez que les atomes légers."
        },
        {
            "start": 2167,
            "end": 2169,
            "text": "Le reste est créé dans les étoiles."
        },
        {
            "start": 2169,
            "end": 2171,
            "text": "Nous sommes des poussières d'étoiles."
        },
        {
            "start": 2171,
            "end": 2173,
            "text": "Vous connaissez la phrase d'Hubert Reeves."
        },
        {
            "start": 2173,
            "end": 2177,
            "text": "C'est vrai à l'exception de l'hydrogène, de l'hélium et de l'ithium."
        },
        {
            "start": 2177,
            "end": 2180,
            "text": "L'univers continue toujours à se refroidir."
        },
        {
            "start": 2180,
            "end": 2182,
            "text": "C'est l'histoire de l'univers en une minute et demie."
        },
        {
            "start": 2182,
            "end": 2188,
            "text": "Il arrive un moment où il est tellement froid, 6 000 degrés, que la lumière s'échappe."
        },
        {
            "start": 2188,
            "end": 2191,
            "text": "Je vous l'ai dit avec des mots, je vais vous montrer avec un dessin."
        },
        {
            "start": 2191,
            "end": 2195,
            "text": "C'est juste avant que la lumière s'échappe, c'est juste après."
        },
        {
            "start": 2195,
            "end": 2197,
            "text": "Les petits traits, c'est la lumière."
        },
        {
            "start": 2197,
            "end": 2199,
            "text": "Les petits points, c'est les électrons."
        },
        {
            "start": 2199,
            "end": 2201,
            "text": "Les gros points, c'est les noyaux atomiques."
        },
        {
            "start": 2201,
            "end": 2204,
            "text": "C'est un proton, électron et lumière."
        },
        {
            "start": 2204,
            "end": 2208,
            "text": "Quand les électrons sont libres, ils interagissent avec la lumière."
        },
        {
            "start": 2208,
            "end": 2214,
            "text": "La lumière se balade, elle ne demande rien, elle voit un électron, elle est diffusée, un peu comme dans un brouillard."
        },
        {
            "start": 2214,
            "end": 2216,
            "text": "Elle est déviée par le diffusion Thomson."
        },
        {
            "start": 2216,
            "end": 2219,
            "text": "Tout se passe bien, mais ça veut dire que c'est opaque."
        },
        {
            "start": 2219,
            "end": 2220,
            "text": "Vous ne pouvez pas voir dedans."
        },
        {
            "start": 2220,
            "end": 2222,
            "text": "C'est lumineux, mais opaque."
        },
        {
            "start": 2222,
            "end": 2223,
            "text": "Comme au centre du Soleil."
        },
        {
            "start": 2223,
            "end": 2224,
            "text": "Vous ne pouvez pas le voir."
        },
        {
            "start": 2224,
            "end": 2227,
            "text": "Vous voyez que ça surface, pour les mêmes raisons."
        },
        {
            "start": 2227,
            "end": 2232,
            "text": "Sous la surface, c'est un plasma chaud, donc électrisé, et donc la lumière est diffusée."
        },
        {
            "start": 2232,
            "end": 2239,
            "text": "Arrivée au moment où la température va sous les 3 000 degrés, c'est plus compliqué que ça, mais je vous la fais courte."
        },
        {
            "start": 2239,
            "end": 2241,
            "text": "Pourquoi les électrons et pas les protons ?"
        },
        {
            "start": 2241,
            "end": 2246,
            "text": "La diffusion Thomson est proportionnelle à 1 sur la masse au carré de la particule."
        },
        {
            "start": 2246,
            "end": 2255,
            "text": "Pour ceux qui connaissent la physique, la masse de l'électron est à peu près 2 000 fois plus petite que le proton 1 sur m², ça explose, donc il y a juste les électrons qui jouent."
        },
        {
            "start": 2255,
            "end": 2256,
            "text": "On pose parfois la question."
        },
        {
            "start": 2256,
            "end": 2259,
            "text": "Les protons jouent, mais c'est négligeable."
        },
        {
            "start": 2259,
            "end": 2266,
            "text": "Il arrive un moment où les photons n'ont plus assez d'énergie, car l'Univers se refroidit, et il y a un milliard de fois plus de photons que d'électrons."
        },
        {
            "start": 2266,
            "end": 2269,
            "text": "Les électrons arrivent à se recoupler aux protons."
        },
        {
            "start": 2269,
            "end": 2272,
            "text": "Ils y arrivaient déjà ici, mais les photons les explosaient."
        },
        {
            "start": 2272,
            "end": 2277,
            "text": "Quand ils s'accouplent, ça forme un atome d'hydrogène, un proton plus électron, mais il n'y a plus d'électrons qui sont libres."
        },
        {
            "start": 2277,
            "end": 2279,
            "text": "La lumière se propage librement, enfin."
        },
        {
            "start": 2279,
            "end": 2283,
            "text": "Elle se propage en ligne droite, selon les géodésiques."
        },
        {
            "start": 2283,
            "end": 2285,
            "text": "C'est ça qu'on voit aujourd'hui."
        },
        {
            "start": 2285,
            "end": 2292,
            "text": "La lumière était créée au début de l'Univers, mais était piégée par la matière, donc la matière vibrait."
        },
        {
            "start": 2292,
            "end": 2298,
            "text": "À un moment, c'était suffisamment froid pour que les électrons ne disparaissent pas, mais sortent du circuit."
        },
        {
            "start": 2298,
            "end": 2300,
            "text": "Et pof, la lumière peut passer."
        },
        {
            "start": 2300,
            "end": 2303,
            "text": "Que pensez-vous qu'il arriva des vibrations ?"
        },
        {
            "start": 2303,
            "end": 2304,
            "text": "Vous vous rappelez ?"
        },
        {
            "start": 2304,
            "end": 2307,
            "text": "C'est gravité et pression de radiation des photons."
        },
        {
            "start": 2307,
            "end": 2310,
            "text": "Mais les photons sont enfin partis, car ils sont libres."
        },
        {
            "start": 2310,
            "end": 2321,
            "text": "Vous aviez des vibrations à gauche, et au moment de la recombinaison, et après, car c'est la recombinaison, vous n'avez plus de photons, donc vous n'avez plus cette force qui repousse."
        },
        {
            "start": 2321,
            "end": 2324,
            "text": "La gravité peut jouer son rôle et former les grandes structures."
        },
        {
            "start": 2324,
            "end": 2333,
            "text": "Les grandes structures, j'allais dire une bêtise, mais je vais la dire, commencent à se former à partir de ce moment-là, où elles ne sont plus gênées par les photons."
        },
        {
            "start": 2333,
            "end": 2334,
            "text": "C'est formidable."
        },
        {
            "start": 2334,
            "end": 2337,
            "text": "C'est ce qui se passe dans le fond cosmologique."
        },
        {
            "start": 2337,
            "end": 2338,
            "text": "On voit ces vibrations."
        },
        {
            "start": 2338,
            "end": 2340,
            "text": "On voit les dernières vibrations."
        },
        {
            "start": 2340,
            "end": 2345,
            "text": "Ce n'est pas la dernière station avant l'autoroute, mais les dernières vibrations avant la recombinaison."
        },
        {
            "start": 2345,
            "end": 2352,
            "text": "Votre univers vibre, et à un moment, la lumière s'échappe, et c'est ce que vous voyez à cet instant-là."
        },
        {
            "start": 2352,
            "end": 2365,
            "text": "C'est une photo ultra précise de l'univers 370 000 ans après le Big Bang qui vous montre toutes les vibrations à un instant T C'est comme si vous vous faites bouillir de l'eau sur votre casserole un moment, vous faites une photo où est le spectre de vibrations à la surface."
        },
        {
            "start": 2365,
            "end": 2368,
            "text": "Ça nous dépanne bien, ça nous permet de tout comprendre."
        },
        {
            "start": 2368,
            "end": 2371,
            "text": "Un peu comme le soleil, il vibre, mais on ne voit pas l'intérieur."
        },
        {
            "start": 2371,
            "end": 2373,
            "text": "C'est du plasma."
        },
        {
            "start": 2373,
            "end": 2377,
            "text": "La différence, c'est qu'on est à l'extérieur du soleil, et là, on est à l'intérieur de l'univers."
        },
        {
            "start": 2377,
            "end": 2380,
            "text": "Je vous laisse méditer ça pour vos longues soirées d'hiver."
        },
        {
            "start": 2380,
            "end": 2382,
            "text": "Comment on fait scientifiquement ?"
        },
        {
            "start": 2382,
            "end": 2384,
            "text": "Il me reste une dizaine de minutes."
        },
        {
            "start": 2384,
            "end": 2386,
            "text": "On construit un satellite pendant 15 ans."
        },
        {
            "start": 2386,
            "end": 2388,
            "text": "On essaie de trouver 1 milliard d'euros."
        },
        {
            "start": 2388,
            "end": 2399,
            "text": "Le CNES et l'Agence spatiale européenne nous disent qu'on construit un satellite unique, et on met ça sur une Ariane 5, avec Arshel, dont je ne parlerai pas, même si j'ai beaucoup travaillé avec lui."
        },
        {
            "start": 2399,
            "end": 2402,
            "text": "Ce sont deux missions majeures de l'Agence spatiale européenne."
        },
        {
            "start": 2402,
            "end": 2405,
            "text": "Là, vous êtes très stressé, à ce moment-là."
        },
        {
            "start": 2405,
            "end": 2408,
            "text": "Mais maintenant, ça va. Là, c'est une simulation."
        },
        {
            "start": 2408,
            "end": 2411,
            "text": "Vous larguez les EAP, étage d'accélération à poudre."
        },
        {
            "start": 2411,
            "end": 2413,
            "text": "Vous sortez de l'atmosphère."
        },
        {
            "start": 2413,
            "end": 2414,
            "text": "Vous lâchez la coiffe."
        },
        {
            "start": 2414,
            "end": 2415,
            "text": "Là, il y a Arshel."
        },
        {
            "start": 2415,
            "end": 2418,
            "text": "C'est un super observatoire qui a fait plein de belles choses."
        },
        {
            "start": 2418,
            "end": 2419,
            "text": "Vous lâchez Arshel."
        },
        {
            "start": 2419,
            "end": 2423,
            "text": "Les gens sont contents, mais vous vous tirez la tête."
        },
        {
            "start": 2423,
            "end": 2424,
            "text": "Vous vous décalez."
        },
        {
            "start": 2424,
            "end": 2427,
            "text": "Vous éjectez le SILDA, système lancement double d'Ariane."
        },
        {
            "start": 2427,
            "end": 2428,
            "text": "Et Planck est là."
        },
        {
            "start": 2428,
            "end": 2430,
            "text": "Là, on a très, très peur."
        },
        {
            "start": 2430,
            "end": 2432,
            "text": "Ça se met en rotation."
        },
        {
            "start": 2432,
            "end": 2433,
            "text": "Et voilà, l'achat de Planck."
        },
        {
            "start": 2433,
            "end": 2435,
            "text": "Tout le monde était content."
        },
        {
            "start": 2435,
            "end": 2437,
            "text": "C'était 20 minutes après le lancement."
        },
        {
            "start": 2437,
            "end": 2451,
            "text": "Et tout ce petit monde, Planck, Arshel, va au point de la grange L2, du système Terre-Soleil, à 4 fois la distance Terre-Lune, pour avoir toujours la Lune, le Soleil et la Terre dans le dos."
        },
        {
            "start": 2451,
            "end": 2453,
            "text": "Il y a le petit panneau solaire."
        },
        {
            "start": 2453,
            "end": 2456,
            "text": "Et voilà comment Planck observe... Observez."
        },
        {
            "start": 2456,
            "end": 2457,
            "text": "Observez."
        },
        {
            "start": 2457,
            "end": 2460,
            "text": "Il faisait un tour par minute, à peu près, et il scannait le ciel."
        },
        {
            "start": 2460,
            "end": 2463,
            "text": "Chaque jour, il se déplaçait un petit peu."
        },
        {
            "start": 2463,
            "end": 2467,
            "text": "On ne fait pas des ronds dans l'eau, mais des ronds dans le ciel, avec Planck."
        },
        {
            "start": 2467,
            "end": 2468,
            "text": "Ronds dans le ciel."
        },
        {
            "start": 2468,
            "end": 2475,
            "text": "Et comme vous avez toujours le Soleil et la Lune dans le dos, vous ne les avez pas sur l'image, vous reconstruisez l'image après."
        },
        {
            "start": 2475,
            "end": 2479,
            "text": "Vous êtes dans l'image, mais ce n'est pas très pratique, donc on la déprojette."
        },
        {
            "start": 2479,
            "end": 2484,
            "text": "C'est les images que vous avez peut-être vues du satellite Planck, qui sont projections du ciel."
        },
        {
            "start": 2484,
            "end": 2486,
            "text": "Nous, on n'est pas dessus, on est derrière."
        },
        {
            "start": 2486,
            "end": 2488,
            "text": "Et on reconstruit avec le temps."
        },
        {
            "start": 2488,
            "end": 2499,
            "text": "Donc, Planck n'observe pas dans les ondes visibles, mais dans les ondes millimétriques, les ondes très froides, plus loin que l'infrarouge, parce que le fond cosmologique est plus brillant à ces longueurs."
        },
        {
            "start": 2499,
            "end": 2503,
            "text": "Vous voyez ici la Voie lactée, qui est très belle, très brillante, le plan galactique."
        },
        {
            "start": 2503,
            "end": 2504,
            "text": "Donc, notre Voie lactée."
        },
        {
            "start": 2504,
            "end": 2508,
            "text": "Des régions de gaz très brillantes."
        },
        {
            "start": 2508,
            "end": 2511,
            "text": "Vous avez ici le Grand nuage et le Petit nuage de Magellan."
        },
        {
            "start": 2511,
            "end": 2513,
            "text": "Vous avez... Je l'ai perdu."
        },
        {
            "start": 2513,
            "end": 2516,
            "text": "Andromède, je crois que c'est ce truc-là, mais je ne suis pas sûr."
        },
        {
            "start": 2516,
            "end": 2518,
            "text": "Galaxie d'Andromède."
        },
        {
            "start": 2518,
            "end": 2518,
            "text": "Centaurus A."
        },
        {
            "start": 2518,
            "end": 2521,
            "text": "Et Orion et le taureau, pour ceux qui connaissent."
        },
        {
            "start": 2521,
            "end": 2522,
            "text": "C'est par là."
        },
        {
            "start": 2522,
            "end": 2525,
            "text": "C'est une belle image, mais c'est compliqué."
        },
        {
            "start": 2525,
            "end": 2528,
            "text": "Nous, ce qu'on veut, c'est les petits points rouges et oranges."
        },
        {
            "start": 2528,
            "end": 2532,
            "text": "C'est ça, les fluctuations du fond cosmologique, et c'est ça qu'on cherche à avoir."
        },
        {
            "start": 2532,
            "end": 2533,
            "text": "Mais on est gêné par ça."
        },
        {
            "start": 2533,
            "end": 2540,
            "text": "Ça a demandé beaucoup de travail à mes collègues pour soustraire et extraire toute cette information."
        },
        {
            "start": 2540,
            "end": 2545,
            "text": "La clé de cette mission, c'est... J'aime bien cette image, on ne comprend rien, mais elle est belle."
        },
        {
            "start": 2545,
            "end": 2547,
            "text": "J'espère que vous partagez ce constat."
        },
        {
            "start": 2547,
            "end": 2548,
            "text": "Ça, c'est Planck."
        },
        {
            "start": 2548,
            "end": 2551,
            "text": "Il fait 4 m de haut, 3 m de large, une tonne."
        },
        {
            "start": 2551,
            "end": 2553,
            "text": "Je comprends un peu cette image."
        },
        {
            "start": 2553,
            "end": 2556,
            "text": "C'est la tranche du miroir primaire."
        },
        {
            "start": 2556,
            "end": 2557,
            "text": "On regarde par le haut."
        },
        {
            "start": 2557,
            "end": 2571,
            "text": "La tranche du miroir primaire, qui est ici, avec le plan focal et les instruments ultra-froids qu'on a fabriqués à Orsay, HFI, High Frequency Instrument, refroidis à la température record mondiale, jamais obtenue par ailleurs, de 0,1 Kelvin dans l'espace."
        },
        {
            "start": 2571,
            "end": 2574,
            "text": "Il n'y a que nous qui savons faire ça, les Français et les Européens."
        },
        {
            "start": 2574,
            "end": 2578,
            "text": "Les autres ne savent pas faire, ou ça n'a pas marché."
        },
        {
            "start": 2578,
            "end": 2591,
            "text": "Là, c'est le miroir secondaire, qui représente le plan focal, mais un peu distordu, on est sur le côté, donc on voit les cornets, puisque la lumière arrive dans les cornets, détectés par les fameux 52 bolomètres dont je voulais donner le titre."
        },
        {
            "start": 2591,
            "end": 2597,
            "text": "Planck observe à 9 fréquences, qui sont des fréquences non visibles à nos yeux."
        },
        {
            "start": 2597,
            "end": 2604,
            "text": "Les ondes radio, par l'instrument italien LFI, les trois fréquences, et les six fréquences hautes, par notre instrument HFI."
        },
        {
            "start": 2604,
            "end": 2609,
            "text": "Et après, pourquoi on a utilisé ces neuf couleurs ?"
        },
        {
            "start": 2609,
            "end": 2610,
            "text": "La réponse est simple."
        },
        {
            "start": 2610,
            "end": 2615,
            "text": "Vous vous rappelez l'image où il y avait de la volacté partout, qui est très jolie, mais qui nous gêne."
        },
        {
            "start": 2615,
            "end": 2618,
            "text": "Vous voyez ce petit bidule rouge, ces petites fluctuations ?"
        },
        {
            "start": 2618,
            "end": 2624,
            "text": "Comment vous savez si elles proviennent de la galaxie ou du fond cosmologique lui-même ?"
        },
        {
            "start": 2624,
            "end": 2625,
            "text": "C'est pas écrit dessus."
        },
        {
            "start": 2625,
            "end": 2628,
            "text": "Je viens du fond cosmologique, je viens de la volacté."
        },
        {
            "start": 2628,
            "end": 2629,
            "text": "C'est pas ça, malheureusement."
        },
        {
            "start": 2629,
            "end": 2631,
            "text": "Donc, c'est à nous de nous débrouiller."
        },
        {
            "start": 2631,
            "end": 2640,
            "text": "En ayant plusieurs fréquences, on peut séparer les contributions de la volacté du fond cosmologique et plein d'autres choses, uniquement parce qu'ils n'ont pas le même spectre d'émissions."
        },
        {
            "start": 2640,
            "end": 2642,
            "text": "Sinon, on était morts."
        },
        {
            "start": 2642,
            "end": 2647,
            "text": "Mais le fond cosmologique est très froid, la volacté est un peu plus chaude, 17K, etc."
        },
        {
            "start": 2647,
            "end": 2649,
            "text": "Donc, ça nous permet de séparer."
        },
        {
            "start": 2649,
            "end": 2653,
            "text": "Mais pour séparer bien, il faut plein de longueurs d'onde pour bien découpler les deux."
        },
        {
            "start": 2653,
            "end": 2657,
            "text": "Je vous raconte ça parce que c'était la clé du travail."
        },
        {
            "start": 2657,
            "end": 2661,
            "text": "Donc, il a fallu des mois et des années pour soustraire tout ça."
        },
        {
            "start": 2661,
            "end": 2672,
            "text": "Si vous allez sur l'archive Planck, parce que toutes les données sont publiques, vous appelez Planck PLA, Planck Legacy Archive, vous n'aurez pas une seule image du fond cosmologique, vous en aurez deux ou trois."
        },
        {
            "start": 2672,
            "end": 2674,
            "text": "On n'a pas une seule méthode qui marche très bien."
        },
        {
            "start": 2674,
            "end": 2675,
            "text": "On en a deux ou trois."
        },
        {
            "start": 2675,
            "end": 2677,
            "text": "Chaque méthode a ses avantages et ses inconvénients."
        },
        {
            "start": 2677,
            "end": 2680,
            "text": "Selon ce que vous voulez étudier, vous utiliserez telle image ou telle autre."
        },
        {
            "start": 2680,
            "end": 2682,
            "text": "Mais on n'a pas une image toute faite qui fait tout."
        },
        {
            "start": 2682,
            "end": 2685,
            "text": "On n'y arrive pas, c'est très compliqué."
        },
        {
            "start": 2685,
            "end": 2686,
            "text": "C'est la séparation de composantes."
        },
        {
            "start": 2686,
            "end": 2692,
            "text": "Vous prenez neuf images, vous faites un énorme traitement et vous sortez vos petites fluctuations du fond cosmologique."
        },
        {
            "start": 2692,
            "end": 2704,
            "text": "On passe de l'image de Penzias et Wilson, il y a quelques années, à l'image de... Je ne l'ai pas montrée ici, de Coby en 1989 et de Dobaud du MAP dans les années 2000, à l'image de Planck qui montre ces petites fluctuations."
        },
        {
            "start": 2704,
            "end": 2709,
            "text": "On a fait un zoom de presque un million en intensité pour voir ces petites fluctuations."
        },
        {
            "start": 2709,
            "end": 2716,
            "text": "Ces petites fluctuations sont les prémices de ce qu'ils vont devenir des amas de galaxies et des galaxies et de ce que nous sommes."
        },
        {
            "start": 2716,
            "end": 2721,
            "text": "Planck a aussi permis d'obtenir la meilleure carte à cette échelle-là de la polarisation du fond cosmologique."
        },
        {
            "start": 2721,
            "end": 2724,
            "text": "Ça nous emmènerait pendant des heures, mais je vais vous la faire courte."
        },
        {
            "start": 2724,
            "end": 2728,
            "text": "La lumière est polarisée, soit vous le savez, soit vous l'admettez."
        },
        {
            "start": 2728,
            "end": 2734,
            "text": "Les directions de polarisation nous donnent une idée, non pas d'où sont les petites fluctuations, comme c'est le cas."
        },
        {
            "start": 2734,
            "end": 2738,
            "text": "Là, c'est dense, là, c'est surdense, là, c'est sous-dense."
        },
        {
            "start": 2738,
            "end": 2740,
            "text": "Je ne sais plus comment est le code couleur."
        },
        {
            "start": 2740,
            "end": 2746,
            "text": "Mais ça, ça nous dit à quelle vitesse ça se densifie ou à quelle vitesse ça se vide."
        },
        {
            "start": 2746,
            "end": 2749,
            "text": "Donc, on a la dynamique des fluctuations."
        },
        {
            "start": 2749,
            "end": 2754,
            "text": "Tout à l'heure, je vous disais qu'on faisait une photo de l'Univers juste à la recombinaison."
        },
        {
            "start": 2754,
            "end": 2758,
            "text": "C'est vrai pour l'intensité, mais c'est faux pour la polarisation."
        },
        {
            "start": 2758,
            "end": 2760,
            "text": "Avec la polarisation, c'est comme si on faisait un petit film."
        },
        {
            "start": 2760,
            "end": 2765,
            "text": "On n'a pas de film, mais la polarisation nous indique comment la matière vibre, à quelle vitesse."
        },
        {
            "start": 2765,
            "end": 2768,
            "text": "C'est extraordinaire, on peut tout avoir avec ça."
        },
        {
            "start": 2768,
            "end": 2775,
            "text": "On peut avoir plein d'informations sur ce qui se passe juste au moment de cette recombinaison et comment ces fluctuations évoluent."
        },
        {
            "start": 2775,
            "end": 2777,
            "text": "Je vous l'avais fait courte."
        },
        {
            "start": 2777,
            "end": 2780,
            "text": "Tous ces résultats, il y a quelques années, ont eu un certain écho dans la presse."
        },
        {
            "start": 2780,
            "end": 2783,
            "text": "On était contents, même si on ne fait pas ça pour ça."
        },
        {
            "start": 2783,
            "end": 2786,
            "text": "Notamment dans la presse anglo-saxonne, ce qui n'était jamais arrivé."
        },
        {
            "start": 2786,
            "end": 2790,
            "text": "Le Monde, je suis abonné, s'était un peu planté d'images sur leur couverture."
        },
        {
            "start": 2790,
            "end": 2792,
            "text": "Ils avaient mis l'image avant le traitement."
        },
        {
            "start": 2792,
            "end": 2793,
            "text": "C'est un peu dommage."
        },
        {
            "start": 2793,
            "end": 2795,
            "text": "Elle est belle, mais c'était un peu trompé."
        },
        {
            "start": 2795,
            "end": 2799,
            "text": "Ils avaient mis la bonne image après dans l'article."
        },
        {
            "start": 2799,
            "end": 2802,
            "text": "Alors, Planck, finalement, est la troisième génération."
        },
        {
            "start": 2802,
            "end": 2803,
            "text": "C'est une sorte de clone."
        },
        {
            "start": 2803,
            "end": 2806,
            "text": "Je détourne les titres, sinon je n'y arriverai pas."
        },
        {
            "start": 2806,
            "end": 2810,
            "text": "Planck est le clone, la troisième génération des missions précédentes."
        },
        {
            "start": 2810,
            "end": 2813,
            "text": "COBI, WMAP et Planck."
        },
        {
            "start": 2813,
            "end": 2815,
            "text": "Il y a des dizaines d'années entre ça."
        },
        {
            "start": 2815,
            "end": 2822,
            "text": "Pour la petite histoire, WMAP et Planck ont été décidés la même année, en 1996."
        },
        {
            "start": 2822,
            "end": 2823,
            "text": "J'étais en DEA à l'époque."
        },
        {
            "start": 2823,
            "end": 2826,
            "text": "Je me souviens, j'avais assisté aux présentations."
        },
        {
            "start": 2826,
            "end": 2831,
            "text": "Pourquoi les Européens ont mis dix ans plus que les Américains alors que les manips ont été acceptés la même année ?"
        },
        {
            "start": 2831,
            "end": 2836,
            "text": "Est-ce parce qu'on est mauvais, plus lent, parce qu'on se débrouille mal ?"
        },
        {
            "start": 2836,
            "end": 2837,
            "text": "La réponse, c'est non."
        },
        {
            "start": 2837,
            "end": 2839,
            "text": "On est beaucoup plus ambitieux."
        },
        {
            "start": 2839,
            "end": 2842,
            "text": "Ce qu'ont fait les Américains, c'est très bien."
        },
        {
            "start": 2842,
            "end": 2844,
            "text": "Ils avaient un budget plus petit."
        },
        {
            "start": 2844,
            "end": 2848,
            "text": "Ils ont pris les technos qui existent, on les a envoyées, et on a des super résultats."
        },
        {
            "start": 2848,
            "end": 2849,
            "text": "Ça a très bien marché."
        },
        {
            "start": 2849,
            "end": 2851,
            "text": "Ils ont obtenu les premiers paramètres cosmologiques."
        },
        {
            "start": 2851,
            "end": 2854,
            "text": "Ça a vraiment changé le paysage cosmologique."
        },
        {
            "start": 2854,
            "end": 2858,
            "text": "Mais nous, on s'est dit qu'on allait faire la manip définitive."
        },
        {
            "start": 2858,
            "end": 2860,
            "text": "On allait arrêter le jeu après."
        },
        {
            "start": 2860,
            "end": 2864,
            "text": "Après cette image, on n'aura plus la peine d'observer le fond cosmologique."
        },
        {
            "start": 2864,
            "end": 2869,
            "text": "On a développé une nouvelle technologie, les bolomètres refroidis, cryogéniques à 0,1 Kelvin, qui n'avaient jamais volé."
        },
        {
            "start": 2869,
            "end": 2870,
            "text": "Ça nous a mis dix ans."
        },
        {
            "start": 2870,
            "end": 2878,
            "text": "Pour vous donner une idée du gain, une année d'observation de Planck, plus vous observez longtemps, plus vous intégrez, moins vous avez de bruit."
        },
        {
            "start": 2878,
            "end": 2883,
            "text": "Une année d'observation de Planck correspond à plusieurs années d'intégration de WMAP."
        },
        {
            "start": 2883,
            "end": 2889,
            "text": "Ça ne correspond pas à dix ans d'intégration de WMAP, pas à cent ans, mais à l'équivalent de mille ans d'observation de WMAP."
        },
        {
            "start": 2889,
            "end": 2891,
            "text": "Vous voyez le saut technologique majeur."
        },
        {
            "start": 2891,
            "end": 2893,
            "text": "On appelle ça un saut technologique."
        },
        {
            "start": 2893,
            "end": 2894,
            "text": "C'est nous qui l'avons fait."
        },
        {
            "start": 2894,
            "end": 2897,
            "text": "Ça prend un peu de temps, parce que c'est des technos compliqués."
        },
        {
            "start": 2897,
            "end": 2901,
            "text": "Je vais répondre à cette question dans les quatre minutes qui me restent."
        },
        {
            "start": 2901,
            "end": 2904,
            "text": "Comment on obtient ces fameux paramètres cosmologiques ?"
        },
        {
            "start": 2904,
            "end": 2907,
            "text": "À partir de cette image de vibration."
        },
        {
            "start": 2907,
            "end": 2909,
            "text": "On vous donne l'âge, la composition, d'où ça sort."
        },
        {
            "start": 2909,
            "end": 2910,
            "text": "C'est très simple."
        },
        {
            "start": 2910,
            "end": 2916,
            "text": "Si vous vous rappelez quand vous avez été au lycée ou à l'université, quand vous faites des TP, vous avez des données."
        },
        {
            "start": 2916,
            "end": 2919,
            "text": "On essaie de vous faire passer une droite ou une courbe dedans."
        },
        {
            "start": 2919,
            "end": 2920,
            "text": "C'est pareil."
        },
        {
            "start": 2920,
            "end": 2922,
            "text": "Un peu plus compliqué, mais c'est pareil."
        },
        {
            "start": 2922,
            "end": 2926,
            "text": "On prend les données du fonds cosmologique et on la confronte aux modèles."
        },
        {
            "start": 2926,
            "end": 2927,
            "text": "Ça, c'est les modèles."
        },
        {
            "start": 2927,
            "end": 2933,
            "text": "On en fait tourner des millions de modèles de l'univers et on prend les meilleures données qui passent dedans."
        },
        {
            "start": 2933,
            "end": 2934,
            "text": "Il y a un petit souci."
        },
        {
            "start": 2934,
            "end": 2939,
            "text": "La théorie ne prédit pas qu'à cet endroit, il y aura un point bleu et qu'à cet endroit, il y aura un point rouge."
        },
        {
            "start": 2939,
            "end": 2944,
            "text": "C'est comme si vous faites un modèle de circulation automobile sur le périphérique."
        },
        {
            "start": 2944,
            "end": 2953,
            "text": "À 6 h ou à 8 h, vous donnez un nombre de voitures par minute, mais votre modèle ne vous dira pas qu'il y a une voiture bleue avec un conducteur et une voiture rouge avec une conductrice."
        },
        {
            "start": 2953,
            "end": 2954,
            "text": "Votre modèle ne prédit pas ça."
        },
        {
            "start": 2954,
            "end": 2957,
            "text": "Il vous prédit statistiquement le flot de voitures."
        },
        {
            "start": 2957,
            "end": 2958,
            "text": "Nous, c'est pareil."
        },
        {
            "start": 2958,
            "end": 2969,
            "text": "Ça ne nous prédit pas l'endroit d'où seront les petites fluctuations, mais ça nous prédit statistiquement qu'il y en a tant sur tout le ciel de telle échelle et tant sur tout le ciel de telle échelle."
        },
        {
            "start": 2969,
            "end": 2973,
            "text": "Donc, ertir cette image en spectre de puissance."
        },
        {
            "start": 2973,
            "end": 2976,
            "text": "On décompose par échelle et on fait une sorte de moyenne."
        },
        {
            "start": 2976,
            "end": 2982,
            "text": "Pour ceux qui connaissent, on fait une décomposition en harmonique sphérique, un peu comme une transformée de Fourier sur la sphère."
        },
        {
            "start": 2982,
            "end": 2985,
            "text": "On fait des corrélations, ça revient à mètre au carré."
        },
        {
            "start": 2985,
            "end": 2988,
            "text": "Et on met nos données là-dedans, qui ne sont pas représentées ici."
        },
        {
            "start": 2988,
            "end": 2991,
            "text": "Les modèles sont très sensibles aux paramètres cosmologiques."
        },
        {
            "start": 2991,
            "end": 2998,
            "text": "Vous mettez toutes vos données et vous obtenez... Vous faites un ajustement, un fit, et vous obtenez vos paramètres cosmologiques."
        },
        {
            "start": 2998,
            "end": 3000,
            "text": "Mais vous n'avez pas qu'une seule valeur."
        },
        {
            "start": 3000,
            "end": 3004,
            "text": "Ce n'est pas comme en TP où on obtient 10, plus ou moins 2."
        },
        {
            "start": 3004,
            "end": 3005,
            "text": "Là, vous avez plein de valeurs."
        },
        {
            "start": 3005,
            "end": 3006,
            "text": "Vous avez tous les modèles."
        },
        {
            "start": 3006,
            "end": 3008,
            "text": "On a représenté trois paramètres."
        },
        {
            "start": 3008,
            "end": 3014,
            "text": "La densité de matière, la constante double et le spectre de fluctuation initiale."
        },
        {
            "start": 3014,
            "end": 3019,
            "text": "Si on prend les deux petits modèles en bas à droite, ils sont un peu en dehors de l'ellipse."
        },
        {
            "start": 3019,
            "end": 3022,
            "text": "Ces deux modèles ajustent les données."
        },
        {
            "start": 3022,
            "end": 3025,
            "text": "Il n'y en a que deux, alors qu'ici, il y en a des centaines."
        },
        {
            "start": 3025,
            "end": 3028,
            "text": "Ça ne veut pas dire que vous n'avez pas le droit de prendre ces valeurs."
        },
        {
            "start": 3028,
            "end": 3032,
            "text": "Ça veut juste dire que, statistiquement, dans notre description, elles sont très peu probables."
        },
        {
            "start": 3032,
            "end": 3038,
            "text": "Les valeurs qu'on va donner, ce seront les valeurs centrales, avec une barre d'erreur qui correspond à la densité de points."
        },
        {
            "start": 3038,
            "end": 3043,
            "text": "Mais ça ne veut pas dire que... Un jour, d'autres expériences nous diront que c'est ces valeurs."
        },
        {
            "start": 3043,
            "end": 3045,
            "text": "Tant mieux, tant pis, ce n'est pas grave."
        },
        {
            "start": 3045,
            "end": 3047,
            "text": "Elles ne sont pas interdites par Planck."
        },
        {
            "start": 3047,
            "end": 3049,
            "text": "Mais il y a des valeurs très favorisées."
        },
        {
            "start": 3049,
            "end": 3051,
            "text": "C'est comme ça que se fait la science."
        },
        {
            "start": 3051,
            "end": 3053,
            "text": "Il y a plusieurs valeurs."
        },
        {
            "start": 3053,
            "end": 3057,
            "text": "Selon comment vous vous marginalisez, selon les paramètres, vous obtenez des valeurs différentes."
        },
        {
            "start": 3057,
            "end": 3063,
            "text": "Dans les articles de Planck, plusieurs valeurs sont données selon la technique de mesure, pour faire simple."
        },
        {
            "start": 3063,
            "end": 3069,
            "text": "En fonction de ces valeurs, vous obtenez le fameux camembert cosmique, qui vous donne la composition, l'âge, tout."
        },
        {
            "start": 3069,
            "end": 3070,
            "text": "C'est comme ça que ça marche."
        },
        {
            "start": 3070,
            "end": 3073,
            "text": "Comment on a fait cette décomposition ?"
        },
        {
            "start": 3073,
            "end": 3075,
            "text": "Voici le multipôle."
        },
        {
            "start": 3075,
            "end": 3076,
            "text": "C'est l'angle sur le ciel."
        },
        {
            "start": 3076,
            "end": 3078,
            "text": "Je ne vais pas être très long, c'est la fin."
        },
        {
            "start": 3078,
            "end": 3080,
            "text": "C'est l'angle sur le ciel, c'est l'intensité."
        },
        {
            "start": 3080,
            "end": 3081,
            "text": "Voilà les points Planck."
        },
        {
            "start": 3081,
            "end": 3085,
            "text": "Ce sont ceux de 2013, mais ceux de 2018 sont encore meilleurs."
        },
        {
            "start": 3085,
            "end": 3087,
            "text": "Voilà le meilleur modèle."
        },
        {
            "start": 3087,
            "end": 3090,
            "text": "Mais ça ne veut pas dire qu'il fitte parfaitement."
        },
        {
            "start": 3090,
            "end": 3091,
            "text": "Et voilà l'accord entre les deux."
        },
        {
            "start": 3091,
            "end": 3093,
            "text": "Ça ajuste parfaitement."
        },
        {
            "start": 3093,
            "end": 3095,
            "text": "Ce modèle a six paramètres."
        },
        {
            "start": 3095,
            "end": 3101,
            "text": "Il contient de la matière noire, de l'énergie sombre, c'est l'expansion accélérée, de la matière traditionnelle et un âge."
        },
        {
            "start": 3101,
            "end": 3106,
            "text": "Voilà comment on obtient la quart d'identité de l'univers, en faisant un ajustement avec des modèles sur les données."
        },
        {
            "start": 3106,
            "end": 3109,
            "text": "Les données sont très compliquées."
        },
        {
            "start": 3109,
            "end": 3114,
            "text": "La revanche des six paramètres... J'ai rajouté un X de manière éhontée."
        },
        {
            "start": 3114,
            "end": 3115,
            "text": "Désolé."
        },
        {
            "start": 3115,
            "end": 3117,
            "text": "La revanche des six paramètres cosmologiques qui sont ici."
        },
        {
            "start": 3117,
            "end": 3120,
            "text": "Je ne vais pas tous les décrire, mais il y a la matière noire."
        },
        {
            "start": 3120,
            "end": 3125,
            "text": "La chose sur laquelle je vais insister, c'est ces deux boîtes."
        },
        {
            "start": 3125,
            "end": 3126,
            "text": "Ici, c'est la constante de Hubble."
        },
        {
            "start": 3126,
            "end": 3129,
            "text": "C'est pareil, j'ai des nouveaux paramètres, mais la table est plus compliquée."
        },
        {
            "start": 3129,
            "end": 3132,
            "text": "La constante de Hubble, qui est en km par seconde par Mpc."
        },
        {
            "start": 3132,
            "end": 3137,
            "text": "Quand j'étais étudiant en DEA, en Master 2, l'équivalent d'aujourd'hui, on ne connaissait pas cette valeur à mieux qu'un facteur 2 près."
        },
        {
            "start": 3137,
            "end": 3143,
            "text": "Mes enseignants me disaient que la constante de Hubble était entre 50 et 100 km par seconde par Mpc."
        },
        {
            "start": 3143,
            "end": 3155,
            "text": "J'ai eu la chance de participer à une aventure qui, en quelques décennies, ou une grosse décennie, a permis de passer d'un facteur 2, on n'est pas les seuls, mais c'est l'aboutissement, à une fraction de pourcent d'incertitude."
        },
        {
            "start": 3155,
            "end": 3165,
            "text": "Au cours d'une carrière, c'est assez agréable de dire que j'ai participé à une caractérisation de la carte d'identité de l'Univers à une fraction de pourcent, alors qu'on ne connaissait pas trop."
        },
        {
            "start": 3165,
            "end": 3165,
            "text": "C'est pas mal."
        },
        {
            "start": 3165,
            "end": 3167,
            "text": "En tout cas, je suis content."
        },
        {
            "start": 3167,
            "end": 3172,
            "text": "Conséquemment, parce que les deux sont liés, on a un âge de l'Univers à 0,3 % d'incertitude."
        },
        {
            "start": 3172,
            "end": 3176,
            "text": "Jamais dans l'histoire de l'humanité, on n'est arrivé à une telle précision."
        },
        {
            "start": 3176,
            "end": 3179,
            "text": "Les gens me disent parfois que ma théorie n'est pas sûre."
        },
        {
            "start": 3179,
            "end": 3181,
            "text": "Pas de problème, on change la théorie."
        },
        {
            "start": 3181,
            "end": 3188,
            "text": "Si vous avez une nouvelle théorie, je reviens en arrière, mettez vos paramètres à vous, faites l'ajustement et trouvez votre âge."
        },
        {
            "start": 3188,
            "end": 3189,
            "text": "Pas de problème."
        },
        {
            "start": 3189,
            "end": 3193,
            "text": "Les données sont là pour, j'ose pas dire l'éternité, mais pour un certain temps."
        },
        {
            "start": 3193,
            "end": 3199,
            "text": "Toutes les nouvelles théories devront ajuster ces données, les relevés de galaxies, l'âge des étoiles, etc."
        },
        {
            "start": 3199,
            "end": 3201,
            "text": "J'incitais sur le fond cosmologique."
        },
        {
            "start": 3201,
            "end": 3210,
            "text": "Alors, l'Empire contre-attaque, parce que le côté obscur de l'Univers est là, le camembert cosmique."
        },
        {
            "start": 3210,
            "end": 3220,
            "text": "Aujourd'hui, en densité d'énergie, moins de 5 % de matière ordinaire, donc des baryons, un gros quart de matière noire, et à peu près 70 % d'énergie sombre."
        },
        {
            "start": 3220,
            "end": 3227,
            "text": "Vous me donnez trois minutes, je vais essayer d'aller jusqu'à 20, je suis sur le point de finir, mais je dirais un truc important."
        },
        {
            "start": 3227,
            "end": 3229,
            "text": "Qu'en sait-on de ces trucs-là ?"
        },
        {
            "start": 3229,
            "end": 3232,
            "text": "Matière noire et énergie sombre, on ne sait pas ce que c'est."
        },
        {
            "start": 3232,
            "end": 3234,
            "text": "Mais on peut modéliser l'inconnu."
        },
        {
            "start": 3234,
            "end": 3236,
            "text": "Je vais vous donner un exemple."
        },
        {
            "start": 3236,
            "end": 3238,
            "text": "L'air dans cette pièce, on sait qu'il y a de l'air."
        },
        {
            "start": 3238,
            "end": 3242,
            "text": "Vous avez jamais vu une molécule d'air, d'oxygène ou d'azote ?"
        },
        {
            "start": 3242,
            "end": 3246,
            "text": "Personne dans cette salle n'a jamais vu de ses yeux une molécule d'air."
        },
        {
            "start": 3246,
            "end": 3248,
            "text": "Or, on sait que c'est là."
        },
        {
            "start": 3248,
            "end": 3251,
            "text": "On peut même mesurer cette pièce à une température, une pression."
        },
        {
            "start": 3251,
            "end": 3256,
            "text": "On peut mesurer l'atmosphère qui est présente dans cette pièce par des paramètres macroscopiques."
        },
        {
            "start": 3256,
            "end": 3258,
            "text": "Désolé si je jargone."
        },
        {
            "start": 3258,
            "end": 3262,
            "text": "Vous pouvez trouver une température et une pression à cette atmosphère que l'on ne voit pas."
        },
        {
            "start": 3262,
            "end": 3265,
            "text": "En physique, on appelle ça une équation d'état."
        },
        {
            "start": 3265,
            "end": 3268,
            "text": "Avec la matière noire et l'énergie sombre, on a une équation d'état."
        },
        {
            "start": 3268,
            "end": 3275,
            "text": "On ne sait pas ce que c'est que la matière noire, mais cette équation peut être modélisée et on peut obtenir des paramètres précis."
        },
        {
            "start": 3275,
            "end": 3276,
            "text": "C'est différent."
        },
        {
            "start": 3276,
            "end": 3280,
            "text": "Ça se comporte comme une matière froide non relativiste."
        },
        {
            "start": 3280,
            "end": 3283,
            "text": "Ça se mesure comme un fluide répulsif."
        },
        {
            "start": 3283,
            "end": 3287,
            "text": "Tout est capturé et mis dans l'équation d'état."
        },
        {
            "start": 3287,
            "end": 3291,
            "text": "Ça peut paraître bizarre ou un peu flou, mais ce n'est pas du pipeau."
        },
        {
            "start": 3291,
            "end": 3293,
            "text": "C'était le message que je voulais vous faire passer."
        },
        {
            "start": 3293,
            "end": 3297,
            "text": "C'est peut-être du pipeau, mais on s'y prend pour que ce ne soit pas du pipeau."
        },
        {
            "start": 3297,
            "end": 3299,
            "text": "L'énergie sombre est un peu problématique."
        },
        {
            "start": 3299,
            "end": 3301,
            "text": "Je termine avec quelques images."
        },
        {
            "start": 3301,
            "end": 3303,
            "text": "Une dernière image, c'est la matière noire."
        },
        {
            "start": 3303,
            "end": 3307,
            "text": "On ne voit pas la matière noire, mais on peut trahir sa présence par effet de l'antillage gravitationnel."
        },
        {
            "start": 3307,
            "end": 3309,
            "text": "C'est ce qu'on a fait sur tout le ciel."
        },
        {
            "start": 3309,
            "end": 3313,
            "text": "La première image de la matière noire sur tout le ciel a été obtenue par Planck."
        },
        {
            "start": 3313,
            "end": 3315,
            "text": "Quand on ne sait pas, on ne met pas."
        },
        {
            "start": 3315,
            "end": 3317,
            "text": "Voilà la présence de matière noire."
        },
        {
            "start": 3317,
            "end": 3325,
            "text": "Et les trois images de Planck qui nous ont permis d'obtenir ces résultats, la température, la polarisation et la matière noire, avec plein de belles choses."
        },
        {
            "start": 3325,
            "end": 3330,
            "text": "Je vais conclure en disant qu'il y a plein de belles choses à faire."
        },
        {
            "start": 3330,
            "end": 3338,
            "text": "D'abord, les ondes gravitationnelles, qui ouvrent une nouvelle fenêtre sur l'univers, pas encore cosmologique, mais qui permettent de bien comprendre les objets compacts dans l'univers."
        },
        {
            "start": 3338,
            "end": 3342,
            "text": "Je ne vais pas en parler, ce n'est pas ma spécialité, mais c'est important."
        },
        {
            "start": 3342,
            "end": 3344,
            "text": "La très belle physique et la très belle métrologie."
        },
        {
            "start": 3344,
            "end": 3353,
            "text": "Et un peu d'astrophysique, car les barres d'erreur des zones sur le ciel des sources gravitationnelles ont été réduites grâce aux compléments des observations astronomiques."
        },
        {
            "start": 3353,
            "end": 3356,
            "text": "Il y a eu un prix Nobel en 2017 qui était bien mérité."
        },
        {
            "start": 3356,
            "end": 3358,
            "text": "Les Français sont très en pointe là-dessus."
        },
        {
            "start": 3358,
            "end": 3361,
            "text": "Et il y a surtout le satellite Euclide."
        },
        {
            "start": 3361,
            "end": 3371,
            "text": "Le satellite Euclide, que nous allons lancer en 2022, l'Agence spatiale européenne, avec une très grosse contribution française, va notamment envoyer la plus grosse caméra jamais envoyée dans l'espace 600 millions de pixels."
        },
        {
            "start": 3371,
            "end": 3379,
            "text": "Il va obtenir des images extraordinaires de tout le ciel, des milliards de galaxies, sur lesquelles on va mesurer les effets de ces éléments gravitationnels pour obtenir la matière noire."
        },
        {
            "start": 3379,
            "end": 3384,
            "text": "Et on va faire des fonctions de corrélation pour mieux comprendre l'évolution de l'énergie sombre."
        },
        {
            "start": 3384,
            "end": 3392,
            "text": "Je termine avec quelques images, en évoquant le fait que nos travaux scientifiques produisent des images, tant mieux, qui sont belles, et que le public s'approprie."
        },
        {
            "start": 3392,
            "end": 3395,
            "text": "C'est le Hubble Deep Field, le champ profond Hubble."
        },
        {
            "start": 3395,
            "end": 3406,
            "text": "On est ravi de voir que ces images permettent aux humains, aux hommes et aux femmes, d'obtenir une vision du monde, une représentation du monde à laquelle nous contribuons, même si ces images nous échappent."
        },
        {
            "start": 3406,
            "end": 3411,
            "text": "Ce n'est pas mon coucher de soleil en vacances, c'est pris de la planète Mars, par Spirit."
        },
        {
            "start": 3411,
            "end": 3416,
            "text": "Vous voyez que les images scientifiques, quand elles sont prises dans un contexte autre que scientifique, peuvent apporter beaucoup."
        },
        {
            "start": 3416,
            "end": 3421,
            "text": "Votre regard a changé depuis que je vous ai dit que cette image a été prise sur Mars, même si elle est publique."
        },
        {
            "start": 3421,
            "end": 3423,
            "text": "Il y a aussi une image qui montre qu'on est tout petit."
        },
        {
            "start": 3423,
            "end": 3425,
            "text": "Voilà la Terre vue de Mars, cette image que vous connaissez peut-être."
        },
        {
            "start": 3425,
            "end": 3436,
            "text": "La science sert à faire progresser les connaissances, mais elle sert aussi à tout un chacun, j'espère que vous en faites partie, à avoir une vision du monde et une représentation."
        },
        {
            "start": 3436,
            "end": 3447,
            "text": "L'imagerie scientifique et les résultats scientifiques aident à se représenter le monde, comme cette image qui a eu un grand impact il y a 50 ans sur la petitesse et la beauté de la Terre."
        },
        {
            "start": 3447,
            "end": 3455,
            "text": "Le Fonds cosmologique, j'espère, participe de cette vision du monde et que les humains, les artistes aussi se sont emparés de cette image."
        },
        {
            "start": 3455,
            "end": 3460,
            "text": "Mais plus globalement, nous espérons tous apporter une vision du monde."
        },
        {
            "start": 3460,
            "end": 3463,
            "text": "Et dernier point, et c'est ma dernière slide, c'est promis."
        },
        {
            "start": 3463,
            "end": 3470,
            "text": "Les scientifiques ne sont pas hors de la société l'opportunité de travailler avec des réfugiés dans mon université."
        },
        {
            "start": 3470,
            "end": 3480,
            "text": "Si on m'avait dit il y a quelques années que je parlerais du fonds cosmologique à des réfugiés en situation compliquée, lors d'une soirée astronomique à Orsay, je n'aurais pas cru."
        },
        {
            "start": 3480,
            "end": 3481,
            "text": "Mais c'est arrivé."
        },
        {
            "start": 3481,
            "end": 3483,
            "text": "C'est de grandes expériences."
        },
        {
            "start": 3483,
            "end": 3485,
            "text": "La science n'est pas décloisonnée de la société."
        },
        {
            "start": 3485,
            "end": 3488,
            "text": "Elle participe de la culture et de la vision du monde."
        },
        {
            "start": 3488,
            "end": 3489,
            "text": "On essaie d'y prendre part."
        },
        {
            "start": 3489,
            "end": 3491,
            "text": "Merci de votre attention."
        },
        {
            "start": 3491,
            "end": 3492,
            "text": "Désolé du temps passé."
        }
    ],
    "text": "et de comment scientifiquement on étudie l'univers tout entier, ce qui n'est pas facile, on n'en a qu'un seul. Ça paraît bête, mais c'est le cas. Je vais vous parler de l'univers de manière scientifique. Je vais vous parler de l'univers de manière scientifique. Je vais m'assurer que mon bidule marche bien. Voilà. Et je vais vous parler du satellite Planck et de comment scientifiquement on étudie l'univers tout entier, ce qui n'est pas facile, on n'en a qu'un seul. Ça paraît bête, mais n'avoir qu'un seul univers, c'est un problème en science. Et l'histoire du satellite Planck, que je relate aussi dans ce livre, que vous avez peut-être vu. Je ne raconterai pas tout ce qu'il y a dans le livre, mais je vous donnerai l'essence de notre travail et de l'approche que l'on a pour étudier l'univers. Alors... Je ne sais pas s'il y a des interférences, mais ça devrait marcher. Avant d'attaquer le dur du sujet de la science, je profite d'avoir du public pour rappeler que la science, c'est d'abord des scientifiques, des femmes et des hommes. Ça paraît bête, mais c'est des gens. La science toute seule n'existe pas. Je crois que les orateurs, il y a beaucoup plus d'hommes que de femmes, alors qu'il y a beaucoup de femmes scientifiques et très valeureuses. Donc il y a des femmes scientifiques. Ce ne sont pas mes photos de vacances, mais de missions. Je ne faisais pas les pires. Parce que la science, ce sont des scientifiques qui se rencontrent et qui confrontent leurs idées. Le consensus n'émerge pas nécessairement tout de suite, n'émerge pas naturellement. La science, c'est la confrontation des idées. Confrontation dans le respect, avec une méthode scientifique, mais il y a des confrontations d'idées. On va dans des conférences, à Los Angeles, à Hawaii, à Rome, etc. La science, ce n'est pas que vous êtes seul dans votre coin, vous avez une idée géniale, tout va bien. Si vous avez une idée géniale, vous la confrontez aux autres, qui vont vous dire que c'est n'importe quoi. Vous devez les convaincre, ça prend du temps. Mais c'est pour ça que tout prend du temps. Si vous faites des maniples spatials, il faut trouver la broutille de 1 milliard d'euros. Ce n'est pas facile, ce ne sont pas vos banquiers, ce sont les agences spatiales. Il y a des procédures sélectives et compétitives. Ça prend des années de l'expertise, de l'énervement, du découragement, mais ce sont des ambitions scientifiques qui nous portent et qui nous guident. On aime ça. Mais ce n'est pas du tout cuit et pas aussi simple qu'on peut l'imaginer. Ça se fait en équipe. J'étais à Los Angeles et à Groningen avec Carina Caputi, une collègue, et Dr Brenda Fry. Les filles sont présentes dans la science et je souhaitais l'indiquer ici. La science se fait aussi dans des grands établissements, des laboratoires de recherche. Pour moi, c'est Paris-Sud et Paris-Saclay, où on a des grands équipements, comme tous les labos de recherche. Ici, on a une salle de test en environnement spatial où on teste nos instruments avant de les envoyer dans l'espace. Après, il y a des moyens informatiques, des data centers, etc. Il y a beaucoup de choses qui existent dans toutes les universités. Il y a une spécificité à Paris-Sud et Paris-Saclay, c'est la MIS, maison d'initiation et de sensibilisation aux sciences. Je ne sais pas s'il y a des enseignants ici. C'est plutôt réservé aux gens d'Île-de-France, mais tout le monde est bienvenu. On a un laboratoire pour les 9-15 ans, c'est-à-dire du CE2 à la 3e, où les élèves viennent une journée faire des manips scientifiques encadrés par des doctorants sur des ateliers vraiment conçus par les chercheurs et adaptés. Et on pense que promouvoir la science auprès des plus jeunes, bien sûr, auprès de nos étudiants, c'est notre mission première, mais aussi auprès des plus jeunes, ça fait partie de nos missions. On a mis les moyens avec des partenaires, dans un beau bâtiment, etc. C'est une expérience sur laquelle je participe et qui est très agréable, je dois dire. Venons-en au sujet. Je ne suis pas hyper fan de Star Wars, j'aime bien Star Wars, comme tout le monde, mais mon livre s'appelle le côté obscur de l'univers. Et pour des raisons de production du livre, le titre a été choisi très tardivement dans le processus. J'avais déjà écrit le livre quand le titre a été choisi. Le titre que j'avais proposé à mon éditrice, c'était 52 nuances d'univers avec Planck. Je trouvais ça sympa, mais elle a trouvé que c'était pas... 52 parce que Planck a 52 bolomètres, vous verrez dans quelques instants. L'éditrice a dit non. Et donc, dans le livre, je n'ai même mis aucune référence à Star Wars, parce que je n'avais pas imaginé ça. Donc, si jamais vous lisez le livre, ne vous étonnez pas, de ne pas avoir de référence à Star Wars. Pour me faire pardonner, pour les futurs lecteurs, je mets un peu de Star Wars dans la présentation pour vider la frustration que j'ai eue de ne pas pouvoir rajouter quelques petites incises à ce sujet-là. Il y aura des petits thèmes comme ça. L'idée, c'est de parler de l'univers il y a très longtemps. Et de manière scientifique, même si la science-fiction est formidable, on est ici pour parler de science. Ce qui est bien en science, c'est qu'on a une ambition scientifique qui est peut-être pas de prouver, mais en tout cas d'utiliser le fait que les lois de la physique sont universelles et qu'elles sont les mêmes partout dans l'univers. C'est un postulat. Vous savez que la science, c'est formidable. Il y a une méthode très carrée, très logique, très suivie. Mais si on réfléchit un peu, la science est un géant au pied d'argile. Quand vous n'avez qu'un seul univers et que les lois de la physique ne sont pas les mêmes partout dans l'univers, qu'est-ce que vous faites ? Partez-vous en vacances ? Non, on n'arrête pas, mais on doit mettre des postulats qu'on essaie de vérifier, mais le problème des postulats, c'est qu'on n'arrive pas à les vérifier. C'est un peu comme en physique quantique. Néanmoins, on prend ce parti pris. Les lois de la physique sont universelles. L'univers est isotrope et homogène à une très grande échelle. Et on avance. Il y a quand même des choses très belles avec ça. Ici, je vous montre deux images. D'ailleurs... D'ailleurs, qu'est-ce que sont ces images ? A gauche, c'est le Soleil, pris par un astronome amateur à Orsay, qui peut-être est dans la salle où vous parlez, Fabrice Noël. C'est le Soleil pris en Hα, que vous connaissez, c'est notre étoile, avec des petites vibrations à la surface, des petites protubérances qu'on a mises en or et blanc. A droite, c'est une image qui ressemble, mais qui n'a rien à voir, c'est tout l'univers. C'est le fond cosmologique, dont je vais parler pendant une quarantaine de minutes. C'est la première lueur de l'univers. Pour être plus précis, c'est la première lueur qui peut nous parvenir, parce qu'avant, l'univers était opaque. C'est le fond cosmologique, CMB, Cosmic Macrowave Background, cette première lueur de l'univers. Ces deux objets n'ont rien à voir. C'est tout l'univers, c'est juste une petite étoile. Aujourd'hui, c'est tout l'univers, il y a 370 000 ans après le Big Bang, il y a 13,8 milliards d'années. Et pourtant, la physique est quasiment la même. C'est un plasma chaud 6 000 degrés à la surface, c'est un plasma chaud. 3 000 degrés au moment de la recombinaison. Ça vibre, ça vibre. Il y a des électrons et des baryons, de la matière ordinaire. Il y a des électrons et des baryons. Il y a des petites subtilités. Ça, c'est tout petit, ça, c'est très grand. C'est beaucoup plus grand. Là, il y a beaucoup de matière noire, là, il n'y en a pas. Là, il y a 10 puissance 9 photons pour un baryon. Là, je ne sais pas combien il y en a, mais je pense que ce n'est pas forcément le même rapport. Mais la physique est la même. Pour aller même plus loin, peut-être que ceux qui étaient là hier l'ont déjà vu, pour ceux qui ne le voient pas, je vais vous faire la démonstration. Voici un petit pendule fait maison, qui oscille. C'est Galilée Ier, au début du XVIIe siècle, qui avait montré le formalisme mathématique et qui avait résolu l'équation du mouvement. C'est un petit mouvement oscillant. On appelle ça... L'équation mathématique, c'est une équation différentielle du deuxième ordre d'un coefficient constant linéaire qui a juste pour solution un petit cosinus. Figurez-vous que cette petite équation de l'oscillateur harmonique est la même équation qui régit les vibrations du Soleil à gauche et les vibrations de l'univers primordial à droite. C'est juste une petite équation différentielle toute simple, et c'est la même. C'est ça qu'on aime bien en physique et en science, c'est avoir une sorte d'unicité de l'outil mathématique et des lois physiques qui s'appliquent à plein d'échelles. Ça ne peut pas s'appliquer à tout, mais ça s'applique ici, du pendule de Galilée au Soleil à l'origine de l'univers. La forme de l'équation est la même, mais les termes et les paramètres ne sont pas les mêmes. Là, la masse de petit tube de colle, je ne sais pas combien ça fait, 20 g. Là, toute la masse du Soleil. Là, tout l'univers. Et les forces de rappel, là, c'était la gravité du Soleil, et puis... Enfin, la gravité de la Terre, pardon. Là, c'est la masse du Soleil. Et puis là, vous avez, parce que ce sont des équations locales, toute une quantité de matière noire et des baryons, c'est-à-dire la matière ordinaire. Les ordres de grandeur ne sont pas les mêmes, mais les équations. Pourquoi ça vibre ? Ça sera important dans la suite. Vous avez la gravité qui attire, vous le savez. La gravité attire. Vous avez des petites fluctuations, des petites surdensités. Ça attire. Mais il y a quelque chose qui s'oppose à cette attraction. Quand vous êtes dans un plasma, vous avez des électrons libres. Je l'évoquerai tout à l'heure. Je fais un petit résumé. Ces électrons libres ont le bon ou le mauvais goût d'interagir fortement avec la lumière, avec les photons. On appelle ça la diffusion Thomson, ou Compton, si vous connaissez Compton. La gravité fait votre petit morceau de matière, ici ou là, se concentrer. Mais en se concentrant, comme la lumière et la matière sont couplées, c'est un terme technique qui dit que la lumière et la matière vont ensemble, vous avez plein de lumière qui est concentrée. La lumière n'aime pas ça, donc elle pousse vers l'extérieur. On appelle ça la pression de radiation. Vous avez compétition entre gravité et pression de radiation. Donc, ça se met à osciller. L'univers primordial vibre, tout comme le Soleil, aujourd'hui, vibre. C'est ça qu'on va étudier. Vous savez peut-être que tout système vibrant ne vibre pas par hasard. Il vibre selon des propriétés qui lui sont propres. On appelle ça des modes propres, en physique. Il vibre comme une cloche, un violon ou une guitare. Ça ne fait pas n'importe quel son, mais un son adapté à la cavité. Là, la cavité, c'est tout l'univers, le Soleil. Votre violon, votre tambour ou que sais-je, c'est votre instrument. Le son que ça donne dans un instrument de musique sur Terre, avec une onde de pression qui se propage, puisque là, c'est via l'air, vous caractérise quasiment complètement votre instrument. Là, ce sont des oscillations acoustiques. C'est comme du son. C'est acoustique, c'est la matière qui se déplace. Mais après, il n'y a pas d'air pour propager le son. Il n'y a rien qui se propage, il y a juste la lumière. Notre chance, nous, astrophysiciens, c'est que cette matière qui bouge selon des oscillations acoustiques engendre des oscillations de lumière. Nous, on voit la lumière. Ces oscillations acoustiques, on peut les voir avec de la lumière et savoir comment ça vibre. Si on sait comment ça vibre, on peut savoir de quoi c'est fait. Quelle est la température, la vitesse ? On peut savoir plein de choses. Étudier l'origine de l'univers, notamment avec le satellite Planck, en étudiant le fond cosmologique, c'est étudier les vibrations de l'univers tout jeune. Les vibrations vous donnent une carte d'identité complète de ce qui se passe. Voilà pour l'introduction. Pour ceux qui seraient nouveaux en astronomie, je vais vous raconter les échelles importantes que l'on va discuter. Le système solaire, c'est une image d'artiste. Le système solaire a une taille de quelques heures-lumière. La lumière met quelques heures à aller au confins du système solaire. Elle met une seconde pour faire la distance Terre-Lune et huit minutes pour faire la distance Terre-Soleil. Le système solaire, on connaît bien. Je passe, pardon. On va un peu plus loin. Au niveau des étoiles dans notre voie lactée, on est à quelques années-lumière. L'étoile la plus proche est à 4,2 années-lumière, proxima du centaure. Les étoiles ont une couleur, elles sont très belles. Tout ce que je vais vous montrer, c'est des vraies images. Les étoiles sont à quelques années-lumière, jusqu'à quelques milliers d'années-lumière. L'ordre de l'année, centaines, milliers. Si on va plus loin autour de nous, on va dans le royaume des nébuleuses. Les nébuleuses, c'est très beau, formidable. C'est du gaz composé d'hydrogène et plein d'autres atomes, selon où vous êtes dans la galaxie et à l'époque de l'Univers. Vous avez plein d'atomes complexes, du silicium, des molécules, du OH, du HCN, plein de trucs. Et de l'eau. Il y en a partout dans l'Univers. Vous pointez le moins de radiotélescopes, il y a de la molécule d'eau partout. Ce n'est pas de l'eau liquide, ce n'est pas des océans, mais vous avez des molécules d'eau partout. C'est dans ces cocons de gaz que se forment les étoiles. Par instabilité gravitationnelle, votre nuage se met à s'effondrer et puis se met à former des étoiles. Ce sont des processus qu'on comprend à peu près. La taille, c'est quelques centaines d'années-lumière, voire plus, quelques milliers d'années-lumière, l'échelle de l'image. C'est le ciel vu par Planck, mais ce sont des zooms à gauche et à droite obtenus par le Hubble. Si on va encore un peu plus loin, on va dans les galaxies. Les galaxies sont très grandes. La taille, ici, serait quelque chose comme un demi-million d'années-lumière ou un quart de million d'années-lumière. Ce sont des vraies images, mais des fausses couleurs. On les voit par le satellite Spitzer dans l'infrarouge. Ce satellite est cher à mon cœur. Quand je travaillais pour la NASA aux États-Unis, j'ai vu lancer ce satellite, j'ai travaillé sur ses instruments. J'ai participé à la prise de ces images il y a très longtemps, il y a quasiment plus de 15 ans. Si mon système de vote marche, je vais vous poser une question. Selon vous, quel est le composant principal dans une galaxie ? Est-ce des étoiles, des trous noirs ? On va essayer de le faire fonctionner, ce petit bidule. Voilà. Je vais essayer de cacher... Vous pouvez voter. Si vous pensez que dans une galaxie, le plus important en masse, vous n'avez qu'un seul choix, ce sont les étoiles. Vous tapez A, B, etc. Si vous êtes par SMS, vous envoyez la lettre. Est-ce que ça marche ? Je vois zéro réponse. C'est bon, ça marche. Merci, vous sauvez ma matinée. C'est vous qu'on doit remercier ? Bon, merci. Selon vous, même si je pense que beaucoup connaissent la réponse, quel est le composant principal... J'ai mis pourcentage, mais je devrais corriger la question. Quel est le composant principal dans une galaxie, en masse ? Ce sont des étoiles A, matière interstellaire, nébulose et gaz B, trous noirs C, planète D ou matière noire E. Réfléchissez, vous pouvez répondre ce que vous voulez. J'utilise ça avec mes étudiants en amphi, à Paris-Sud, à Orsay. Ils sont moins nombreux que vous, mais ils sont bien la moitié. Ça permet de voir s'ils suivent bien. Je vais voir si vous suivez bien. On va dévoiler les réponses, on est là pour parler de cosmologie. Vous pouvez toujours répondre. Suspense insoutenable. Ah oui, alors, c'est pas comme hier. Donc, alors... Ah oui, c'est pas la question que je voulais... Je me suis un peu trompé. C'est ce que je donne à mes étudiants, mais je voulais faire un truc comme hier avec les pourcentages. Je suis arrivé vite. Il fallait donner un pourcentage, c'était bien écrit. C'est pour ça qu'il y a pas beaucoup de réponses. Je proposais de donner des pourcentages, 10 % de gaz, de matière noire, etc. Et ça s'accumulait. J'essaierai de faire mieux la prochaine fois. Mais on va quand même regarder les réponses. Mais je pense qu'elles ont pas été réinitialisées. Je pense que ça correspond à ce que racontaient mes étudiants. Les étoiles, c'est ce qu'on voit dans les galaxies. Donc, de fait, elles composent une grande partie des galaxies. C'est indéniable. Les nébuleuses, en revanche, composent qu'une toute petite partie. Le gaz et les nébuleuses reposent une toute petite partie. C'est quelque chose comme 1 %. C'est très important parce que les nébuleuses, le gaz, la poussière, changent la couleur des galaxies et leur émission de lumière. C'est très important pour nous qui observons la lumière. Les planètes sont importantes pour nous, mais en termes de masse, c'est rien du tout. Ce qui compte dans les galaxies, c'est la matière noire. La matière noire, c'est 80 % de leur composition en masse. Le reste étant essentiellement des étoiles. Il y a des trous noirs, mais c'est négligeable en masse. C'est un mystère, on ne sait pas ce que c'est que la matière noire. On arrive à tracer sa répartition, maintenant, avec plein de méthodes, du lentillage faible, etc. Je reviendrai à la fin pour Euclide. Mais c'est un mystère. Des alternatives à la matière noire, c'est de modifier les théories de gravité. Modifier la relativité générale, par exemple. C'est un gros travail. Des collègues s'y attellent. Je ne suis pas spécialiste, mais les résultats ne sont pas hyper probants pour expliquer ce qu'on va discuter dans un instant, ce qui se passe au tout début de l'Univers. Ces théories modifiées peuvent expliquer ce qui se passe dans les galaxies, mais pas au tout début de l'Univers. Les galaxies sont très grandes, composées de matière noire. Si on voulait représenter le système solaire à cette échelle, sur cet écran, cette image fait à peu près deux mètres, la taille du système solaire ne serait pas un pixel, un micron, mais la taille d'un atome. Le système solaire est tout petit, mais rapporté à cette échelle, c'est un atome sur l'écran. C'est tout petit. Nous ne sommes peu de choses, mais c'est confirmé. On va à plus grande échelle. Ce sont les amas de galaxies. Sur cette image réelle, ce sont des galaxies, sauf quatre étoiles. Une, deux, trois, quatre, qui sont des étoiles d'avant-plan de notre Voie lactée. La taille de cette image serait de l'ordre de 1 ou 2 millions, plutôt 2 millions d'années-lumière. Là, vous avez des centaines de galaxies. Ce sont les plus grosses structures de l'Univers. Ça pèse typiquement 10 puissance 15 masse solaire, donc un million de milliards d'étoiles. Sachant qu'une galaxie, c'est typiquement 10 puissance 9, 10, 11 masse solaire, ça dépend du type de galaxies, donc des milliards d'étoiles. Voilà les très grandes structures qu'on observe aujourd'hui. Et puis, quand vous allez le plus loin possible, c'est cette image, le fond cosmologique. C'est le plus loin que nous puissions observer avec de la lumière. C'est cette image prise par le satellite Planck, qu'on a relâchée il y a quelques mois, même si Planck a fonctionné il y a quelques années. Ça représente les petites fluctuations du fond cosmologique. Je vais en parler maintenant. On a mis une zone grisée, pour dire qu'on a triché dans cette zone à l'intérieur. À l'intérieur de cette zone, la veau lactée nous gêne. On a interpellé le signal pour faire une jolie image, mais nous, en faisant l'analyse scientifique, on exclut ces zones grisées. Mais ça fait une belle image. Nous utilisons de la lumière, nous, les astrophysiciens. Je vais enlever ce siège. Il y a d'autres vecteurs de l'information qui sont là. Il y a les astroparticules, les ondes gravitationnelles, les neutrinos. Je me concentrerai sur la lumière, parce que historiquement, c'est pluvieux. Et ça marche encore pas mal. Voici une image d'une belle galaxie d'Andromède prise dans le domaine visible, en ultraviolet et en infrarouge. On peut se demander quelle est la vraie couleur de la galaxie. Il n'y a pas de vraie couleur, il y a des couleurs, des fréquences, des longueurs d'onde. La galaxie présente un visage différent selon les trois longueurs d'onde. Dans le visible, vous voyez les étoiles et la poussière. La poussière, c'est tous ces nuages de gaz qui absorbent la lumière visible. Vous avez des voisins, ici et là. Là, vous voyez la poussière qui absorbe. Dans l'ultraviolet, vous voyez les jeunes étoiles, très massives et très chaudes, qui viennent juste de naître, mais qui sont nées hors de la poussière. Si il y a de la poussière, vous ne les voyez pas. C'est pour ça que vous avez des zones sombres. C'est probablement qu'il y a de la poussière qui cache. Là, vous voyez un peu mieux sur les côtés. Dans l'infrarouge, proche et moyen, vous voyez en bleu, en fausse couleur, les 3,6 microns d'un speedzer, les vieilles étoiles, qui sont froides, à 3000 degrés à leur surface, qui se concentrent surtout au centre. Et en rouge, c'est le 24 ou le 8 microns, je me souviens plus, c'est la poussière chauffée par les étoiles qui sont en train de naître, mais cachées dans la poussière. Avec une vision multicouleur, vous arrivez à avoir une carte d'identité de votre objet astrophysique. On ne peut pas y aller, c'est ça le problème. Il faut se débrouiller avec ce qu'on a. La lumière est un très bon vecteur. On fait ça aussi avec les rayons X, avec tout le spectre électromagnétique. Mais là, j'ai utilisé ces images car c'était particulièrement visible. Maintenant qu'on sait que la question... Enfin, on va se poser, on utilise la lumière, on n'a qu'un seul univers, on a une méthode scientifique, comment on va mettre tout ça ensemble pour répondre aux questions de quelle est l'origine de l'univers, ou quelles sont les origines de l'univers, et comment a-t-il évolué, et comment on s'y prend pour avoir une carte d'identité ultra précise. Les deux questions que les scientifiques essaient de résoudre, en tout cas, les deux questions qui se posent, on n'a pas les réponses sur tout, c'est deux familles de questions. Au début, pourquoi l'univers était très homogène ? Homogène, ça veut dire pour simplifier le même partout. Et deuxièmement, pourquoi aujourd'hui l'univers est très hétérogène, très contrasté ? Peut-être que vous vous demandez ce qu'il raconte avec son univers homogène. C'est quoi cette question ? Je ne me pose pas la première question. Pourquoi l'univers est là ? Pourquoi l'univers est là, c'est plus philosophique que scientifique, même si c'est très intéressant, mais je n'ai pas de réponse. Quand on fait des observations de ce fameux fond cosmologique, je vais y venir, on se rend compte que ce fond cosmologique est très homogène. Il est tellement homogène qu'on a mis beaucoup de temps à découvrir qu'il était un peu inhomogène. Ces petites variations sont plus petites qu'une partie pour 100 000. C'est très homogène, c'est un peu comme un lac ultraplat et calme, et vous avez des petites vaguelettes qui sont lors du cent millième de la surface. Vous ne les voyez pas. Ça nous prouve que 370 000 ans après le Big Bang, l'univers était ultra homogène. La matière et la lumière sont couplées. Si la lumière nous dit qu'il y a des petites fluctuations, hyper petites, c'est-à-dire que les fluctuations de densité sont hyper petites. L'univers n'était pas très contrasté, il était tout lisse, en quelque sorte, homogène. On a du mal à comprendre, parce que l'univers, entre le Big Bang et 370 000 ans, il s'est passé plein de choses. Si vous laissez un gaz s'étendre dans une pièce, c'est seulement au bout d'un moment qu'il sera homogéné en température, en pression, etc. Là, on pense que le temps n'était pas si grand que ça. Il aurait pu y avoir des variations de température, de pression, de densité. Non, l'univers est super homogène. C'était une question très épineuse, parce qu'on n'avait pas de mécanisme pour résoudre ce problème. La physique, a priori, ne prédisait pas ça. Les gens, dans les années 80 et un peu plus tard, ont invoqué des modèles d'inflation cosmique. Ce n'est pas une baguette magique. Quand vous avez un problème, vous essayez de trouver une solution. Les gens commencent à regarder. Cette solution est super élégante, super simple à calculer. Elle devient très populaire. Ça ne veut pas dire que c'est vrai. Il n'y a pas de vérité en science. Ça veut dire que ça marche et qu'on est content. Il faut se souvenir de la démarche scientifique. Vous avez des théories que vous confrontez aux données. Si les données ne vous tuent pas vos théories, vous gardez la théorie. Est-ce que c'est la meilleure ? Je n'en sais rien. La meilleure reste jusqu'à ce qu'il y en ait une nouvelle. L'inflation a ce très bon goût de partir des fluctuations quantiques de l'Univers, qui sont relativement homogènes, et de plaquer à l'échelle macroscopique toutes ces petites fluctuations quantiques. Avec les mains et d'un point de vue sensible, l'Univers n'a pas le temps d'être hétérogène. Il est tellement étendu, très rapidement, en plus petit que 10,35 secondes, sur de très grandes échelles, qu'il n'a pas le loisir de dire qu'il va être plus ou moins dense. Il est tout de suite projeté sur de très grandes échelles. L'inflation résout ça, très simplement, très élégamment. Donc, ça marche, on comprend. Après, est-ce que c'est vraiment comme ça ? On ne sait pas encore, mais c'est peut-être pas ça la question. On ne saura jamais, on n'y était pas. Il faut avoir une théorie scientifique basée sur une physique que l'on comprend, que l'on peut prédire, et d'évoquer des scénarios. Par exemple, l'inflation, qui est arrivée bien avant une partie de ces détections. En même temps, ça a été un aller-retour. Mais ces prédictions ont été défiées par les données, notamment du satellite Planck. C'est la démarche scientifique. Vous avez des données, une théorie, même si elle était calée pour que ça marche. Mais est-ce que votre théorie, dans ces derniers retranchements des toutes dernières données, survit ? Vous serez étonnés d'apprendre que oui. Cette théorie aussi farfelue... En tout cas, selon moi, je ne suis pas théoricien. Cette théorie aussi farfelue de l'inflation résiste très bien à toutes les données jusqu'à aujourd'hui. Donc, on prend. Donc, le modèle d'inflation. Et ensuite, comment, à partir des petites fluctuations qui sont ici de densité, on arrive aux grands amas de galaxies, aux galaxies, aux étoiles, aux planètes, etc., et à nous ? Eh bien, ça pourrait être un problème si on ne prend en compte que la matière visible. On sait depuis les années 30 qu'il y a de la matière noire, ou en tout cas, qu'il y a un problème avec la matière ou la gravité. On le résout en ce moment en disant qu'il y a de la matière noire. Mais si vous ne mettez pas de matière noire, ça ne marche pas. C'est pour moi l'argument le plus fort pour la présence d'une matière invisible et non baryonique. Si vous prenez les petites fluctuations et que vous laissez dérouler le temps, il n'y a pas assez de temps. Pourtant, c'est long, 13,8 milliards d'années. Vous n'avez pas assez de temps pour former des gros amas de galaxies, des grosses galaxies, des étoiles, etc. Il faut vraiment beaucoup de matière dès le début. Donc, il faut cette matière noire. On n'y arrive pas autrement. On a invoqué le modèle lambda-CDM. Lambda signifie constante cosmologique qui traduit l'expansion accélérée de l'Univers. Je ne l'ai pas évoqué, mais l'Univers est en expansion accélérée. Ce sont les observations faites depuis 20 ans. CDM pour Cold Dark Matter, donc matière noire froide. C'est cette fameuse matière noire qui aide à la structuration des grandes structures. Cold, froid, ça veut dire non relativiste. Il ne faut pas être relativiste, sinon ça ne marche pas. La matière noire est très vite non relativiste et permet à la matière baryonique de s'accréter. On essaie de répondre à ces questions. On a des modèles, mais qui ont plein de paramètres libres, qui peuvent être ajustés et qui ont parfois des prédictions sur un spectre très large. L'idée, c'est de faire le ménage. C'est pour ça qu'on a fait le satellite Planck. Le fonds cosmologique, je vais vous passer quelques instants là-dessus, est une observation importante. Ce n'est pas la seule. Il y a des gens qui font des relevés de galaxies, des gens qui font des corrélations de galaxies. C'est une des mesures importantes. J'insiste, j'ai travaillé dessus avec Planck, mais il n'y a pas que celle-là. Cette idée du fonds cosmologique est très naturelle. C'est ce que j'essaie de vous présenter en une minute et demie. Il y a très longtemps, depuis l'aube de l'humanité, les gens se sont probablement posés la question, mais on a les publications qu'à partir du XVIe siècle. Les gens se sont demandé... Les publications sont toujours importantes pour les scientifiques. Pourquoi la nuit est-elle noire ? Je pourrais vous en parler des heures. Pourquoi la nuit est noire ? Cette question peut paraître saugrenue, mais si on y réfléchit un instant, elle n'est pas si saugrenue que ça. Si vous regardez le ciel étoilé, il y a plein d'étoiles. C'est noir entre les étoiles. Maintenant, si on réfléchit, vous avez vu les images de galaxies. Il y a plein de galaxies dans l'Univers. On peut se dire que n'importe quelle ligne de visée que l'on pointe avec notre doigt tombera sur une galaxie, donc sur une étoile. Si on admet cette hypothèse, qui est fausse, mais peu importe, que dans chaque direction, à un moment, on tombera bien sur une étoile, pourquoi la nuit est-elle noire ? Elle devrait être tapissée d'un fond lumineux d'étoiles ou de galaxies. Or, la nuit est noire. Il y a un paradoxe, comme tous les paradoxes, un problème mal posé, connu sous le nom de paradoxe d'Alberts, je ne sais plus où je l'ai mis. Alberts, qui évoquait l'apparente contradiction entre l'infinitude de l'Univers et du nombre d'étoiles et la nuit noire. S'il y a une infinité d'étoiles, la nuit devrait être brillante. C'est le premier à trouver une explication qui n'est pas scientifique. C'est Edgar Allan Poe, qui n'est pas scientifique, que vous connaissez peut-être, dans son poème en prose, Eureka, de 1848, qui est le premier à donner une explication considérée scientifiquement valide. Il ne pouvait pas la prouver, il n'était pas scientifique. Mais il a dit que si les étoiles ne sont pas éternelles, ça résout le problème. Il peut y avoir une infinité d'étoiles, mais si elles vivent qu'une fraction de l'âge de l'Univers, elles s'éteignent. La grande baignoire de l'Univers ne se remplira pas de lumière. Une baignoire remplie d'eau, ça déborde quand il y a trop de lumière. Comme les étoiles s'éteignent, à certains moments, l'Univers ne se remplit pas de lumière. Ça a été démontré par Lord Kelvin, qui est quelqu'un de très respecté en physique, qui a démontré par le calcul que c'était ça. Il ne faut pas oublier qu'avant les années 1930, les gens pensaient que l'Univers était éternel, immuable. Les gens ne se disaient pas, il n'y avait pas de données qui permettaient de contredire ça. Il faut se remettre dans ce contexte. Lord Kelvin, bien qu'il n'était pas au courant des processus physiques ayant lieu à l'intérieur des étoiles, fusion thermonucléaire, il s'est trompé d'un facteur 100 sur l'âge des étoiles. Néanmoins, ce facteur a suffi à prouver que les étoiles ne vivaient pas à un temps infini. Fin du XIXe siècle. Je crois que ce sont ses conférences aux États-Unis en 1897 et qu'il a publiées en 1907. Donc il a dit, fin du jeu, fin du game, comme disait... La nuit n'est pas noire, les étoiles ont une durée de vie finie, tout va bien. Arrive Hubble, fin des années 1920. Il découvre que les galaxies s'éloignent de nous. Je fais ça à mes étudiants aussi, je leur fais faire la loi de Hubble. Personne n'a demandé à ce que les galaxies s'éloignent de nous. On observe quasiment toutes, à part les proches attirés par nous, que toutes les galaxies s'éloignent de nous. Comment vous faites un modèle physique qui explique, ou qui décrit le fait que toutes les galaxies s'éloignent de nous ? Vous pouvez dire que vous êtes le centre de l'Univers. Les humains ont l'habitude de faire ça depuis la nuit des temps. On peut garder ça comme explication, mais ce n'est pas l'approche qu'on va prendre ici. Ça viole le principe cosmologique de tout être pareil partout. On arrive rapidement à l'idée qu'il y a un univers en expansion. C'est l'espace-temps qui se dilate à très grande échelle. Ça ne nous concerne pas, ni la distance Terre-Lune, mais que les très grandes échelles. Vous avez un univers en expansion, tout va bien. La théorie d'Einstein était prête. L'abbé le Maître, Friedmann, Robertson, Walker, tout un tas de travaux théoriques ont permis de donner un cadre théorique à cette expansion de l'Univers qui pouvait être paramétrisée. Mais il y a des esprits chagrins comme Gamow qui se sont dit qu'il y a la théorie, l'expansion, on ne sait pas pourquoi, mais ça marche. Si on remet le film à l'envers de cette expansion de l'Univers, si on met le temps vers les temps passés, l'Univers était plus petit, je n'aime pas ce terme, mais on n'a pas beaucoup de temps, on va faire vite. L'Univers était plus petit et de plus en plus dense dans le passé. C'est un des premiers, à l'avoir publié, qui s'est dit que si on va très loin dans le passé, l'Univers sera très chaud et très dense. L'abbé le Maître l'avait aussi évoqué avec son atome primitif, mais lui a calculé l'implication que ça donnait. Il a calculé qu'au-delà d'une certaine température, la matière et la lumière devaient être liées. C'est ce que je vous disais au début, c'était la notion physique moderne. En étant liées, il devrait y avoir une lumière résiduelle dans l'Univers qui est due à ce passé où l'Univers était très chaud et très dense. Le fait que la matière et la lumière soient liées, la lumière doit avoir un spectre de corps noir, spécial en physique. C'est le premier qui s'est dit que si le Big Bang a eu lieu, il y a nécessairement un résidu lumineux dans l'Univers qui est dû à cette époque très chaude et très dense dans le passé. C'est nos amis Arnaud Penzias et Bob Wilson qui ont découvert ça fortuitement. Ils avaient un radiotélescope et ils ont détecté un signal qu'ils ne comprenaient pas. Ils avaient le détecteur le plus sensible de l'époque, refroidi à l'hélium, l'hélium liquide. Ils avaient un signal résiduel qu'ils mesuraient parfaitement, mais ils ne connaissaient pas l'origine. Ils ont bien vu qu'il y avait le signal qui provenait de la galaxie, le signal qui provenait de l'atmosphère, le bruit de leur détecteur, mais en faisant toutes ces soustractions, il restait le signal à 3 Kelvin. Ils ont peut-être découvert l'émission micro-ondes des fientes de pigeons, car le radiotélescope nichait de nombreux couples de pigeons. Ils ont envoyé des étudiants pour nettoyer tout ça. C'est véridique. Ils ont dit qu'ils avaient l'air ballots si ils découvraient l'émission micro-ondes des pigeons. Ce serait intéressant, mais peut-être pas pour la cosmologie. D'ailleurs, ils ne cherchaient pas la cosmologie. Le signal était toujours là. Qu'est-ce qu'on fait avec ça ? Ils ont attendu 6 mois, le temps que la Terre fasse un demi-tour sur son orbite, en se disant qu'il y a peut-être un truc autour de la Terre. Les ceintures de Van Halen avaient été découvertes peu de temps avant. Ils ont dit qu'il y avait peut-être un truc bizarre. Toujours pareil, rayonnement isotrope significatif, froid, 3 Kelvin, mais présent partout. Penzias et Wilson avaient découvert ce résidu lumineux du Big Bang, le fond cosmologique. C'est une recréation. C'est tout le ciel qu'on représente comme une map-monde. C'est tout le ciel. La température de l'univers est super homogène à 3 Kelvin. Donc, moins 270 degrés Celsius. Super homogène. La preuve du Big Bang... Vous ne pouvez pas prouver une théorie, mais la prédiction du Big Bang était vérifiée. C'est important en science que vous fassiez des observations qui confirment ou qui infirment des résultats théoriques. Maintenant, l'univers, on le comprend de la manière suivante. Avec l'inflation cosmique qui provoque une expansion très forte pendant 10,35 secondes à peu près, qui garde cet univers très homogène à très grande échelle. Ensuite, les trois premières minutes de l'univers où s'effectue la nucléosynthèse primordiale, la génération des noyaux au tout début de l'univers. Quand je vais dans les écoles, toute l'eau dont nous sommes faits ou l'eau dans la bouteille est composée de H2O, deux atomes d'hydrogène et un atome d'oxygène. Tout l'hydrogène a été synthétisé durant les trois premières minutes. On en est certain. On l'a encore mesuré avec Planck récemment. La Big Bang nucléosynthèse marchait très bien. Dans les trois premières minutes, vous ne synthétisez que les atomes légers. Le reste est créé dans les étoiles. Nous sommes des poussières d'étoiles. Vous connaissez la phrase d'Hubert Reeves. C'est vrai à l'exception de l'hydrogène, de l'hélium et de l'ithium. L'univers continue toujours à se refroidir. C'est l'histoire de l'univers en une minute et demie. Il arrive un moment où il est tellement froid, 6 000 degrés, que la lumière s'échappe. Je vous l'ai dit avec des mots, je vais vous montrer avec un dessin. C'est juste avant que la lumière s'échappe, c'est juste après. Les petits traits, c'est la lumière. Les petits points, c'est les électrons. Les gros points, c'est les noyaux atomiques. C'est un proton, électron et lumière. Quand les électrons sont libres, ils interagissent avec la lumière. La lumière se balade, elle ne demande rien, elle voit un électron, elle est diffusée, un peu comme dans un brouillard. Elle est déviée par le diffusion Thomson. Tout se passe bien, mais ça veut dire que c'est opaque. Vous ne pouvez pas voir dedans. C'est lumineux, mais opaque. Comme au centre du Soleil. Vous ne pouvez pas le voir. Vous voyez que ça surface, pour les mêmes raisons. Sous la surface, c'est un plasma chaud, donc électrisé, et donc la lumière est diffusée. Arrivée au moment où la température va sous les 3 000 degrés, c'est plus compliqué que ça, mais je vous la fais courte. Pourquoi les électrons et pas les protons ? La diffusion Thomson est proportionnelle à 1 sur la masse au carré de la particule. Pour ceux qui connaissent la physique, la masse de l'électron est à peu près 2 000 fois plus petite que le proton 1 sur m², ça explose, donc il y a juste les électrons qui jouent. On pose parfois la question. Les protons jouent, mais c'est négligeable. Il arrive un moment où les photons n'ont plus assez d'énergie, car l'Univers se refroidit, et il y a un milliard de fois plus de photons que d'électrons. Les électrons arrivent à se recoupler aux protons. Ils y arrivaient déjà ici, mais les photons les explosaient. Quand ils s'accouplent, ça forme un atome d'hydrogène, un proton plus électron, mais il n'y a plus d'électrons qui sont libres. La lumière se propage librement, enfin. Elle se propage en ligne droite, selon les géodésiques. C'est ça qu'on voit aujourd'hui. La lumière était créée au début de l'Univers, mais était piégée par la matière, donc la matière vibrait. À un moment, c'était suffisamment froid pour que les électrons ne disparaissent pas, mais sortent du circuit. Et pof, la lumière peut passer. Que pensez-vous qu'il arriva des vibrations ? Vous vous rappelez ? C'est gravité et pression de radiation des photons. Mais les photons sont enfin partis, car ils sont libres. Vous aviez des vibrations à gauche, et au moment de la recombinaison, et après, car c'est la recombinaison, vous n'avez plus de photons, donc vous n'avez plus cette force qui repousse. La gravité peut jouer son rôle et former les grandes structures. Les grandes structures, j'allais dire une bêtise, mais je vais la dire, commencent à se former à partir de ce moment-là, où elles ne sont plus gênées par les photons. C'est formidable. C'est ce qui se passe dans le fond cosmologique. On voit ces vibrations. On voit les dernières vibrations. Ce n'est pas la dernière station avant l'autoroute, mais les dernières vibrations avant la recombinaison. Votre univers vibre, et à un moment, la lumière s'échappe, et c'est ce que vous voyez à cet instant-là. C'est une photo ultra précise de l'univers 370 000 ans après le Big Bang qui vous montre toutes les vibrations à un instant T C'est comme si vous vous faites bouillir de l'eau sur votre casserole un moment, vous faites une photo où est le spectre de vibrations à la surface. Ça nous dépanne bien, ça nous permet de tout comprendre. Un peu comme le soleil, il vibre, mais on ne voit pas l'intérieur. C'est du plasma. La différence, c'est qu'on est à l'extérieur du soleil, et là, on est à l'intérieur de l'univers. Je vous laisse méditer ça pour vos longues soirées d'hiver. Comment on fait scientifiquement ? Il me reste une dizaine de minutes. On construit un satellite pendant 15 ans. On essaie de trouver 1 milliard d'euros. Le CNES et l'Agence spatiale européenne nous disent qu'on construit un satellite unique, et on met ça sur une Ariane 5, avec Arshel, dont je ne parlerai pas, même si j'ai beaucoup travaillé avec lui. Ce sont deux missions majeures de l'Agence spatiale européenne. Là, vous êtes très stressé, à ce moment-là. Mais maintenant, ça va. Là, c'est une simulation. Vous larguez les EAP, étage d'accélération à poudre. Vous sortez de l'atmosphère. Vous lâchez la coiffe. Là, il y a Arshel. C'est un super observatoire qui a fait plein de belles choses. Vous lâchez Arshel. Les gens sont contents, mais vous vous tirez la tête. Vous vous décalez. Vous éjectez le SILDA, système lancement double d'Ariane. Et Planck est là. Là, on a très, très peur. Ça se met en rotation. Et voilà, l'achat de Planck. Tout le monde était content. C'était 20 minutes après le lancement. Et tout ce petit monde, Planck, Arshel, va au point de la grange L2, du système Terre-Soleil, à 4 fois la distance Terre-Lune, pour avoir toujours la Lune, le Soleil et la Terre dans le dos. Il y a le petit panneau solaire. Et voilà comment Planck observe... Observez. Observez. Il faisait un tour par minute, à peu près, et il scannait le ciel. Chaque jour, il se déplaçait un petit peu. On ne fait pas des ronds dans l'eau, mais des ronds dans le ciel, avec Planck. Ronds dans le ciel. Et comme vous avez toujours le Soleil et la Lune dans le dos, vous ne les avez pas sur l'image, vous reconstruisez l'image après. Vous êtes dans l'image, mais ce n'est pas très pratique, donc on la déprojette. C'est les images que vous avez peut-être vues du satellite Planck, qui sont projections du ciel. Nous, on n'est pas dessus, on est derrière. Et on reconstruit avec le temps. Donc, Planck n'observe pas dans les ondes visibles, mais dans les ondes millimétriques, les ondes très froides, plus loin que l'infrarouge, parce que le fond cosmologique est plus brillant à ces longueurs. Vous voyez ici la Voie lactée, qui est très belle, très brillante, le plan galactique. Donc, notre Voie lactée. Des régions de gaz très brillantes. Vous avez ici le Grand nuage et le Petit nuage de Magellan. Vous avez... Je l'ai perdu. Andromède, je crois que c'est ce truc-là, mais je ne suis pas sûr. Galaxie d'Andromède. Centaurus A. Et Orion et le taureau, pour ceux qui connaissent. C'est par là. C'est une belle image, mais c'est compliqué. Nous, ce qu'on veut, c'est les petits points rouges et oranges. C'est ça, les fluctuations du fond cosmologique, et c'est ça qu'on cherche à avoir. Mais on est gêné par ça. Ça a demandé beaucoup de travail à mes collègues pour soustraire et extraire toute cette information. La clé de cette mission, c'est... J'aime bien cette image, on ne comprend rien, mais elle est belle. J'espère que vous partagez ce constat. Ça, c'est Planck. Il fait 4 m de haut, 3 m de large, une tonne. Je comprends un peu cette image. C'est la tranche du miroir primaire. On regarde par le haut. La tranche du miroir primaire, qui est ici, avec le plan focal et les instruments ultra-froids qu'on a fabriqués à Orsay, HFI, High Frequency Instrument, refroidis à la température record mondiale, jamais obtenue par ailleurs, de 0,1 Kelvin dans l'espace. Il n'y a que nous qui savons faire ça, les Français et les Européens. Les autres ne savent pas faire, ou ça n'a pas marché. Là, c'est le miroir secondaire, qui représente le plan focal, mais un peu distordu, on est sur le côté, donc on voit les cornets, puisque la lumière arrive dans les cornets, détectés par les fameux 52 bolomètres dont je voulais donner le titre. Planck observe à 9 fréquences, qui sont des fréquences non visibles à nos yeux. Les ondes radio, par l'instrument italien LFI, les trois fréquences, et les six fréquences hautes, par notre instrument HFI. Et après, pourquoi on a utilisé ces neuf couleurs ? La réponse est simple. Vous vous rappelez l'image où il y avait de la volacté partout, qui est très jolie, mais qui nous gêne. Vous voyez ce petit bidule rouge, ces petites fluctuations ? Comment vous savez si elles proviennent de la galaxie ou du fond cosmologique lui-même ? C'est pas écrit dessus. Je viens du fond cosmologique, je viens de la volacté. C'est pas ça, malheureusement. Donc, c'est à nous de nous débrouiller. En ayant plusieurs fréquences, on peut séparer les contributions de la volacté du fond cosmologique et plein d'autres choses, uniquement parce qu'ils n'ont pas le même spectre d'émissions. Sinon, on était morts. Mais le fond cosmologique est très froid, la volacté est un peu plus chaude, 17K, etc. Donc, ça nous permet de séparer. Mais pour séparer bien, il faut plein de longueurs d'onde pour bien découpler les deux. Je vous raconte ça parce que c'était la clé du travail. Donc, il a fallu des mois et des années pour soustraire tout ça. Si vous allez sur l'archive Planck, parce que toutes les données sont publiques, vous appelez Planck PLA, Planck Legacy Archive, vous n'aurez pas une seule image du fond cosmologique, vous en aurez deux ou trois. On n'a pas une seule méthode qui marche très bien. On en a deux ou trois. Chaque méthode a ses avantages et ses inconvénients. Selon ce que vous voulez étudier, vous utiliserez telle image ou telle autre. Mais on n'a pas une image toute faite qui fait tout. On n'y arrive pas, c'est très compliqué. C'est la séparation de composantes. Vous prenez neuf images, vous faites un énorme traitement et vous sortez vos petites fluctuations du fond cosmologique. On passe de l'image de Penzias et Wilson, il y a quelques années, à l'image de... Je ne l'ai pas montrée ici, de Coby en 1989 et de Dobaud du MAP dans les années 2000, à l'image de Planck qui montre ces petites fluctuations. On a fait un zoom de presque un million en intensité pour voir ces petites fluctuations. Ces petites fluctuations sont les prémices de ce qu'ils vont devenir des amas de galaxies et des galaxies et de ce que nous sommes. Planck a aussi permis d'obtenir la meilleure carte à cette échelle-là de la polarisation du fond cosmologique. Ça nous emmènerait pendant des heures, mais je vais vous la faire courte. La lumière est polarisée, soit vous le savez, soit vous l'admettez. Les directions de polarisation nous donnent une idée, non pas d'où sont les petites fluctuations, comme c'est le cas. Là, c'est dense, là, c'est surdense, là, c'est sous-dense. Je ne sais plus comment est le code couleur. Mais ça, ça nous dit à quelle vitesse ça se densifie ou à quelle vitesse ça se vide. Donc, on a la dynamique des fluctuations. Tout à l'heure, je vous disais qu'on faisait une photo de l'Univers juste à la recombinaison. C'est vrai pour l'intensité, mais c'est faux pour la polarisation. Avec la polarisation, c'est comme si on faisait un petit film. On n'a pas de film, mais la polarisation nous indique comment la matière vibre, à quelle vitesse. C'est extraordinaire, on peut tout avoir avec ça. On peut avoir plein d'informations sur ce qui se passe juste au moment de cette recombinaison et comment ces fluctuations évoluent. Je vous l'avais fait courte. Tous ces résultats, il y a quelques années, ont eu un certain écho dans la presse. On était contents, même si on ne fait pas ça pour ça. Notamment dans la presse anglo-saxonne, ce qui n'était jamais arrivé. Le Monde, je suis abonné, s'était un peu planté d'images sur leur couverture. Ils avaient mis l'image avant le traitement. C'est un peu dommage. Elle est belle, mais c'était un peu trompé. Ils avaient mis la bonne image après dans l'article. Alors, Planck, finalement, est la troisième génération. C'est une sorte de clone. Je détourne les titres, sinon je n'y arriverai pas. Planck est le clone, la troisième génération des missions précédentes. COBI, WMAP et Planck. Il y a des dizaines d'années entre ça. Pour la petite histoire, WMAP et Planck ont été décidés la même année, en 1996. J'étais en DEA à l'époque. Je me souviens, j'avais assisté aux présentations. Pourquoi les Européens ont mis dix ans plus que les Américains alors que les manips ont été acceptés la même année ? Est-ce parce qu'on est mauvais, plus lent, parce qu'on se débrouille mal ? La réponse, c'est non. On est beaucoup plus ambitieux. Ce qu'ont fait les Américains, c'est très bien. Ils avaient un budget plus petit. Ils ont pris les technos qui existent, on les a envoyées, et on a des super résultats. Ça a très bien marché. Ils ont obtenu les premiers paramètres cosmologiques. Ça a vraiment changé le paysage cosmologique. Mais nous, on s'est dit qu'on allait faire la manip définitive. On allait arrêter le jeu après. Après cette image, on n'aura plus la peine d'observer le fond cosmologique. On a développé une nouvelle technologie, les bolomètres refroidis, cryogéniques à 0,1 Kelvin, qui n'avaient jamais volé. Ça nous a mis dix ans. Pour vous donner une idée du gain, une année d'observation de Planck, plus vous observez longtemps, plus vous intégrez, moins vous avez de bruit. Une année d'observation de Planck correspond à plusieurs années d'intégration de WMAP. Ça ne correspond pas à dix ans d'intégration de WMAP, pas à cent ans, mais à l'équivalent de mille ans d'observation de WMAP. Vous voyez le saut technologique majeur. On appelle ça un saut technologique. C'est nous qui l'avons fait. Ça prend un peu de temps, parce que c'est des technos compliqués. Je vais répondre à cette question dans les quatre minutes qui me restent. Comment on obtient ces fameux paramètres cosmologiques ? À partir de cette image de vibration. On vous donne l'âge, la composition, d'où ça sort. C'est très simple. Si vous vous rappelez quand vous avez été au lycée ou à l'université, quand vous faites des TP, vous avez des données. On essaie de vous faire passer une droite ou une courbe dedans. C'est pareil. Un peu plus compliqué, mais c'est pareil. On prend les données du fonds cosmologique et on la confronte aux modèles. Ça, c'est les modèles. On en fait tourner des millions de modèles de l'univers et on prend les meilleures données qui passent dedans. Il y a un petit souci. La théorie ne prédit pas qu'à cet endroit, il y aura un point bleu et qu'à cet endroit, il y aura un point rouge. C'est comme si vous faites un modèle de circulation automobile sur le périphérique. À 6 h ou à 8 h, vous donnez un nombre de voitures par minute, mais votre modèle ne vous dira pas qu'il y a une voiture bleue avec un conducteur et une voiture rouge avec une conductrice. Votre modèle ne prédit pas ça. Il vous prédit statistiquement le flot de voitures. Nous, c'est pareil. Ça ne nous prédit pas l'endroit d'où seront les petites fluctuations, mais ça nous prédit statistiquement qu'il y en a tant sur tout le ciel de telle échelle et tant sur tout le ciel de telle échelle. Donc, ertir cette image en spectre de puissance. On décompose par échelle et on fait une sorte de moyenne. Pour ceux qui connaissent, on fait une décomposition en harmonique sphérique, un peu comme une transformée de Fourier sur la sphère. On fait des corrélations, ça revient à mètre au carré. Et on met nos données là-dedans, qui ne sont pas représentées ici. Les modèles sont très sensibles aux paramètres cosmologiques. Vous mettez toutes vos données et vous obtenez... Vous faites un ajustement, un fit, et vous obtenez vos paramètres cosmologiques. Mais vous n'avez pas qu'une seule valeur. Ce n'est pas comme en TP où on obtient 10, plus ou moins 2. Là, vous avez plein de valeurs. Vous avez tous les modèles. On a représenté trois paramètres. La densité de matière, la constante double et le spectre de fluctuation initiale. Si on prend les deux petits modèles en bas à droite, ils sont un peu en dehors de l'ellipse. Ces deux modèles ajustent les données. Il n'y en a que deux, alors qu'ici, il y en a des centaines. Ça ne veut pas dire que vous n'avez pas le droit de prendre ces valeurs. Ça veut juste dire que, statistiquement, dans notre description, elles sont très peu probables. Les valeurs qu'on va donner, ce seront les valeurs centrales, avec une barre d'erreur qui correspond à la densité de points. Mais ça ne veut pas dire que... Un jour, d'autres expériences nous diront que c'est ces valeurs. Tant mieux, tant pis, ce n'est pas grave. Elles ne sont pas interdites par Planck. Mais il y a des valeurs très favorisées. C'est comme ça que se fait la science. Il y a plusieurs valeurs. Selon comment vous vous marginalisez, selon les paramètres, vous obtenez des valeurs différentes. Dans les articles de Planck, plusieurs valeurs sont données selon la technique de mesure, pour faire simple. En fonction de ces valeurs, vous obtenez le fameux camembert cosmique, qui vous donne la composition, l'âge, tout. C'est comme ça que ça marche. Comment on a fait cette décomposition ? Voici le multipôle. C'est l'angle sur le ciel. Je ne vais pas être très long, c'est la fin. C'est l'angle sur le ciel, c'est l'intensité. Voilà les points Planck. Ce sont ceux de 2013, mais ceux de 2018 sont encore meilleurs. Voilà le meilleur modèle. Mais ça ne veut pas dire qu'il fitte parfaitement. Et voilà l'accord entre les deux. Ça ajuste parfaitement. Ce modèle a six paramètres. Il contient de la matière noire, de l'énergie sombre, c'est l'expansion accélérée, de la matière traditionnelle et un âge. Voilà comment on obtient la quart d'identité de l'univers, en faisant un ajustement avec des modèles sur les données. Les données sont très compliquées. La revanche des six paramètres... J'ai rajouté un X de manière éhontée. Désolé. La revanche des six paramètres cosmologiques qui sont ici. Je ne vais pas tous les décrire, mais il y a la matière noire. La chose sur laquelle je vais insister, c'est ces deux boîtes. Ici, c'est la constante de Hubble. C'est pareil, j'ai des nouveaux paramètres, mais la table est plus compliquée. La constante de Hubble, qui est en km par seconde par Mpc. Quand j'étais étudiant en DEA, en Master 2, l'équivalent d'aujourd'hui, on ne connaissait pas cette valeur à mieux qu'un facteur 2 près. Mes enseignants me disaient que la constante de Hubble était entre 50 et 100 km par seconde par Mpc. J'ai eu la chance de participer à une aventure qui, en quelques décennies, ou une grosse décennie, a permis de passer d'un facteur 2, on n'est pas les seuls, mais c'est l'aboutissement, à une fraction de pourcent d'incertitude. Au cours d'une carrière, c'est assez agréable de dire que j'ai participé à une caractérisation de la carte d'identité de l'Univers à une fraction de pourcent, alors qu'on ne connaissait pas trop. C'est pas mal. En tout cas, je suis content. Conséquemment, parce que les deux sont liés, on a un âge de l'Univers à 0,3 % d'incertitude. Jamais dans l'histoire de l'humanité, on n'est arrivé à une telle précision. Les gens me disent parfois que ma théorie n'est pas sûre. Pas de problème, on change la théorie. Si vous avez une nouvelle théorie, je reviens en arrière, mettez vos paramètres à vous, faites l'ajustement et trouvez votre âge. Pas de problème. Les données sont là pour, j'ose pas dire l'éternité, mais pour un certain temps. Toutes les nouvelles théories devront ajuster ces données, les relevés de galaxies, l'âge des étoiles, etc. J'incitais sur le fond cosmologique. Alors, l'Empire contre-attaque, parce que le côté obscur de l'Univers est là, le camembert cosmique. Aujourd'hui, en densité d'énergie, moins de 5 % de matière ordinaire, donc des baryons, un gros quart de matière noire, et à peu près 70 % d'énergie sombre. Vous me donnez trois minutes, je vais essayer d'aller jusqu'à 20, je suis sur le point de finir, mais je dirais un truc important. Qu'en sait-on de ces trucs-là ? Matière noire et énergie sombre, on ne sait pas ce que c'est. Mais on peut modéliser l'inconnu. Je vais vous donner un exemple. L'air dans cette pièce, on sait qu'il y a de l'air. Vous avez jamais vu une molécule d'air, d'oxygène ou d'azote ? Personne dans cette salle n'a jamais vu de ses yeux une molécule d'air. Or, on sait que c'est là. On peut même mesurer cette pièce à une température, une pression. On peut mesurer l'atmosphère qui est présente dans cette pièce par des paramètres macroscopiques. Désolé si je jargone. Vous pouvez trouver une température et une pression à cette atmosphère que l'on ne voit pas. En physique, on appelle ça une équation d'état. Avec la matière noire et l'énergie sombre, on a une équation d'état. On ne sait pas ce que c'est que la matière noire, mais cette équation peut être modélisée et on peut obtenir des paramètres précis. C'est différent. Ça se comporte comme une matière froide non relativiste. Ça se mesure comme un fluide répulsif. Tout est capturé et mis dans l'équation d'état. Ça peut paraître bizarre ou un peu flou, mais ce n'est pas du pipeau. C'était le message que je voulais vous faire passer. C'est peut-être du pipeau, mais on s'y prend pour que ce ne soit pas du pipeau. L'énergie sombre est un peu problématique. Je termine avec quelques images. Une dernière image, c'est la matière noire. On ne voit pas la matière noire, mais on peut trahir sa présence par effet de l'antillage gravitationnel. C'est ce qu'on a fait sur tout le ciel. La première image de la matière noire sur tout le ciel a été obtenue par Planck. Quand on ne sait pas, on ne met pas. Voilà la présence de matière noire. Et les trois images de Planck qui nous ont permis d'obtenir ces résultats, la température, la polarisation et la matière noire, avec plein de belles choses. Je vais conclure en disant qu'il y a plein de belles choses à faire. D'abord, les ondes gravitationnelles, qui ouvrent une nouvelle fenêtre sur l'univers, pas encore cosmologique, mais qui permettent de bien comprendre les objets compacts dans l'univers. Je ne vais pas en parler, ce n'est pas ma spécialité, mais c'est important. La très belle physique et la très belle métrologie. Et un peu d'astrophysique, car les barres d'erreur des zones sur le ciel des sources gravitationnelles ont été réduites grâce aux compléments des observations astronomiques. Il y a eu un prix Nobel en 2017 qui était bien mérité. Les Français sont très en pointe là-dessus. Et il y a surtout le satellite Euclide. Le satellite Euclide, que nous allons lancer en 2022, l'Agence spatiale européenne, avec une très grosse contribution française, va notamment envoyer la plus grosse caméra jamais envoyée dans l'espace 600 millions de pixels. Il va obtenir des images extraordinaires de tout le ciel, des milliards de galaxies, sur lesquelles on va mesurer les effets de ces éléments gravitationnels pour obtenir la matière noire. Et on va faire des fonctions de corrélation pour mieux comprendre l'évolution de l'énergie sombre. Je termine avec quelques images, en évoquant le fait que nos travaux scientifiques produisent des images, tant mieux, qui sont belles, et que le public s'approprie. C'est le Hubble Deep Field, le champ profond Hubble. On est ravi de voir que ces images permettent aux humains, aux hommes et aux femmes, d'obtenir une vision du monde, une représentation du monde à laquelle nous contribuons, même si ces images nous échappent. Ce n'est pas mon coucher de soleil en vacances, c'est pris de la planète Mars, par Spirit. Vous voyez que les images scientifiques, quand elles sont prises dans un contexte autre que scientifique, peuvent apporter beaucoup. Votre regard a changé depuis que je vous ai dit que cette image a été prise sur Mars, même si elle est publique. Il y a aussi une image qui montre qu'on est tout petit. Voilà la Terre vue de Mars, cette image que vous connaissez peut-être. La science sert à faire progresser les connaissances, mais elle sert aussi à tout un chacun, j'espère que vous en faites partie, à avoir une vision du monde et une représentation. L'imagerie scientifique et les résultats scientifiques aident à se représenter le monde, comme cette image qui a eu un grand impact il y a 50 ans sur la petitesse et la beauté de la Terre. Le Fonds cosmologique, j'espère, participe de cette vision du monde et que les humains, les artistes aussi se sont emparés de cette image. Mais plus globalement, nous espérons tous apporter une vision du monde. Et dernier point, et c'est ma dernière slide, c'est promis. Les scientifiques ne sont pas hors de la société l'opportunité de travailler avec des réfugiés dans mon université. Si on m'avait dit il y a quelques années que je parlerais du fonds cosmologique à des réfugiés en situation compliquée, lors d'une soirée astronomique à Orsay, je n'aurais pas cru. Mais c'est arrivé. C'est de grandes expériences. La science n'est pas décloisonnée de la société. Elle participe de la culture et de la vision du monde. On essaie d'y prendre part. Merci de votre attention. Désolé du temps passé."
}