{
    "original_file_name": "cosmologie.mp4",
    "language": "fr",
    "sentences": [
        {
            "start": 0,
            "end": 4,
            "text": "2, 1, 0, et lift off !"
        },
        {
            "start": 4,
            "end": 6,
            "text": "Le dernier lift off de l'Atlantique !"
        },
        {
            "start": 6,
            "end": 30,
            "text": "Showmaster de Space Shuttle !"
        },
        {
            "start": 30,
            "end": 60,
            "text": "Le dernier lift off de l'Atlantique !"
        },
        {
            "start": 60,
            "end": 62,
            "text": "Le dernier lift off de l'Atlantique !"
        },
        {
            "start": 62,
            "end": 90,
            "text": "Showmaster de Space Shuttle !"
        },
        {
            "start": 90,
            "end": 117,
            "text": "Conférence confinée ASTRO Bonjour, bienvenue à cette conférence confinée numéro 11 du 2 décembre 2020."
        },
        {
            "start": 117,
            "end": 120,
            "text": "Le confinement semble toucher à sa fin."
        },
        {
            "start": 120,
            "end": 131,
            "text": "Néanmoins, les conférences confinées continuent, parce que d'abord ça m'amuse, et puis j'ai l'impression que ça amuse certains d'entre vous, en tout cas ça intéresse certains d'entre vous, et certaines, donc nous allons continuer."
        },
        {
            "start": 131,
            "end": 173,
            "text": "Alors aujourd'hui, au programme, parce que la semaine dernière il n'y a pas eu de conférence confinée, et je m'en excuse parce qu'on y reviendra peut-être la semaine prochaine finalement, j'étais très impliqué dans la partie scientifique du nouveau satellite observatoire JWST, de la NASA, de l'ESA et de la CSA, donc américain pour faire simple, européen et canadien, c'est un grand télescope qui sera lancé dans à peu près un an par une fusée Ariane 5, et donc les programmes scientifiques étaient dus mercredi matin dernier, donc c'est pour ça que je n'ai pas pu avoir une semaine de conférences confinées astro avec vous la semaine dernière."
        },
        {
            "start": 173,
            "end": 206,
            "text": "Alors aujourd'hui un programme intéressant, voilà, je reprends ma petite feuille, parce que finalement c'est ce qu'il y a de plus pratique, nous allons parler de quatre choses aujourd'hui, tout d'abord des conseils pour peut-être les étudiants et les lycéens qui nous écoutent, et qui sont pour certains en confinement, en tout cas s'agissant de l'université malheureusement, même si on déploie tous les efforts à tous les niveaux pour que les universités ouvrent de nouveau, beaucoup plus tôt que ce qui est annoncé, donc si possible en janvier, mais voilà c'est en cours."
        },
        {
            "start": 206,
            "end": 220,
            "text": "Mais en attendant, certains d'entre vous sont en distanciel, peut-être aussi pour les lycées en partie, donc voilà quelques conseils d'un prof d'université qui a affaire à quelques étudiants, donc ce sera relativement court."
        },
        {
            "start": 220,
            "end": 234,
            "text": "Deuxièmement, on va parler un tout petit peu de la Station Spatiale Internationale, parce qu'on la voit très très bien en ce moment le soir depuis la France métropolitaine, donc c'est vraiment le moment pour la voir, surtout qu'en général il fait à peu près beau, enfin ça dépend de votre région, mais là ça sera court."
        },
        {
            "start": 234,
            "end": 250,
            "text": "On parlera un petit peu d'art dans ce monde de brut, parce que l'art et la culture ça nous nourrit, tout comme la science, donc on parlera un peu d'art, et puis on passera au plein de résistance, qui est la cosmologie, l'expansion de l'univers."
        },
        {
            "start": 250,
            "end": 291,
            "text": "Donc là c'est tiré d'un cours que je donnais en première année d'université à Mélun, alors que je ne donne plus parce que j'avais, bref, j'avais plus assez de séances, mais le niveau est à peu près du, disons, terminale, première année d'université, donc ça sera un petit peu technique, c'est pour ça qu'il y aura des équations, c'est pour ça que j'ai pris le papier, c'est pas hyper compliqué, s'il y a des petits aspects que vous ne comprenez pas, c'est pas très gênant, d'abord vous pouvez me poser des questions en chat, et puis ce qui compte c'est vraiment le raisonnement général, après les détails techniques, les calculs, ça c'est pas gênant, ça vous trouverez le moment pour les comprendre, ou l'année d'après, ça c'est pas gênant, mais la logique globale, vous verrez, elle est relativement simple."
        },
        {
            "start": 291,
            "end": 311,
            "text": "Donc, on y va, on commence par les conseils pour les, disons, terminale, première année, deuxième année d'université, pour passer cette période où il y a du cours en distanciel et comment essayer de préparer la suite de l'année universitaire pour être d'attaque."
        },
        {
            "start": 311,
            "end": 326,
            "text": "Et bien c'est parti !"
        },
        {
            "start": 326,
            "end": 332,
            "text": "Alors mes conseils sont les suivants, basés sur un petit peu d'expérience."
        },
        {
            "start": 332,
            "end": 351,
            "text": "Le premier conseil que je pourrais donner aux étudiants, c'est de travailler en groupe, ça c'est très important, pour réviser, pour se questionner mutuellement, pour répondre, parce que tout seul c'est difficile, alors même si vous êtes à distance, vous pouvez communiquer, il y a plein d'outils qui existent, ça va de WhatsApp, etc."
        },
        {
            "start": 351,
            "end": 358,
            "text": "Mais bon, quand même avoir du temps de parole, plus que juste du texte, c'est important."
        },
        {
            "start": 358,
            "end": 360,
            "text": "Alors pourquoi c'est important ?"
        },
        {
            "start": 360,
            "end": 373,
            "text": "Parce qu'en général, on n'a pas tout compris d'un cours ou d'un concept, et le travail tout seul, ça peut être difficile, surtout si on est à distance, qu'on est seul, et que la motivation est difficile."
        },
        {
            "start": 373,
            "end": 386,
            "text": "Le fait d'être en groupe vous permet de poser des questions aux autres, les autres ont en général la réponse, la réciproque étant vraie, c'est-à-dire que vous pourrez certainement avoir des réponses aux questions que se posent vos copains."
        },
        {
            "start": 386,
            "end": 398,
            "text": "Et mine de rien, penser à des questions et penser à des réponses, ça permet de faire travailler la réflexion, et ça permet de mieux structurer son savoir et ses compétences."
        },
        {
            "start": 398,
            "end": 410,
            "text": "Et donc ça va au-delà juste de l'aide ponctuelle, qui est déjà très bienvenue, et très utile, et très sympathique, et très agréable, ça permet en plus de vraiment bien intégrer, de se faire une réflexion vraiment personnelle sur un sujet ou un concept."
        },
        {
            "start": 410,
            "end": 412,
            "text": "Donc vous verrez, ça marche très très bien."
        },
        {
            "start": 412,
            "end": 414,
            "text": "Donc ça c'est le conseil que je donne."
        },
        {
            "start": 414,
            "end": 417,
            "text": "Certains étudiants restent toujours un petit peu seuls, etc."
        },
        {
            "start": 417,
            "end": 421,
            "text": "C'est peut-être un choix, mais à mon avis ce n'est pas un choix idéal."
        },
        {
            "start": 421,
            "end": 425,
            "text": "Donc travaillez en groupe quand vous pouvez, les outils existent."
        },
        {
            "start": 425,
            "end": 431,
            "text": "Le deuxième conseil, c'est poser des questions à votre enseignant."
        },
        {
            "start": 431,
            "end": 433,
            "text": "Pour cela je propose plusieurs choses."
        },
        {
            "start": 433,
            "end": 442,
            "text": "D'abord c'est bien formuler vos questions, surtout si vous êtes à distance avec une interface genre Zoom, Collaborate, etc."
        },
        {
            "start": 442,
            "end": 450,
            "text": "Ou parfois le son passe mal, si vous dites « Monsieur, j'ai pas compris l'équation 4 » ou « Madame, j'ai pas compris l'équation 4 » Déjà le temps que votre micro se réveille, on n'entend rien."
        },
        {
            "start": 450,
            "end": 479,
            "text": "Donc plutôt que de faire une question vraiment en mode onomatopée, je suggère de dire, voilà, de lever la main selon l'outil, dire « Monsieur, Madame, l'équation 4, il y a des choses que je ne comprends pas, notamment le terme bidule ou le terme machin, vous pouvez réexpliquer pourquoi ce terme, qu'est-ce qu'il fait, etc » Donc, poser des questions, bien formuler vos questions, même si évidemment vous ne comprenez pas parce que vous posez une question."
        },
        {
            "start": 479,
            "end": 481,
            "text": "Et c'est normal, il faut poser des questions."
        },
        {
            "start": 481,
            "end": 486,
            "text": "Si vous êtes en cours, c'est qu'a priori, il y a des choses que vous ne connaissez pas."
        },
        {
            "start": 486,
            "end": 489,
            "text": "Et c'est absolument pas honteux de poser des questions, au contraire."
        },
        {
            "start": 489,
            "end": 494,
            "text": "Et l'enseignant se trouvera conforté dans son cours si vous posez des questions."
        },
        {
            "start": 494,
            "end": 497,
            "text": "Et puis il parle dans le vide, et puis en général le niveau part un petit peu en live."
        },
        {
            "start": 497,
            "end": 499,
            "text": "Enfin, ça dépend des profs, bien sûr."
        },
        {
            "start": 499,
            "end": 501,
            "text": "Et donc, c'est un peu difficile."
        },
        {
            "start": 501,
            "end": 506,
            "text": "Donc, poser des questions, formuler les bien, et puis parler distinctement."
        },
        {
            "start": 506,
            "end": 509,
            "text": "Peut-être que je peux passer à mon conseil numéro 4."
        },
        {
            "start": 509,
            "end": 516,
            "text": "Tester votre micro, parce que vous avez peut-être un ordinateur qui n'est peut-être pas de dernière génération, et donc peut-être que le micro ne marche pas très bien."
        },
        {
            "start": 516,
            "end": 522,
            "text": "Et donc si en plus, vous posez une question très très courte, le temps que le micro s'active, nous derrière, on n'entend rien."
        },
        {
            "start": 522,
            "end": 524,
            "text": "Donc, tester votre micro avant."
        },
        {
            "start": 524,
            "end": 529,
            "text": "Éventuellement, prenez un téléphone si vous avez un aboiement avec appel illimité."
        },
        {
            "start": 529,
            "end": 530,
            "text": "En général, c'est le cas."
        },
        {
            "start": 530,
            "end": 536,
            "text": "Vous pouvez accéder normalement aux cours, aux téléconférences, en voix, avec un numéro de téléphone."
        },
        {
            "start": 536,
            "end": 539,
            "text": "Et vous pouvez avoir la partie visio à côté."
        },
        {
            "start": 539,
            "end": 546,
            "text": "Surtout si vous avez une connexion Internet qui n'est pas extraordinaire, vous pouvez passer pour la voix par la partie téléphone."
        },
        {
            "start": 546,
            "end": 547,
            "text": "Et ça marche très très bien."
        },
        {
            "start": 547,
            "end": 554,
            "text": "Moi, j'ai des collègues qui font ça, qui mettent leur téléphone pour juste écouter et parler, et puis ils mettent sur leur écran juste la partie vidéo."
        },
        {
            "start": 554,
            "end": 557,
            "text": "Et comme ça, il n'y a pas de souci de micro."
        },
        {
            "start": 557,
            "end": 562,
            "text": "Donc, posez des questions, formulez bien vos questions si vous pouvez, donc plus que 5 secondes, c'est mon conseil."
        },
        {
            "start": 562,
            "end": 566,
            "text": "Faites une phrase un petit peu... ou quelques phrases un peu longues."
        },
        {
            "start": 566,
            "end": 580,
            "text": "Et puis si jamais il y a un ou des profs qui vous disent que votre question est idiote, etc., passez à votre chemin, parce que les mauvais profs, il y en a heureusement très peu, effectivement, tensent éventuellement les élèves ou les étudiants à cause de mauvaises questions."
        },
        {
            "start": 580,
            "end": 582,
            "text": "Mais ça, heureusement, c'est très rare."
        },
        {
            "start": 582,
            "end": 592,
            "text": "Donc en fait, toutes les questions sont bonnes, et ça permet un dialogue, et ça permet d'illustrer des concepts."
        },
        {
            "start": 592,
            "end": 599,
            "text": "Et puis figurez-vous que si vous avez une question, à 95% de chance, il y en a d'autres qui se posent la même question."
        },
        {
            "start": 599,
            "end": 602,
            "text": "Donc ne serait-ce que pour ça, n'hésitez pas."
        },
        {
            "start": 602,
            "end": 614,
            "text": "Et puis pour les profs, c'est beaucoup plus agréable, je peux vous le dire en tant qu'ensignant-chercheur, avoir des étudiants qui interagissent avec nous via l'écran, parce qu'évidemment, quand on est en classe, c'est beaucoup plus facile, c'est beaucoup plus agréable et beaucoup plus dynamique."
        },
        {
            "start": 614,
            "end": 618,
            "text": "Et puis troisièmement, être à l'aise avec les outils numériques."
        },
        {
            "start": 618,
            "end": 620,
            "text": "Ça, vous pouvez le tester sans être en cours."
        },
        {
            "start": 620,
            "end": 632,
            "text": "Je pense aux interfaces de visioconférence, aux messageries instantanées de type Slack, aux documents en ligne de type Framapad, évidemment, il y a Google, Legafa, mais enfin, si on peut éviter, ce n'est pas plus mal."
        },
        {
            "start": 632,
            "end": 636,
            "text": "Enfin, Slack, ça fait aussi partie de Google, mais enfin, il y a d'autres outils qui existent."
        },
        {
            "start": 636,
            "end": 661,
            "text": "Parce que pendant ce temps un peu, soit de confinement, soit de post-confinement, c'est une occasion unique, un peu imposée, mais de devenir très à l'aise avec ces outils, parce qu'après, quand on reviendra au présentiel, et puis qu'il y aura, je ne sais pas, des téléconférences ou des interactions à avoir de manière numérique, si en plus ces outils vous sont un peu étrangers, là, c'est un peu la double peine et c'est dommage."
        },
        {
            "start": 661,
            "end": 671,
            "text": "Donc, formez-vous à tous ces outils de partage de documents, de messagerie instantanée mais structurée, comme Slack ou les parties open source qui existent."
        },
        {
            "start": 671,
            "end": 686,
            "text": "Pareil, sur les plateformes de visioconférence que vous utilisez, il y a des outils intégrés, que ce soit pour poser des questions en chat, pour prendre la parole ou pour mettre des émotions, des questionnements, des bravos, etc."
        },
        {
            "start": 686,
            "end": 691,
            "text": "Et plus vous serez à l'aise là-dedans, plus ça sera simple ensuite de passer sur le fond."
        },
        {
            "start": 691,
            "end": 706,
            "text": "Voilà, donc mes trois conseils, un peu, si vous êtes à l'université ou en distanciel, pour des cours, alors la période n'est pas facile, heureusement je crois que c'est en voie de se terminer pour cette phase-là, en tout cas."
        },
        {
            "start": 706,
            "end": 717,
            "text": "Travaillez en groupe, posez des questions, et puis bien les formuler, mais même si ce n'est pas clair dans votre tête, ce qui est normal, au moins prenez le temps de dire ce que vous ne comprenez pas et de l'objet de votre question."
        },
        {
            "start": 717,
            "end": 724,
            "text": "Parce que si la question est trop courte, déjà le micro, ça ne passe pas, et en plus, nous derrière, on se demande, mais c'est quoi la question ?"
        },
        {
            "start": 724,
            "end": 729,
            "text": "Donc précisez, et ça évite des « mais alors, c'est quoi que tu n'as pas compris ?"
        },
        {
            "start": 729,
            "end": 733,
            "text": "» et puis de parler au même moment, etc."
        },
        {
            "start": 733,
            "end": 737,
            "text": "Donc ça évite de faire perdre cinq minutes à tout le monde, et puis c'est beaucoup plus agréable."
        },
        {
            "start": 737,
            "end": 746,
            "text": "Être à l'aise avec les outils, et puis tester votre système pour être vraiment bien entendu, ce qui est quand même plus agréable pour tout le monde, si c'est possible."
        },
        {
            "start": 746,
            "end": 768,
            "text": "Et bien voilà, on passe à la deuxième partie ... Nous allons passer à la deuxième partie, qui concerne la Station Spatiale Internationale."
        },
        {
            "start": 768,
            "end": 773,
            "text": "Et là, je vais vous mettre le site web que je préfère, qui s'appelle HeavensAbove."
        },
        {
            "start": 773,
            "end": 779,
            "text": "Vous avez l'adresse, je ne sais pas si on voit la souris, je ne crois pas trop, bon bref."
        },
        {
            "start": 779,
            "end": 804,
            "text": "Heavens-above.com, vous mettez votre ville, votre endroit géographique, il y a une petite carte si vous voulez, et puis vous cliquez sur ISS, il y a un menu, et là vous avez les prochains passages pour Paris, mais en France, vous mettez votre ville, et vous avez la date des passages, et vous voyez que tous les soirs, en ce moment, il y a des passages."
        },
        {
            "start": 804,
            "end": 807,
            "text": "Alors on peut aller au-delà du 8 décembre."
        },
        {
            "start": 807,
            "end": 824,
            "text": "Donc le 2 décembre, par exemple, le jour de notre conférence confinée, à 18h15, début d'un passage, maximum à 18h18, c'est-à-dire là où l'ISS sera le plus haut dans le ciel, et puis fin à 18h20."
        },
        {
            "start": 824,
            "end": 830,
            "text": "Je vous en ai parlé il y a une ou deux séances de ce site, mais là, ça vaut vraiment le coup, parce que tous les soirs, il se passe quelque chose."
        },
        {
            "start": 830,
            "end": 845,
            "text": "Et puis je vous conseille, si vous avez le choix, de regarder les passages dont la magnitude est la plus brillante, c'est-à-dire le chiffre le plus négatif, le plus petit, parce que la magnitude, c'est une échelle log inverse, enfin, moins log, donc plus c'est négatif, mieux c'est."
        },
        {
            "start": 845,
            "end": 855,
            "text": "Et donc on voit qu'une magnitude de moins 3,5, donc mercredi soir, je clique, et puis pour Paris, c'est relativement simple."
        },
        {
            "start": 855,
            "end": 885,
            "text": "Vous avez une carte du ciel, à droite, c'est l'Ouest, alors normalement, il y a Jupiter et Saturne qui se rapprochent, d'ailleurs, qui sont très très beaux à voir durant tous, au moins, donc je vous conseille, si vous avez des jumelles ou un télescope, elles sont très très basses sur l'horizon, mais vous regardez plein Ouest, et puis vous verrez un point qui avance, comme ça, vous voyez, vous avez les minutes, et puis qui passe rapproche du pôle Nord, céleste, avec la petite ours, et puis qui s'éteindra juste après d'en percer, et ça met plusieurs minutes, et c'est très très sympa à voir."
        },
        {
            "start": 885,
            "end": 894,
            "text": "Donc c'est la bonne saison, s'il fait beau chez vous, profitez-en pour regarder la Station Spatiale Internationale."
        },
        {
            "start": 894,
            "end": 906,
            "text": "C'est le moment, depuis sa fenêtre, il n'y a aucun souci, et puis il suffit que vous ayez le côté Ouest ou le côté Est, selon quel côté vous regarderez, pour pouvoir la visualiser."
        },
        {
            "start": 906,
            "end": 918,
            "text": "Voilà, et bien, bonnes observations !"
        },
        {
            "start": 918,
            "end": 924,
            "text": "On va passer à un peu d'art."
        },
        {
            "start": 924,
            "end": 928,
            "text": "Voilà, un peu d'art pour dans ce monde de brut."
        },
        {
            "start": 928,
            "end": 951,
            "text": "Alors je vais remettre cette fenêtre, que j'ai préparée, et donc je vais vous montrer un, deux, trois, quatre, cinq, six, six œuvres qui m'ont inspiré, voilà, c'est complètement subjectif, donc voilà, c'est le choix du chef, des œuvres emblématiques, certaines ont à peu près mille ans, et puis je vais aller vers des périodes croissantes, de plus en plus proches de nous."
        },
        {
            "start": 951,
            "end": 1010,
            "text": "Alors ici je prends mes antisèches, même si je connais, mais c'est pour ne pas vous dire trop de bêtises, c'est la tapisserie de Bayeux, qui se trouve à Bayeux, qui était cousue, qui repose sur une table, qui était cousue, qui représente sur des dizaines de mètres, toute une histoire, donc, onzième siècle, vers à peu près 1080, et puis vous voyez en haut, tout en haut, au milieu, au-dessus de la tour, une sorte d'étoile avec une traînée, c'est une comète, la comète de Halley, qui a été observée à cette époque-là, et qui annonçait un destin funeste, les comètes étaient annonciateurs de nouvelles terrifiantes, en tout cas c'était la croyance de l'époque, et donc effectivement, le roi en question avait du souci à se faire, et je crois qu'il a eu des soucis ensuite."
        },
        {
            "start": 1010,
            "end": 1031,
            "text": "C'est pour ça que la comète a été signifiée, et cousue, et notifiée, dans cette tapisserie absolument extraordinaire, qui est un témoignage de ce qui se passait, il y a presque 1000 ans, dans un état de conservation épatant, et donc, c'est de l'histoire, mais c'est de l'art aussi, et puis c'est un petit peu d'astronomie."
        },
        {
            "start": 1031,
            "end": 1041,
            "text": "Donc voilà, aussi longtemps que l'humain existe, il a probablement levé les yeux au ciel."
        },
        {
            "start": 1041,
            "end": 1051,
            "text": "Donc c'était un petit incis de la tapisserie de Bayeux, qui est toujours agréable à voir, et qu'on peut voir en France."
        },
        {
            "start": 1051,
            "end": 1094,
            "text": "Cette mosaïque est extraordinaire, celle-ci est du 16e siècle, à peu près 1508, donc il y a à peu près 512 ans, quelque chose comme ça, et c'est le peintre Raphaël, enfin l'artiste Raphaël, parce que là il n'y a pas que de la peinture, c'est au Vatican, où il représente Uranie, donc l'une des muses du quadrivium, et qui représente l'univers tel qu'il est conçu à l'époque, avec la Terre au centre, et puis la sphère des fixes, avec les étoiles, toutes dorées, toutes brillantes."
        },
        {
            "start": 1094,
            "end": 1112,
            "text": "Donc voilà comment la conception de l'univers, et l'astronomie, inspire l'un des artistes les plus renommés de son époque, dans un endroit de pouvoir important, qui était le Vatican au 16e siècle."
        },
        {
            "start": 1112,
            "end": 1125,
            "text": "Alors évidemment, Raphaël, on pourrait y passer des heures, regarder la finesse, les couleurs, surtout quand on pense à l'époque lointaine à laquelle ça a été conçu."
        },
        {
            "start": 1125,
            "end": 1137,
            "text": "On passe à une autre œuvre, j'espère que tout ça vous plaît, les traits régisseurs du Duc de Béryd, je me suis trompé, ça devait être avant, c'est au 15e siècle, vers 1411."
        },
        {
            "start": 1137,
            "end": 1245,
            "text": "Elles sont conservées au château de Chantilly, si vous avez la chance de les voir, moi j'ai eu la chance de les voir il y a quelques années, et donc vous avez 12 mois, c'est un ouvrage dans l'huminure absolument magnifique, avec notamment un calendrier, donc 12 mois, de janvier en haut à décembre en bas à droite, et puis en haut, comme c'est un calendrier, vous voyez que vous avez des étoiles, la position du Soleil, et donc un calendrier, et puis la position du Soleil dans les constellations du Zodiac, parce que le Zodiac a une réalité astronomique et scientifique, même si après les astrologues en ont fait des âneries avec, n'empêche que le Zodiac est une bande de 13 constellations, de taille et de durée non homogènes, vous pouvez vous renseigner sur ça, et donc on peut voir ce calendrier avec ses couleurs, ce bleu épatant du 15e siècle, les constellations, et puis évidemment, ces très régisseurs du Luc du Berry nous renseignent sur la vie à l'époque, avec les semences au mois d'octobre, les vendanges au mois de septembre, je fais en sens inverse, les moissons en juin-juillet, et puis au mois de février, avec la neige, les semailles au mois de mars, et donc même si l'astronomie n'est peut-être pas l'inspiratrice, la première de cette œuvre majeure que sont les très riches œuvres du Luc du Berry, on voit néanmoins qu'il y a une part non négligeable qui est consacrée au phénomène céleste."
        },
        {
            "start": 1245,
            "end": 1257,
            "text": "Donc on était au 15e siècle de Raphaël, c'était donc le 16e, 1508, et donc on reprend l'ordre chronologique, j'espère que vous voyez bien sur cette fenêtre."
        },
        {
            "start": 1257,
            "end": 1267,
            "text": "Là aussi c'est au Vatican, et c'est Donato Cretti qui a peint plusieurs toiles, qui s'appellent Observations astronomiques, en pluriel."
        },
        {
            "start": 1267,
            "end": 1273,
            "text": "Il y en a plusieurs que je vais vous montrer, j'espère que ça fonctionne, et il s'est fait conseiller par des astronomes."
        },
        {
            "start": 1273,
            "end": 1295,
            "text": "Et donc voilà, là vous avez la Lune, je ne sais pas si vous arrivez à voir en bas, oui, normalement vous arrivez à voir en bas le titre, donc Donato Cretti, Observations astronomiques de la Lune, ça c'est de à peu près 1711, donc 18e siècle, et que la reproduction, l'œuvre est quand même, oserais-je dire, assez réaliste."
        },
        {
            "start": 1295,
            "end": 1305,
            "text": "On voit bien le cratère Copernicus, il y a vraiment une envie et une ambition de représenter le réel qui est assez réussi."
        },
        {
            "start": 1305,
            "end": 1309,
            "text": "Et puis vous avez une petite fenêtre avec un astronome qui observe."
        },
        {
            "start": 1309,
            "end": 1310,
            "text": "Donc ça c'était la Lune."
        },
        {
            "start": 1310,
            "end": 1329,
            "text": "Vous avez Mercure, dont les astronomes à l'époque avaient pu observer avec des lunettes depuis un siècle, la lune de Galilée c'est 1609, là on est en 1711, les phases Mercure, parce que Mercure est d'une planète intérieure, et donc selon sa position, on voit des phases, tout comme Vénus."
        },
        {
            "start": 1329,
            "end": 1331,
            "text": "Donc là il représente une des phases de Mercure."
        },
        {
            "start": 1331,
            "end": 1340,
            "text": "Alors évidemment l'échelle est à, j'allais dire géométrie variable, mais en tout cas ça représente fidèlement ce que les astronomes observaient à l'époque."
        },
        {
            "start": 1340,
            "end": 1353,
            "text": "Donc Mercure, Vénus, pareil, qui peut être en très fin croissant quand elle est en élongation modérée mais qu'elle est proche de nous, ça c'est tout à fait visible dans une lunette, elle est assez grande."
        },
        {
            "start": 1353,
            "end": 1367,
            "text": "Mars, c'est peut-être un petit peu too much, on peut la voir dans une phase gibbeuse, d'ailleurs elle commence, en ce moment si vous observez Mars, elle s'éloigne de l'opposition donc elle commence à avoir une ombre."
        },
        {
            "start": 1367,
            "end": 1379,
            "text": "Voilà, elle est représentée assez fidèlement, évidemment les lunettes de l'époque ne permettaient pas de voir trop de détails mais c'est assez fidèle."
        },
        {
            "start": 1379,
            "end": 1414,
            "text": "Jupiter, alors cette toile moi me touche particulièrement parce qu'elle est extrêmement fidèle, on voit les bandes de nuages sur le disque Jovien, on voit même la grande tâche rouge dans les bandes équatoriales de nuages, on voit trois de ces satellites, donc les satellites de Médicis, Galilée les avait nommés en leur honneur, donc il y en a quatre, Io, Europe, Galimée, Callisto, maintenant on les appelle les satellites galiléens, même si on a une soixantaine, effectivement quatre sont relativement bien visibles même avec des jumelles un peu puissantes."
        },
        {
            "start": 1414,
            "end": 1433,
            "text": "Donc là c'est très très fidèle et il y a Saturne qui connaissait bien sûr déjà avec des anneaux, alors après on peut se poser des questions sur la fidélité de la représentation des anneaux, mais en tout cas c'est assez bien fait avec à chaque fois une petite scène, puis je crois que c'est tout."
        },
        {
            "start": 1433,
            "end": 1453,
            "text": "Il y a une comète aussi, donc il y a toute une série qui représente les phénomènes célestes les plus importants, je crois qu'il y a le Soleil aussi, bon alors là on espère qu'ils n'ont pas trop observé sans filtre parce que sinon ils deviennent vite aveugles, mais je ne sais pas si on voit une tache solaire, mais en tout cas c'est également très fidèle."
        },
        {
            "start": 1453,
            "end": 1474,
            "text": "Donc oui c'est très inspirant, en tout cas pour moi, de représenter ces scènes un petit peu bucoliques, éventuellement sylvestres, voire romantiques, et puis il y a une lecture terrestre et puis la lecture astronomique, elle est très fidèle à ce que les contemporains pouvaient regarder."
        },
        {
            "start": 1474,
            "end": 1477,
            "text": "Donc ça c'était donc le 18e siècle 1711."
        },
        {
            "start": 1477,
            "end": 1498,
            "text": "On se rapproche de notre époque avec la dernière peinture que je vous propose, que vous pouvez voir dans la très belle salle de l'Observatoire de Paris, donc à Paris, dans le bâtiment Pérou, dans la salle du conseil où j'ai la chance d'aller régulièrement pour des réunions avec mes collègues, même si je ne travaille pas à l'Observatoire de Paris."
        },
        {
            "start": 1498,
            "end": 1504,
            "text": "Et donc c'est Vénus passant devant le char du soleil par monsieur Dupin en 1886, donc 19e siècle."
        },
        {
            "start": 1504,
            "end": 1526,
            "text": "Donc on voit l'astronome en bas avec sa lunette, puis Vénus, évidemment cette belle dame alors nue, dans cette représentation néo-antique, enfin je ne sais plus comment, néo-classique peut-être, c'est le terme, même si je ne suis absolument pas historien de l'art et je me défends de lui connaître, peut-être que quand j'aurai le temps."
        },
        {
            "start": 1526,
            "end": 1535,
            "text": "Donc qui passe devant le char du soleil qui est à gauche et puis voilà ça c'est très baroque comme représentation et puis même antique, le char du soleil."
        },
        {
            "start": 1535,
            "end": 1555,
            "text": "Et effectivement il y a eu un passage de Vénus à cette époque-là, je n'ai pu vérifier la date, mais Vénus passe devant le soleil de temps en temps, relativement rarement, mais de temps en temps, et c'était pour représenter ce phénomène avec cette allégorie que cette peinture de monsieur Dupin a été faite et donc c'est vraiment au sommet de la salle du conseil de l'Observatoire de Paris."
        },
        {
            "start": 1555,
            "end": 1564,
            "text": "Et effectivement quand on s'ennuie en réunion c'est très agréable de regarder le plafond et puis de songer à Vénus, au soleil, puis aux astronomes de l'époque."
        },
        {
            "start": 1564,
            "end": 1578,
            "text": "Et puis je termine avec cette dernière oeuvre qui est une photo mais qui m'a aussi beaucoup marqué, vous reconnaissez peut-être si vous êtes amateurs de photos contemporaines, en tout cas du XXe siècle, Ansel Adams en 1941."
        },
        {
            "start": 1578,
            "end": 1586,
            "text": "Le titre je l'ai noté mais je ne l'ai plus là, c'est en gros le lever de lune au Nouveau-Mexique."
        },
        {
            "start": 1586,
            "end": 1606,
            "text": "Et Ansel Adams a vraiment créé un courant artistique majeur avec une chambre photographique fermée à 11 ou 20 ou 30, pour ceux qui connaissent les objectifs photos, avec un ciel très sombre, une composition épatante."
        },
        {
            "start": 1606,
            "end": 1616,
            "text": "Et puis il a fait des images absolument inspirantes et magnifiques et uniques du sud-ouest américain notamment, donc dans les années 1940."
        },
        {
            "start": 1616,
            "end": 1626,
            "text": "Donc cette image m'a toujours frappé et effectivement quand on va aux Etats-Unis dans le sud-ouest, ce sont des choses qu'on peut voir assez régulièrement."
        },
        {
            "start": 1626,
            "end": 1634,
            "text": "Les étendues sont tellement grandes, on voit tellement loin qu'on peut voir des orages au loin ou des nuages et puis voir des objets célestes avec un avant-plan."
        },
        {
            "start": 1634,
            "end": 1642,
            "text": "Donc là c'est pris juste après ou pendant le coucher du soleil et on voit un cimetière de cette petite ville du Nouveau-Mexique."
        },
        {
            "start": 1642,
            "end": 1649,
            "text": "Et donc voilà très inspirant, noir et blanc, de très très beaux tirages."
        },
        {
            "start": 1649,
            "end": 1655,
            "text": "Voilà c'était la séquence art de notre petite séance."
        },
        {
            "start": 1655,
            "end": 1675,
            "text": "Je vous ai rappelé ici les œuvres que je vous ai proposées, Tapestries de Bayeux, Triâge de Jésus de Berry, Uranie, Observations astronomiques, donc Allégorie de Vénus passant devant le char du soleil et puis Ansel Adams des années 1940."
        },
        {
            "start": 1675,
            "end": 1685,
            "text": "Nous allons passer à la dernière partie qui est donc la cosmologie avec l'expansion de l'univers."
        },
        {
            "start": 1685,
            "end": 1699,
            "text": "Donc nous allons attaquer un peu de physique, un peu de calcul avec notamment les petites cartes que je vous ai préparées pour essayer de mieux expliquer tous ces concepts intéressants."
        },
        {
            "start": 1699,
            "end": 1701,
            "text": "C'est parti !"
        },
        {
            "start": 1701,
            "end": 1717,
            "text": "On attaque la partie cosmologie avec un plan détaillé j'espère."
        },
        {
            "start": 1717,
            "end": 1727,
            "text": "Donc on va parler d'expansion de l'univers, on va rendre ça intelligible et explicite."
        },
        {
            "start": 1727,
            "end": 1733,
            "text": "Tout d'abord dans la partie 1 on devra s'intéresser à la métrique de l'espace-temps."
        },
        {
            "start": 1733,
            "end": 1748,
            "text": "C'est un gros mot pour expliquer juste la notion de distance dans un espace disons normal à trois dimensions, clédien, puis à quatre dimensions, puis dans un univers courbe et dans un univers en expansion."
        },
        {
            "start": 1748,
            "end": 1751,
            "text": "La notion de distance est très importante."
        },
        {
            "start": 1751,
            "end": 1757,
            "text": "Ensuite on parlera du facteur d'échelle aux observations parce qu'on introduira un petit facteur d'échelle."
        },
        {
            "start": 1757,
            "end": 1759,
            "text": "Vous allez voir toute la clé est là."
        },
        {
            "start": 1759,
            "end": 1775,
            "text": "Et donc on parlera de distance, de redshift, c'est à dire de décalage cosmologique vers le rouge, et puis de cette fameuse constante de Bell qu'on peut paramétrer tout d'abord et puis on verra ensuite ce que ça donne."
        },
        {
            "start": 1775,
            "end": 1787,
            "text": "Grâce à ces deux parties d'introduction on peut aboutir aux parties 3 et 4 qui parlent vraiment de cosmologie, notamment de dynamique dans un univers en expansion."
        },
        {
            "start": 1787,
            "end": 1792,
            "text": "La dynamique c'est ce qui modélise le fait que ça s'expande."
        },
        {
            "start": 1792,
            "end": 1794,
            "text": "On va voir la loi de Hubble le mettre."
        },
        {
            "start": 1794,
            "end": 1807,
            "text": "Et puis on va faire des considérations relativement simples d'énergie cinétique potentielle et totale, chose que normalement les étudiants de Terminal et de L1 maîtrisent, l'énergie mécanique tout simplement."
        },
        {
            "start": 1807,
            "end": 1811,
            "text": "Là c'est une approche simplifiée que je prends évidemment."
        },
        {
            "start": 1811,
            "end": 1825,
            "text": "Elles nous permettent d'estimer la densité critique de l'univers, les densités réduites, les fameux paramètres oméga matière, oméga baryon, oméga lambda pour l'énergie sombre, etc."
        },
        {
            "start": 1825,
            "end": 1831,
            "text": "Et puis l'évolution du paramètre de facteur d'échelle."
        },
        {
            "start": 1831,
            "end": 1837,
            "text": "Et puis à la fin on attaque le modèle Friedman-Robertson-Walker."
        },
        {
            "start": 1837,
            "end": 1842,
            "text": "Donc pareil c'était écrit ici Robertson-Walker parce que j'écris pas tout, en plus j'écris mal."
        },
        {
            "start": 1842,
            "end": 1870,
            "text": "Mais voilà et donc on va regarder, alors là je vous balancerai les trois équations, je ne la démontrerai pas, mais on parlera un tout petit peu d'équations d'état qui expliquent la dynamique de l'univers et en fonction de quelle composante cette dynamique est sous-tendue ou en tout cas dominée, l'évolution de cette dynamique en fonction je crois du facteur d'échelle, on va voir ça, et puis le rôle de la matière et du rayonnement dans ces équations d'état et puis la dynamique totale."
        },
        {
            "start": 1870,
            "end": 1875,
            "text": "Donc je vous laisse ce petit plan qu'on ne peut pas avoir en entier."
        },
        {
            "start": 1875,
            "end": 1883,
            "text": "Vous avez parti 1, 2, 3, 4, vous pourrez y revenir si c'est un peu compliqué et puis on va parler donc d'expansion de l'univers."
        },
        {
            "start": 1883,
            "end": 1924,
            "text": "Donc voilà c'est parti, on part pour la partie 1, je mets le plan ici et pour cette partie 1, donc la métrique de l'espace-temps, c'est des maths pour l'instant, donc c'est tout simplement une définition pour commencer, je vais vous le dire à l'oral, en plus ça se reflète, une définition simple de la métrique, c'est un espace mathématique au sein duquel on définit une notion de distance entre deux éléments."
        },
        {
            "start": 1924,
            "end": 1937,
            "text": "Alors ça paraît bête de dire comme ça la distance, ok on le connaît, voilà donc je suis un point A et je vais à un point B, voilà une distance, voilà pourquoi on nous embête avec un espace métrique."
        },
        {
            "start": 1937,
            "end": 1954,
            "text": "Alors déjà là on est à une dimension, le point A et le point B, on est sur une ligne, on est éventuellement à deux dimensions si on est sur le plan de la feuille, on peut imaginer être à trois dimensions, la distance entre mes deux mains c'est une distance et il faut un espace métrique pour le définir, donc là on est à trois dimensions."
        },
        {
            "start": 1954,
            "end": 1968,
            "text": "Imaginez maintenant comme mon jogging de ce matin où j'ai d'ailleurs couru, un petit marathon tranquillement dans les bois, voilà j'ai fait un parcours qui ressemble de mémoire à un truc qui ressemble à ça, voilà."
        },
        {
            "start": 1968,
            "end": 1979,
            "text": "Mon point A et mon point B, le point de départ et le point d'arrivée sont les mêmes, donc est-ce que la distance que j'ai parcouru est nulle ?"
        },
        {
            "start": 1979,
            "end": 1983,
            "text": "On peut décider parce que je suis parti et je reviens au même point."
        },
        {
            "start": 1983,
            "end": 2010,
            "text": "Maintenant on peut définir aussi une distance qui est le long de mon chemin parcouru à moi et donc il faut munir mon petit parcours d'une métrique, alors je mets des tirets d'une manière assez régulière même s'il y a des côtes etc, je vous passe les détails, mais pour montrer qu'en fait heureusement j'ai parcouru en l'occurrence un peu plus de 21 km alors que mon point de départ et d'arrivée sont les mêmes."
        },
        {
            "start": 2010,
            "end": 2016,
            "text": "Donc voilà la notion de distance ou en tout cas de là, elle est définie selon mon parcours."
        },
        {
            "start": 2016,
            "end": 2029,
            "text": "Donc vous voyez que même une distance toute bête peut être un petit peu plus rusée que juste distance entre point A et point B. Imaginons maintenant une distance mais en temps."
        },
        {
            "start": 2029,
            "end": 2035,
            "text": "T1 je me lève le matin, T2 je me couche le soir."
        },
        {
            "start": 2035,
            "end": 2040,
            "text": "Je suis sur un axe du temps par exemple et je définis ma durée d'éveil."
        },
        {
            "start": 2040,
            "end": 2042,
            "text": "Je vais la faire simple."
        },
        {
            "start": 2042,
            "end": 2046,
            "text": "C'est une distance entre deux temps, une distance au point de vue mathématique."
        },
        {
            "start": 2046,
            "end": 2056,
            "text": "C'est une différence de temps donc ça sera exprimé en secondes alors que dans cette première partie c'était des distances spatiales, c'est exprimé en mètres, en kilomètres, en ce qu'on veut."
        },
        {
            "start": 2056,
            "end": 2062,
            "text": "Mais en tout cas c'était homogène à une distance physique c'est à dire une unité de longueur, là c'est une unité de temps."
        },
        {
            "start": 2062,
            "end": 2069,
            "text": "Mais d'un point de vue mathématique c'est la même chose, c'est ce qui sépare deux points dans l'espace qu'on a défini."
        },
        {
            "start": 2069,
            "end": 2074,
            "text": "Ici en bas c'est l'espace du temps, je vais faire une petite zone comme ça pour bien séparer."
        },
        {
            "start": 2074,
            "end": 2079,
            "text": "Mais vous voyez qu'il faut quand même une notion de distance, soit de temps soit d'espace."
        },
        {
            "start": 2079,
            "end": 2083,
            "text": "Maintenant on peut être à trois dimensions."
        },
        {
            "start": 2083,
            "end": 2085,
            "text": "Je vais reprendre l'image."
        },
        {
            "start": 2085,
            "end": 2097,
            "text": "La métrique définit la distance toujours entre deux points mais on peut aussi définir la distance entre deux événements."
        },
        {
            "start": 2097,
            "end": 2107,
            "text": "Par exemple la station de RER le matin et le bureau quand j'arrive."
        },
        {
            "start": 2107,
            "end": 2118,
            "text": "Si je mets RER ici et l'université ici, il y a une distance disons physique mais il y a aussi un temps 1 et un temps 2."
        },
        {
            "start": 2118,
            "end": 2119,
            "text": "Ce sont deux événements."
        },
        {
            "start": 2119,
            "end": 2123,
            "text": "Le premier événement c'est quand je sors du RER, qui est le train."
        },
        {
            "start": 2123,
            "end": 2127,
            "text": "Ceux qui ne connaissent pas le RER, c'est un train."
        },
        {
            "start": 2127,
            "end": 2138,
            "text": "Donc l'instant où je sors du train et l'instant où j'arrive dans mon bureau à l'université Paris-Saclay dans un laboratoire qui s'appelle l'IAS."
        },
        {
            "start": 2138,
            "end": 2148,
            "text": "On voit que ce sont deux événements parce qu'il y a une position, on peut dire x, y, z, si on est en cartésien, et puis un temps t1."
        },
        {
            "start": 2148,
            "end": 2152,
            "text": "Là j'ai une position x2, y2, z2."
        },
        {
            "start": 2152,
            "end": 2157,
            "text": "Mes notations ne sont pas hyper logiques mais enfin c'est pas grave."
        },
        {
            "start": 2157,
            "end": 2169,
            "text": "C'est un autre événement et on peut définir une distance d'espace-temps entre ces deux événements, même si là ce n'est plus une distance physique, ce n'est plus un temps non plus, c'est un mélange des deux parce qu'il y a quatre coordonnées."
        },
        {
            "start": 2169,
            "end": 2174,
            "text": "Première coordonnée, deuxième coordonnée, troisième coordonnée, quatrième coordonnée."
        },
        {
            "start": 2174,
            "end": 2185,
            "text": "Pour définir tout ça il faut un espace métrique qui nous définit une notion de distance entre les événements."
        },
        {
            "start": 2185,
            "end": 2187,
            "text": "C'est le début."
        },
        {
            "start": 2187,
            "end": 2204,
            "text": "Alors maintenant si je reprends mon plan, il faut une métrique, on va l'appliquer à la cosmologie, on veut savoir ce que c'est que la métrique de l'espace euclidien."
        },
        {
            "start": 2204,
            "end": 2212,
            "text": "L'espace euclidien c'est l'espace à trois dimensions habituelles."
        },
        {
            "start": 2212,
            "end": 2236,
            "text": "On dit que la distance infinitésimale, c'est le tout petit élément de distance très court, on peut l'appeler d sigma carré, c'est sigma la distance infinitésimale mais on la met au carré, c'est plus simple."
        },
        {
            "start": 2236,
            "end": 2240,
            "text": "On dit que c'est dx2 plus dy2 plus dz2."
        },
        {
            "start": 2240,
            "end": 2248,
            "text": "C'est un peu comme la norme d'un vecteur, si vous connaissez les vecteurs, c'est la somme quadratique."
        },
        {
            "start": 2248,
            "end": 2260,
            "text": "Donc le petit élément de distance entre deux points de l'espace à trois dimensions ici euclidien, c'est tout simplement la somme des dx, dy et dz."
        },
        {
            "start": 2260,
            "end": 2275,
            "text": "Le d sigma 2, c'est donc un nombre qui est la somme quadratique des trois autres."
        },
        {
            "start": 2275,
            "end": 2283,
            "text": "On peut avoir cette expression dans d'autres systèmes de coordonnées, coordonnées sphériques etc mais je ne vais pas me lancer là pour rester aussi simple que possible."
        },
        {
            "start": 2283,
            "end": 2287,
            "text": "Là j'essaie de me concentrer sur les idées principales."
        },
        {
            "start": 2287,
            "end": 2292,
            "text": "On en est dans l'espace métrique, dans l'espace euclidien."
        },
        {
            "start": 2292,
            "end": 2305,
            "text": "On peut s'amuser à aller dans l'espace-temps euclidien."
        },
        {
            "start": 2305,
            "end": 2313,
            "text": "C'est maintenant métrique de l'espace-temps euclidien."
        },
        {
            "start": 2313,
            "end": 2316,
            "text": "On rajoute le temps."
        },
        {
            "start": 2316,
            "end": 2319,
            "text": "On peut simplifier."
        },
        {
            "start": 2319,
            "end": 2326,
            "text": "Là on est disons en physique classique."
        },
        {
            "start": 2326,
            "end": 2332,
            "text": "Vous reconnaissez peut-être notre sœur Isaac Newton."
        },
        {
            "start": 2332,
            "end": 2335,
            "text": "Je me suis donné pour faire des petits cadres."
        },
        {
            "start": 2335,
            "end": 2336,
            "text": "Là on est en physique classique."
        },
        {
            "start": 2336,
            "end": 2342,
            "text": "On est dans un univers statique, c'est à dire qu'on est dans un univers quotidien."
        },
        {
            "start": 2342,
            "end": 2344,
            "text": "C'est cool ça, ça tient sur le côté."
        },
        {
            "start": 2344,
            "end": 2345,
            "text": "Univers statique."
        },
        {
            "start": 2345,
            "end": 2348,
            "text": "J'ai mis des petites fleurs et puis un réseau stable."
        },
        {
            "start": 2348,
            "end": 2353,
            "text": "Un réseau à deux dimensions mais on peut le propager à trois dimensions."
        },
        {
            "start": 2353,
            "end": 2355,
            "text": "Là tout marche bien, on a l'habitude."
        },
        {
            "start": 2355,
            "end": 2361,
            "text": "On n'a pas encore besoin de l'hypothèse d'homogénéité et d'isotropie de l'univers mais ça ne va pas tarder."
        },
        {
            "start": 2361,
            "end": 2367,
            "text": "Je la mets hors champ mais on va la sortir dans pas longtemps."
        },
        {
            "start": 2367,
            "end": 2371,
            "text": "On continue, on rajoute le temps."
        },
        {
            "start": 2371,
            "end": 2375,
            "text": "Là vous voyez qu'on a affaire à des événements."
        },
        {
            "start": 2375,
            "end": 2380,
            "text": "On a trois coordonnées d'espace et une dimension de temps."
        },
        {
            "start": 2380,
            "end": 2383,
            "text": "On appelle ça parfois un quadrivecteur."
        },
        {
            "start": 2383,
            "end": 2386,
            "text": "Je ne vais pas vous sortir des gros mots."
        },
        {
            "start": 2386,
            "end": 2392,
            "text": "La distance entre deux points de l'espace-temps, c'est la distance entre deux événements."
        },
        {
            "start": 2392,
            "end": 2397,
            "text": "On l'appelle ds²."
        },
        {
            "start": 2397,
            "end": 2405,
            "text": "On est obligé de passer en relativité restreinte."
        },
        {
            "start": 2405,
            "end": 2411,
            "text": "M. Newton peut aller se rhabiller un instant."
        },
        {
            "start": 2411,
            "end": 2422,
            "text": "C'est c²dt², le temps qui sépare les deux événements, moins ds²."
        },
        {
            "start": 2422,
            "end": 2428,
            "text": "Je vais mettre le d² en noir dans son petit nuage."
        },
        {
            "start": 2428,
            "end": 2430,
            "text": "C'est le d² qui est ici."
        },
        {
            "start": 2430,
            "end": 2436,
            "text": "On a une partie que je vais mettre en rouge, temporelle."
        },
        {
            "start": 2436,
            "end": 2442,
            "text": "Et ici une partie spatiale."
        },
        {
            "start": 2442,
            "end": 2446,
            "text": "Et voilà comment définir un événement en relativité restreinte."
        },
        {
            "start": 2446,
            "end": 2452,
            "text": "Ce concept est éminemment relativiste."
        },
        {
            "start": 2452,
            "end": 2459,
            "text": "Il n'est pas en physique classique, même si la notion d'événement est présente en physique classique."
        },
        {
            "start": 2459,
            "end": 2461,
            "text": "Mais le temps s'écoute de la même manière."
        },
        {
            "start": 2461,
            "end": 2468,
            "text": "On passe déjà en physique un peu rigolote, même si on est dans un univers statique."
        },
        {
            "start": 2468,
            "end": 2470,
            "text": "Voilà comment définir un événement."
        },
        {
            "start": 2470,
            "end": 2492,
            "text": "C'est le module de la distance dans un espace-temps euclidien entre deux événements séparés du micro-instant dt et séparés spatialement de la micro-distance ds² et le décimaneux était ici, c'était la différence de coordonnées spatiales entre les deux événements."
        },
        {
            "start": 2492,
            "end": 2494,
            "text": "Voyez, on met progressivement les choses en place."
        },
        {
            "start": 2494,
            "end": 2502,
            "text": "On parle d'une métrique qui nous permet de définir des distances à 4 dimensions en mêlant le temps et l'espace."
        },
        {
            "start": 2502,
            "end": 2506,
            "text": "Vous voyez d'ailleurs qu'il y a des signes, ce n'est pas que positif."
        },
        {
            "start": 2506,
            "end": 2510,
            "text": "Donc en fait, vous voyez que ça se compense, il se passe des choses assez rigolotes."
        },
        {
            "start": 2510,
            "end": 2518,
            "text": "Alors ça c'était l'espace statique, tranquille, 4 dimensions, tout va bien."
        },
        {
            "start": 2518,
            "end": 2526,
            "text": "Maintenant on va s'amuser à... parce que ça ne veut rien dire, ça deviendrait trop compliqué."
        },
        {
            "start": 2526,
            "end": 2531,
            "text": "On va s'amuser à regarder des choses un peu plus compliquées, mais on va imposer que l'univers est homogène et isotrope."
        },
        {
            "start": 2531,
            "end": 2533,
            "text": "Alors c'est quoi homogène et isotrope ?"
        },
        {
            "start": 2533,
            "end": 2538,
            "text": "Je vais essayer de le mettre... Ecoutez, il est statique là, ça tient comme ça."
        },
        {
            "start": 2538,
            "end": 2540,
            "text": "Il est homogène et isotrope."
        },
        {
            "start": 2540,
            "end": 2543,
            "text": "Ecoutez, vous vous rappelez qu'il est là, je vais le mettre comme ça."
        },
        {
            "start": 2543,
            "end": 2552,
            "text": "Homogène, ça veut dire, en tout cas en cosmologie, ça veut dire invariant par translation."
        },
        {
            "start": 2552,
            "end": 2554,
            "text": "Translation, vous savez, c'est se déplacer avec un vecteur."
        },
        {
            "start": 2554,
            "end": 2561,
            "text": "Donc ça veut dire que votre univers est le même partout si vous vous déplacez dans un certain vecteur."
        },
        {
            "start": 2561,
            "end": 2566,
            "text": "Par exemple un mur de briques est homogène si vous vous déplacez dans le mur de briques."
        },
        {
            "start": 2566,
            "end": 2573,
            "text": "Et isotrope, c'est invariant par rotation."
        },
        {
            "start": 2573,
            "end": 2583,
            "text": "Donc un oignon, si vous êtes au centre, est invariant par rotation, en supposant qu'il est évidemment tout sphérique, ou une étoile, etc."
        },
        {
            "start": 2583,
            "end": 2592,
            "text": "Donc on suppose, parce que sinon on ne s'en sort pas simplement en cinq minutes, que l'univers est homogène et isotrope, même si on sait qu'à certaines échelles ce n'est pas exactement le cas."
        },
        {
            "start": 2592,
            "end": 2599,
            "text": "Donc avec ces hypothèses, on en est au D, si je ne me suis pas trompé."
        },
        {
            "start": 2599,
            "end": 2602,
            "text": "Voilà, c'est ça."
        },
        {
            "start": 2602,
            "end": 2611,
            "text": "On en est au D et c'est métrique de l'espace courbe."
        },
        {
            "start": 2611,
            "end": 2614,
            "text": "Donc il faut cette hypothèse d'homogénéité et d'isotropie."
        },
        {
            "start": 2614,
            "end": 2618,
            "text": "Et alors là, on a quelque chose d'un petit peu plus souxe."
        },
        {
            "start": 2618,
            "end": 2621,
            "text": "Qu'est-ce que je vais vous dire ?"
        },
        {
            "start": 2621,
            "end": 2625,
            "text": "Parce que j'ai mes notes que j'avais écrites il y a quelques années."
        },
        {
            "start": 2625,
            "end": 2632,
            "text": "Alors là je vous balance, je vous sors du chapeau, parce que sinon je n'ai pas y arrivé, en un temps relativement court."
        },
        {
            "start": 2632,
            "end": 2637,
            "text": "On définit, comme tout à l'heure, une distance entre deux événements."
        },
        {
            "start": 2637,
            "end": 2647,
            "text": "Mais ici on est dans un espace qui n'est plus Euclidien, c'est-à-dire qu'il peut avoir de la courbure, des accélérations des masses, etc."
        },
        {
            "start": 2647,
            "end": 2649,
            "text": "On va voir ça juste après."
        },
        {
            "start": 2649,
            "end": 2656,
            "text": "Donc il y a une partie temporelle qui ressemble, mais c'est là où ça devient assez magique."
        },
        {
            "start": 2656,
            "end": 2658,
            "text": "Je vais le mettre en noir."
        },
        {
            "start": 2658,
            "end": 2660,
            "text": "Il y a un terme qui arrive."
        },
        {
            "start": 2660,
            "end": 2662,
            "text": "Désigma 2."
        },
        {
            "start": 2662,
            "end": 2664,
            "text": "Alors, de quoi s'agit-il ?"
        },
        {
            "start": 2664,
            "end": 2671,
            "text": "On fait aussi l'hypothèse, que je n'ai pas évoquée, que les variables sont séparées entre le temps et l'espace."
        },
        {
            "start": 2671,
            "end": 2676,
            "text": "Je vous l'avais fait vite, donc il y a plein de concepts un petit peu cachés."
        },
        {
            "start": 2676,
            "end": 2683,
            "text": "Mon parti pris, c'était de vous expliquer juste l'essence de toute cette démarche."
        },
        {
            "start": 2683,
            "end": 2688,
            "text": "Donc évidemment, s'il y a des spécialistes, j'espère que vous ne vous étranglez pas."
        },
        {
            "start": 2688,
            "end": 2690,
            "text": "Ou si c'est le cas, vous pouvez me le dire."
        },
        {
            "start": 2690,
            "end": 2699,
            "text": "Donc voilà, la distance entre deux événements dans un espace courbe, donc en relativité restreinte, toujours dans un univers statique, est homogène et isotrope."
        },
        {
            "start": 2699,
            "end": 2703,
            "text": "Il y a une partie temporelle, comme tout à l'heure, que j'avais mise en rouge."
        },
        {
            "start": 2703,
            "end": 2705,
            "text": "Je mets temps."
        },
        {
            "start": 2705,
            "end": 2717,
            "text": "Une partie spatiale, donc je mets espace, qui est la même, le dsigma², c'est le même que tout à l'heure dans la partie euclidienne."
        },
        {
            "start": 2717,
            "end": 2721,
            "text": "Mais regardez ce qu'il y a. Il y a un a de t qui dépend du temps."
        },
        {
            "start": 2721,
            "end": 2737,
            "text": "C'est-à-dire que le a de t, il va vous dire, j'ai le droit de faire gonfler, c'est un facteur multiplicatif, j'ai le droit d'appliquer une multiplication pour que la partie spatiale augmente ou diminue."
        },
        {
            "start": 2737,
            "end": 2740,
            "text": "Ça, on verra après de quoi il s'agit."
        },
        {
            "start": 2740,
            "end": 2749,
            "text": "Et ce a de t, parfois on l'appelle R de t dans certains bouquins, c'est le facteur d'échelle."
        },
        {
            "start": 2749,
            "end": 2784,
            "text": "Et si vous arrivez à intuiter, même si vous ne comprenez pas forcément tout ce qui est là, que les distances dans l'univers à quatre dimensions, avec des hypothèses simples, ont une partie temporelle qui vit sa vie, une partie spatiale qui vit sa vie, mais qui a un facteur multiplicatif qui dépend du temps où on est, de l'époque cosmique, et donc qui est un facteur multiplicatif, qui peut devenir grand."
        },
        {
            "start": 2784,
            "end": 2787,
            "text": "Genre, s'il est grand, il y a l'expansion."
        },
        {
            "start": 2787,
            "end": 2790,
            "text": "Vous avez à peu près tout compris, on va le voir ça dans un instant."
        },
        {
            "start": 2790,
            "end": 2802,
            "text": "L'expansion de l'univers, j'anticipe sur la suite bien sûr, c'est en fait l'impact de ce facteur qui est ici, toujours en faisant l'hypothèse d'une séparation des variables."
        },
        {
            "start": 2802,
            "end": 2813,
            "text": "Une autre... j'anticipe sur le E, c'était le E ça, le petit facteur d'échelle."
        },
        {
            "start": 2813,
            "end": 2816,
            "text": "On voit aussi que ces équations sont locales."
        },
        {
            "start": 2816,
            "end": 2818,
            "text": "Et ça c'est super important."
        },
        {
            "start": 2818,
            "end": 2819,
            "text": "Locales ça veut dire quoi ?"
        },
        {
            "start": 2819,
            "end": 2830,
            "text": "Ça veut dire que ce sont des différences entre deux événements qui sont à une échelle... Alors là c'est infinité simile, donc c'est censé être petit, mais on voit que ça ne concerne pas tout l'univers dans son ensemble."
        },
        {
            "start": 2830,
            "end": 2836,
            "text": "Donc souvent les gens pensent, à juste titre, oui mais l'expansion de l'univers c'est dans quoi ?"
        },
        {
            "start": 2836,
            "end": 2837,
            "text": "Regardez cette équation."
        },
        {
            "start": 2837,
            "end": 2851,
            "text": "Cette équation, elle ne dit rien d'autre que je prends deux événements, et je vois que si j'attends longtemps, dans l'hypothèse d'une expansion, j'anticipe, et bien cette distance entre les deux événements, cette distance spatio-temporelle, va augmenter."
        },
        {
            "start": 2851,
            "end": 2854,
            "text": "Elle ne dit rien sur l'extérieur de l'univers, l'intérieur, etc."
        },
        {
            "start": 2854,
            "end": 2858,
            "text": "Elle est locale, et elle dit juste ça, que la métrique s'étend."
        },
        {
            "start": 2858,
            "end": 2860,
            "text": "Juste ça."
        },
        {
            "start": 2860,
            "end": 2862,
            "text": "Ça c'est très important."
        },
        {
            "start": 2862,
            "end": 2868,
            "text": "Parce que nous les humains, c'est normal, on essaie d'interpréter cette notion d'expansion."
        },
        {
            "start": 2868,
            "end": 2874,
            "text": "L'expansion, elle nous dit juste, bêtement entre guillemets, regardez, c'est un facteur multiplicatif tout simple."
        },
        {
            "start": 2874,
            "end": 2875,
            "text": "Et ça marche."
        },
        {
            "start": 2875,
            "end": 2877,
            "text": "C'est ça qui est assez fascinant."
        },
        {
            "start": 2877,
            "end": 2880,
            "text": "Parce que ça ne marcherait pas, on ne serait pas là pour en parler."
        },
        {
            "start": 2880,
            "end": 2890,
            "text": "J'espère que ça vous a clarifié les choses, même si c'était un peu formel, c'est que le début, de ce côté expansion et facteur d'échelle."
        },
        {
            "start": 2890,
            "end": 2900,
            "text": "Dans un univers, on était plus statique, on passait un peu en expansion, j'ai mis des flèches, des paf, crac, boum, i, etc."
        },
        {
            "start": 2900,
            "end": 2905,
            "text": "Donc on arrive dans un peu le dur."
        },
        {
            "start": 2905,
            "end": 2911,
            "text": "On peut même commencer à avoir une petite transition vers la relativité générale, mais on n'y est pas encore formellement."
        },
        {
            "start": 2911,
            "end": 2920,
            "text": "On va passer à la partie 2, qui est du facteur d'échelle, dont on vient de parler, aux observations."
        },
        {
            "start": 2920,
            "end": 2922,
            "text": "Voilà, deuxième partie."
        },
        {
            "start": 2922,
            "end": 2929,
            "text": "Le parti pris que j'ai pris ici, c'est d'être très simple, de ne pas tout démontrer, et d'avoir un lien avec les observations."
        },
        {
            "start": 2929,
            "end": 2936,
            "text": "On pourrait avoir une partie de ce cours de manière tout à fait théorique, à partir de la relativité générale, etc."
        },
        {
            "start": 2936,
            "end": 2943,
            "text": "J'ai des collègues qui le font très bien, et ça serait plus précis, plus rigoureux, mais j'ai pris un parti un peu plus simple."
        },
        {
            "start": 2943,
            "end": 2966,
            "text": "J'ai oublié de vous dire dans la fois d'avant que l'on peut appeler ça... Là je vous ai mis une forme très générale, mais quand ça prend une forme particulière, que je ne vais pas vous écrire là, parce qu'il y a des fonctions qui sont très intéressantes, c'est que l'on peut appeler ça la forme de la résolution."
        },
        {
            "start": 2966,
            "end": 2985,
            "text": "Là je vous ai mis une forme très générale, mais quand ça prend une forme particulière, que je ne vais pas vous écrire là, parce qu'il y a des fonctions mathématiques un peu partout, on a la métrique qu'on va utiliser, qui s'appelle la métrique de Robertson-Walker."
        },
        {
            "start": 2985,
            "end": 2988,
            "text": "Rw comme petit nom."
        },
        {
            "start": 2988,
            "end": 3003,
            "text": "La métrique de Robertson-Walker, parce que ces deux personnes ont indépendamment trouvé cette métrique, qu'elle correspondait bien aux problèmes posés d'un univers en expansion."
        },
        {
            "start": 3003,
            "end": 3016,
            "text": "Et donc quand on parlera de métrique Robertson-Walker, on s'intéresserait à une métrique de l'espace courbe avec une forme particulière, que je ne vais pas détailler là."
        },
        {
            "start": 3016,
            "end": 3020,
            "text": "Et puis j'en profite parce que je relis les notes."
        },
        {
            "start": 3020,
            "end": 3028,
            "text": "Nous en cosmologie, on sera intéressé à des événements qui sont non-simultanés dans le temps, dans l'espace."
        },
        {
            "start": 3028,
            "end": 3030,
            "text": "Enfin surtout dans le temps."
        },
        {
            "start": 3030,
            "end": 3044,
            "text": "Par exemple quand on regarde une galaxie lointaine, on voit la lumière qui s'est propagée depuis longtemps, donc en fait on voit une galaxie qui est non seulement loin de nous d'un point de vue distance, mais aussi en temps, parce qu'on la voit telle qu'elle était dans le passé."
        },
        {
            "start": 3044,
            "end": 3048,
            "text": "Donc en cosmologie, on sera surtout intéressé à des événements non-simultanés."
        },
        {
            "start": 3048,
            "end": 3057,
            "text": "Donc loin et dans le passé, pour ce qu'on observe, des galaxies, le fond cosmologique, que sais-je, et puis nous on est là aujourd'hui."
        },
        {
            "start": 3057,
            "end": 3062,
            "text": "Donc c'est pour ça que le temps est imbriqué à l'espace, en tout cas pour la métrique."
        },
        {
            "start": 3062,
            "end": 3065,
            "text": "C'est pour ça que c'est important et que ça joue."
        },
        {
            "start": 3065,
            "end": 3071,
            "text": "Il y a deux termes, il y a un terme de temps et un terme d'espace, c'est important."
        },
        {
            "start": 3071,
            "end": 3073,
            "text": "Il n'y a pas un qui domine sur l'autre."
        },
        {
            "start": 3073,
            "end": 3079,
            "text": "Alors, distance propre, qu'est-ce que j'ai mis comme distance propre ?"
        },
        {
            "start": 3079,
            "end": 3090,
            "text": "La distance propre, c'est la distance spatiale qui sépare deux événements simultanés."
        },
        {
            "start": 3090,
            "end": 3095,
            "text": "Donc vous faites l'hypothèse qu'ils se produisent au même moment, puis vous prenez la distance."
        },
        {
            "start": 3095,
            "end": 3103,
            "text": "Donc en fait, ça annule la partie temporelle."
        },
        {
            "start": 3103,
            "end": 3110,
            "text": "Bon, on ne va pas l'utiliser, mais c'est pour fixer les idées, parce qu'en fait, on pense souvent à ça."
        },
        {
            "start": 3110,
            "end": 3114,
            "text": "On a ce qu'on appelle aussi la distance commobile."
        },
        {
            "start": 3114,
            "end": 3125,
            "text": "Commobile, ça veut dire qui bouge avec quelque chose qui bouge, en l'occurrence peut-être l'expansion de l'univers."
        },
        {
            "start": 3125,
            "end": 3132,
            "text": "Alors, j'aurais dû vous retrouver un dessin, je vais le faire, je vais retrouver le dessin, puis je vais vous le mettre."
        },
        {
            "start": 3132,
            "end": 3139,
            "text": "Mais on va faire un petit peu de démonstration."
        },
        {
            "start": 3139,
            "end": 3147,
            "text": "Je vais vous le mettre, mais je vais vous le faire ici en direct."
        },
        {
            "start": 3147,
            "end": 3153,
            "text": "Si je me mets un temps qui s'appelle T1, je vais mettre à deux dimensions, sinon je ne vais pas y arriver."
        },
        {
            "start": 3153,
            "end": 3155,
            "text": "Enfin, je pourrais, mais ça serait illisible."
        },
        {
            "start": 3155,
            "end": 3162,
            "text": "Je vais mettre une galaxie A et une galaxie B. Pourquoi je parle de galaxie ?"
        },
        {
            "start": 3162,
            "end": 3171,
            "text": "Parce que vous voyez que cette métrique-là, peut-être que je vais l'appeler l'équation 1, cette métrique, elle concerne vraiment l'espace-temps de l'univers, en fait à grande échelle."
        },
        {
            "start": 3171,
            "end": 3175,
            "text": "Ça ne nous concerne pas, nous, humains ou terriens."
        },
        {
            "start": 3175,
            "end": 3180,
            "text": "Je ne vais pas avoir mon ventre qui gonfle à cause de ce facteur d'échelle."
        },
        {
            "start": 3180,
            "end": 3187,
            "text": "Si mon ventre gonfle, c'est plutôt parce que j'aurais pris trop de pains au chocolat ou de croissant le matin au petit-déj, mais pas par l'expansion de l'univers."
        },
        {
            "start": 3187,
            "end": 3190,
            "text": "Donc il y a d'autres forces physiques qui dominent."
        },
        {
            "start": 3190,
            "end": 3196,
            "text": "La gravité, les forces électromagnétiques, les forces nucléaires fortes et faibles, donc là, il n'y a pas de soucis."
        },
        {
            "start": 3196,
            "end": 3200,
            "text": "L'expansion ici, le facteur d'échelle, joue très très peu."
        },
        {
            "start": 3200,
            "end": 3205,
            "text": "Pareil, la distance Terre-Lune n'est absolument pas affectée par cette expansion de l'univers."
        },
        {
            "start": 3205,
            "end": 3210,
            "text": "Il se trouve que la distance Terre-Lune augmente un petit peu, mais c'est dû aux effets de marée, aux conditions énergétiques, etc."
        },
        {
            "start": 3210,
            "end": 3215,
            "text": "Pareil, dans une galaxie, ou même dans un amas de galaxies, l'expansion de l'univers joue très très peu."
        },
        {
            "start": 3215,
            "end": 3227,
            "text": "Par contre, c'est vraiment entre galaxies très lointaines qui n'ont pas de causalité ou de force entre elles, là, cet aspect d'espace-temps va jouer dans les événements."
        },
        {
            "start": 3227,
            "end": 3229,
            "text": "On pourrait détailler un peu plus."
        },
        {
            "start": 3229,
            "end": 3242,
            "text": "Donc là, je considère deux galaxies très lointaines, qui sont déjà très lointaines, et qui s'attirent très très très peu, par rapport à, je ne sais pas, si il y a une galaxie C ici, les deux B et C s'attireront, il n'y a aucun souci."
        },
        {
            "start": 3242,
            "end": 3249,
            "text": "Elles s'attireront, et un peu comme la Voie lactée avec la galaxie d'Andromède, ça s'attire, et ce n'est absolument pas contradictoire avec l'expansion de l'univers."
        },
        {
            "start": 3249,
            "end": 3253,
            "text": "Ce qui est un peu compliqué en physique, c'est qu'il y a des domaines d'application."
        },
        {
            "start": 3253,
            "end": 3256,
            "text": "Donc, voilà, un univers en expansion."
        },
        {
            "start": 3256,
            "end": 3267,
            "text": "Donc, AT1, je suis comme ça, mais imaginons qu'AT2, je sois... Alors, je fais un autre dessin."
        },
        {
            "start": 3267,
            "end": 3270,
            "text": "Mon espace-temps se soit dilaté."
        },
        {
            "start": 3270,
            "end": 3277,
            "text": "Donc A sera là, et B sera là, et puis C sera peut-être plus rapproché, parce qu'entre-temps, il aurait été attiré par la gravité."
        },
        {
            "start": 3277,
            "end": 3280,
            "text": "Mais on voit que la distance entre les deux a augmenté, même si eux, ils n'ont rien fait."
        },
        {
            "start": 3280,
            "end": 3284,
            "text": "A est resté tranquille dans sa coordonnée."
        },
        {
            "start": 3284,
            "end": 3288,
            "text": "C'est juste le système de coordonnées, donc la métrique, donc l'espace-temps, qui s'est dilaté."
        },
        {
            "start": 3288,
            "end": 3291,
            "text": "Donc, ils n'ont rien demandé, mais en ce moment, ils ont fait un petit détail."
        },
        {
            "start": 3291,
            "end": 3293,
            "text": "C'est juste le système de coordonnées qui s'est dilaté."
        },
        {
            "start": 3293,
            "end": 3297,
            "text": "Donc, ils n'ont rien demandé, mais entre A et B, la distance a augmenté."
        },
        {
            "start": 3297,
            "end": 3300,
            "text": "Et donc, on fait intervenir la distance co-mobile."
        },
        {
            "start": 3300,
            "end": 3303,
            "text": "Il faut d'abord choisir une référence temporelle."
        },
        {
            "start": 3303,
            "end": 3305,
            "text": "On dit que c'est T égale aujourd'hui."
        },
        {
            "start": 3305,
            "end": 3306,
            "text": "On appelle ça T0."
        },
        {
            "start": 3306,
            "end": 3314,
            "text": "Donc, on dit, aujourd'hui, par exemple, les coordonnées de A et B sont celles-ci."
        },
        {
            "start": 3314,
            "end": 3324,
            "text": "Et puis, on définit un système qui, finalement, est attaché aux coordonnées de l'espace-temps, ce qui nous évite de prendre en compte l'expansion de l'univers."
        },
        {
            "start": 3324,
            "end": 3326,
            "text": "Je vais vous détailler ça."
        },
        {
            "start": 3326,
            "end": 3353,
            "text": "Je vais calculer la distance entre A et B. Je considère qu'il y a une distance r1 entre les deux, et puis que A émet un photon vers B. Je dis que la distance d1, on va dire que c'est aujourd'hui, même si je l'ai appelé 0, que c'est le facteur d'échelle correspondant au temps d'aujourd'hui, fois la distance r1, je vais la dessiner avec la tête en noir."
        },
        {
            "start": 3353,
            "end": 3362,
            "text": "La distance d1, c'est r1 fois le facteur d'échelle d'aujourd'hui, qui vaut, par exemple, 1."
        },
        {
            "start": 3362,
            "end": 3364,
            "text": "Vu qu'on est aujourd'hui, il n'y a pas de souci."
        },
        {
            "start": 3364,
            "end": 3385,
            "text": "Par contre, si je regarde à un autre instant, l'instant T2, j'aurais la distance d2, qui serait le facteur d'échelle à un instant ultérieur, mais toujours r1, puisque c'est un facteur multiplicatif."
        },
        {
            "start": 3385,
            "end": 3393,
            "text": "Le r1 restera le même, mais ce qu'il y a entre les deux, c'est le taux d'expansion, qui est le facteur A."
        },
        {
            "start": 3393,
            "end": 3410,
            "text": "On préfère exprimer les distances entre objets dans l'univers D de T, comme étant le facteur d'échelle à l'instant T, fois la distance aujourd'hui, divisé par le facteur d'échelle aujourd'hui."
        },
        {
            "start": 3410,
            "end": 3414,
            "text": "Donc ça, c'est la distance à un instant T quelconque."
        },
        {
            "start": 3414,
            "end": 3420,
            "text": "Et puis, je vais le mettre en rouge, ça c'est D aujourd'hui."
        },
        {
            "start": 3420,
            "end": 3422,
            "text": "Ça c'est le facteur d'échelle aujourd'hui."
        },
        {
            "start": 3422,
            "end": 3424,
            "text": "Étant pris comme zéro."
        },
        {
            "start": 3424,
            "end": 3441,
            "text": "Et donc, c'est beaucoup plus pratique de parler de distances comobiles, qui ne prennent pas en compte ce côté expansion de l'univers, qui est quand même plus gênant."
        },
        {
            "start": 3441,
            "end": 3446,
            "text": "J'espère que je suis clair, parce que... Je relis mes choses."
        },
        {
            "start": 3446,
            "end": 3449,
            "text": "On aurait pareil avec les volumes, on met au cube."
        },
        {
            "start": 3449,
            "end": 3458,
            "text": "Tout peut se déduire grâce au facteur d'échelle dont on avait parlé tout à l'heure."
        },
        {
            "start": 3458,
            "end": 3462,
            "text": "On est muni de ces distances comobiles."
        },
        {
            "start": 3462,
            "end": 3465,
            "text": "On va passer au redshift."
        },
        {
            "start": 3465,
            "end": 3474,
            "text": "Il paraît qu'il y a le décalage cosmologique vers le rouge, dû à l'expansion de l'univers, vu que c'est rouge."
        },
        {
            "start": 3474,
            "end": 3476,
            "text": "Je simplifie."
        },
        {
            "start": 3476,
            "end": 3478,
            "text": "Il y a plusieurs définitions."
        },
        {
            "start": 3478,
            "end": 3484,
            "text": "Je vous la fais courte, on pourrait lier ça de manière beaucoup plus fondamentale avec la théorie, etc."
        },
        {
            "start": 3484,
            "end": 3492,
            "text": "La restreinte c'est jouable, mais on est dans un univers en expansion, toujours, et toujours homogène, on est toujours bon avec nos petites cartes."
        },
        {
            "start": 3492,
            "end": 3495,
            "text": "Il y a plusieurs définitions."
        },
        {
            "start": 3495,
            "end": 3505,
            "text": "La première, qui est vraiment observationnelle, le redshift, on l'appelle communément z, petit z. Petit z, parce que grand z c'est la métallicité."
        },
        {
            "start": 3505,
            "end": 3506,
            "text": "Je le note."
        },
        {
            "start": 3506,
            "end": 3521,
            "text": "Petit z, c'est égal parfois à la longueur d'onde reçue au sol, sur Terre, par par exemple une galaxie très lointaine qui s'éloigne, par rapport à elle, la longueur d'onde qu'elle a émise."
        },
        {
            "start": 3521,
            "end": 3525,
            "text": "Parce que les deux longueurs d'ondes ne sont pas les mêmes à cause de ce fameux facteur d'expansion."
        },
        {
            "start": 3525,
            "end": 3541,
            "text": "Ce n'est pas vraiment celle-là qu'on va utiliser, mais on peut montrer, je vous le sors du chapeau, que 1 plus z c'est égal au facteur d'échelle aujourd'hui, sur le facteur d'échelle à l'instant t correspondant au redshift considéré."
        },
        {
            "start": 3541,
            "end": 3543,
            "text": "Parce que le redshift c'est dans le passé."
        },
        {
            "start": 3543,
            "end": 3547,
            "text": "Aujourd'hui on est aujourd'hui, et puis l'univers passé, il est passé."
        },
        {
            "start": 3547,
            "end": 3555,
            "text": "C'est ça qui va être intéressant de garder en mémoire, c'est que 1 plus le redshift, qui est une quantité mesurable, c'est le rapport des facteurs d'échelle."
        },
        {
            "start": 3555,
            "end": 3570,
            "text": "On voit que le redshift est sans dimension, et on voit que le redshift intègre la notion de facteur d'échelle, donc il est directement lié à l'époque cosmique et au taux d'expansion de l'univers."
        },
        {
            "start": 3570,
            "end": 3576,
            "text": "Alors on peut voir que... Je m'en remets un peu, mais c'est pas grave."
        },
        {
            "start": 3576,
            "end": 3584,
            "text": "On peut montrer, on va faire plus simple, que finalement A2t est croissante."
        },
        {
            "start": 3584,
            "end": 3587,
            "text": "Avec le temps."
        },
        {
            "start": 3587,
            "end": 3591,
            "text": "Si A2t est croissante, ça veut dire que l'univers est en expansion."
        },
        {
            "start": 3591,
            "end": 3593,
            "text": "Super important."
        },
        {
            "start": 3593,
            "end": 3598,
            "text": "Donc le facteur d'échelle, il augmente."
        },
        {
            "start": 3598,
            "end": 3600,
            "text": "A2t augmente."
        },
        {
            "start": 3600,
            "end": 3614,
            "text": "Et pour revenir à l'équation 1 de tout à l'heure, le A2t c'est juste le facteur que l'on applique devant la partie spatiale de la métrique, de la distance entre deux événements."
        },
        {
            "start": 3614,
            "end": 3615,
            "text": "Rien de plus."
        },
        {
            "start": 3615,
            "end": 3621,
            "text": "C'est hyper profond évidemment, mais il n'y a pas de notion d'extérieur, d'univers."
        },
        {
            "start": 3621,
            "end": 3625,
            "text": "Je parle juste de distance et d'événements."
        },
        {
            "start": 3625,
            "end": 3631,
            "text": "Et donc ça c'est assez lumineux j'espère."
        },
        {
            "start": 3631,
            "end": 3639,
            "text": "Et donc on va pouvoir parler du paramètre de Hubble, qui a aussi une définition."
        },
        {
            "start": 3639,
            "end": 3644,
            "text": "Je vous balance pour pouvoir démontrer des choses."
        },
        {
            "start": 3644,
            "end": 3652,
            "text": "Mais on peut dire que le paramètre de Hubble c'est A0.0 sur A0."
        },
        {
            "start": 3652,
            "end": 3657,
            "text": "Alors si vous n'êtes pas trop fort en maths, c'est pas grave, vous n'êtes pas obligé de comprendre cette partie là."
        },
        {
            "start": 3657,
            "end": 3666,
            "text": "Mais en gros A0.0 c'est la dérivée temporelle de A sur la dérivée de A. Donc on peut réécrire ici 1 sur A0."
        },
        {
            "start": 3666,
            "end": 3669,
            "text": "A0 c'est le paramètre de Hubble, 0 c'est aujourd'hui."
        },
        {
            "start": 3669,
            "end": 3675,
            "text": "Mais la constante de Hubble, qui n'est pas une constante, est définie à n'importe quel instant."
        },
        {
            "start": 3675,
            "end": 3679,
            "text": "Si je mettais un t ici, je serais en train de mettre un t aux autres."
        },
        {
            "start": 3679,
            "end": 3683,
            "text": "Donc A0 c'est aujourd'hui."
        },
        {
            "start": 3683,
            "end": 3687,
            "text": "Donc 1 sur A0, D de A0 sur Dt."
        },
        {
            "start": 3687,
            "end": 3692,
            "text": "Si vous connaissez l'expression de la dérivée temporelle de A, c'est comme ça que ça s'écrit."
        },
        {
            "start": 3692,
            "end": 3694,
            "text": "Voilà la définition du paramètre de Hubble."
        },
        {
            "start": 3694,
            "end": 3710,
            "text": "On voit que la constante de Hubble est directement reliée à la vitesse d'expansion renormalisée par le facteur d'échelle aujourd'hui."
        },
        {
            "start": 3710,
            "end": 3716,
            "text": "On peut se convaincre que ça c'est homogène à un temps moins 1."
        },
        {
            "start": 3716,
            "end": 3720,
            "text": "Parce que la dérivée temporelle, il y a 1 sur t qui arrive."
        },
        {
            "start": 3720,
            "end": 3723,
            "text": "Donc c'est homogène à 1 sur temps moins 1."
        },
        {
            "start": 3723,
            "end": 3731,
            "text": "Et on l'exprime en général en astrophysique, non pas en secondes moins 1, encore moins verte, mais en kilomètres par seconde par mégaparsec."
        },
        {
            "start": 3731,
            "end": 3734,
            "text": "Donc c'est bien 1 temps moins 1 ici."
        },
        {
            "start": 3734,
            "end": 3738,
            "text": "Mais ça c'est pour des raisons pratiques, parce que les mesures sont plus pratiques dans cette unité-là."
        },
        {
            "start": 3738,
            "end": 3744,
            "text": "J'espère que pour ces deux premières parties, vous avez tous les éléments."
        },
        {
            "start": 3744,
            "end": 3747,
            "text": "Je remets le petit plan qui me sert de guide aussi."
        },
        {
            "start": 3747,
            "end": 3755,
            "text": "On a parlé de maîtrise de l'espace-temps, qui est un concept mathématique, mais vous voyez à quoi ça sert, parce qu'on a introduit le facteur d'échelle."
        },
        {
            "start": 3755,
            "end": 3771,
            "text": "Et puis ce facteur d'échelle nous permet de parler de distance propre et commobile, bon là j'espère que je ne vous ai pas trop embrouillé, mais surtout de décalage vers le rouge, et puis de paramètres de Hubble et de lien avec le A de t, dont on voit qu'il y a une fonction croissante avec le temps."
        },
        {
            "start": 3771,
            "end": 3798,
            "text": "On a tous les éléments en main pour pouvoir parler maintenant de dynamique de l'univers et puis du modèle Friedman-Robertson-Walker, qui mélange la partie Robinson-Walker de la métrique avec la partie physique de la relation des équations de Friedman, qui est une solution des équations d'Einstein, qui permet de rendre compte de la dynamique physique de l'expansion de l'univers."
        },
        {
            "start": 3798,
            "end": 3817,
            "text": "Partie 3 Indigestion Alors vous savez quoi, je me rends compte que ça prend pas mal de temps, ce qui est chouette, mais j'ai peur que vous soyez un petit peu... non pas sous l'eau, mais qu'il y ait une petite indigestion, donc je propose de parler de la partie 3 et 4 la semaine prochaine."
        },
        {
            "start": 3817,
            "end": 3822,
            "text": "Je vais l'enregistrer, mais j'ai peur que ça fasse trop pour une seule séance."
        },
        {
            "start": 3822,
            "end": 3825,
            "text": "Je vais résumer ce qu'on a vu aujourd'hui."
        },
        {
            "start": 3825,
            "end": 3829,
            "text": "Désolé, j'improvise un peu, je vous le disais, c'est les conditions du direct."
        },
        {
            "start": 3829,
            "end": 3836,
            "text": "Pour parler d'expansion de l'univers, on a parlé de métrique et de facteur d'échelle, pour arriver jusqu'au paramètre de Hubble."
        },
        {
            "start": 3836,
            "end": 3875,
            "text": "J'espère que ça sera à peu près clair, avec une équation mètre qui est la fameuse équation 1, que j'aime bien remettre, qui est la distance séparant deux événements, distance au sens large, parce que ça mélange le temps et l'espace, mais avec ce facteur d'échelle qui est donc très important, qui maintenant utilise la notion d'univers en expansion, de relativité restreinte pour l'instant, donc la physique classique, on la met dessous, et on a fait l'hypothèse d'un univers homogène et isotrope."
        },
        {
            "start": 3875,
            "end": 3883,
            "text": "Et puis les cartes que je garde pour la prochaine fois, c'est cartes relativité générale et univers statique."
        },
        {
            "start": 3883,
            "end": 3890,
            "text": "Il nous restera à sortir la carte majeure, qui est relat G, mais on garde ça pour la semaine prochaine."
        },
        {
            "start": 3890,
            "end": 3893,
            "text": "J'espère que ça n'a pas été trop difficile."
        },
        {
            "start": 3893,
            "end": 3898,
            "text": "Je me suis bien amusé, même si je redécouvrais certaines de mes notes."
        },
        {
            "start": 3898,
            "end": 3902,
            "text": "J'ai mon excuse, mais c'est la vie."
        },
        {
            "start": 3902,
            "end": 3907,
            "text": "Avant la bonne continuation, on va parler des livres."
        },
        {
            "start": 3907,
            "end": 3910,
            "text": "Allons-y pour la séquence livre."
        },
        {
            "start": 3910,
            "end": 3918,
            "text": "Pour la séquence livre, il y a des références que j'aime beaucoup."
        },
        {
            "start": 3918,
            "end": 3924,
            "text": "Je vais vous présenter les principales qui servent à faire ce que j'ai évoqué à l'instant."
        },
        {
            "start": 3924,
            "end": 3934,
            "text": "La Bible de la cosmologie de Jim Peebles, dont je vous rappelle qu'il a pris Nobel de physique l'année dernière, 2019."
        },
        {
            "start": 3934,
            "end": 3939,
            "text": "Principles of Physical Cosmology, chez Princeton."
        },
        {
            "start": 3939,
            "end": 3941,
            "text": "Il y a un peu tout là-dedans."
        },
        {
            "start": 3941,
            "end": 3944,
            "text": "J'ai toutes mes notes, etc."
        },
        {
            "start": 3944,
            "end": 3948,
            "text": "C'est niveau avancé, fin de licence."
        },
        {
            "start": 3948,
            "end": 3954,
            "text": "Il y a un livre d'introduction que j'aime beaucoup, le Réunement cosmologique, de Marc Lachaiseret."
        },
        {
            "start": 3954,
            "end": 3959,
            "text": "J'ai une édition un peu ancienne, mais je pense que ce livre a été réédité."
        },
        {
            "start": 3959,
            "end": 3966,
            "text": "J'ai tout un tas de marque-pages, parce qu'il y a plein de choses sympathiques."
        },
        {
            "start": 3966,
            "end": 3978,
            "text": "Le livre que je pourrais conseiller à tous les étudiants, éventuellement lycéens, mais en tout cas étudiants, qui sont intéressés par la astrophysique, c'est Astrophysical Concepts de Martin Harwit, avec Grande Classe."
        },
        {
            "start": 3978,
            "end": 3989,
            "text": "Vous ne le voyez peut-être pas, mais j'ai la dédicace de mon ami Martin Harwit, qui est un très grand scientifique, qui est quelqu'un absolument d'épatante, extraordinaire, d'une humilité."
        },
        {
            "start": 3989,
            "end": 3994,
            "text": "Mes rencontres avec lui me restent gravées dans ma petite mémoire."
        },
        {
            "start": 3994,
            "end": 3996,
            "text": "Il y a aussi plein de notes."
        },
        {
            "start": 3996,
            "end": 4007,
            "text": "L'avantage de Astrophysical Concepts, ça ne parle pas que de cosmologie, ça parle vraiment de physique simple, de tout l'univers, donc des étoiles, des planètes, etc."
        },
        {
            "start": 4007,
            "end": 4011,
            "text": "Il parle même, je crois, d'exobiologie."
        },
        {
            "start": 4011,
            "end": 4014,
            "text": "Est-ce que c'est dans cette édition ?"
        },
        {
            "start": 4014,
            "end": 4016,
            "text": "Life in the Universe, oui c'est ça."
        },
        {
            "start": 4016,
            "end": 4017,
            "text": "Il parle de la thermodynamique."
        },
        {
            "start": 4017,
            "end": 4023,
            "text": "C'est en anglais, je ne pense pas que c'était traduible, mais bon, je pense qu'on peut y arriver."
        },
        {
            "start": 4023,
            "end": 4028,
            "text": "Et donc, il parle de cosmologie, de gaz, d'étoiles, de comment tout se forme."
        },
        {
            "start": 4028,
            "end": 4036,
            "text": "C'est vraiment une référence absolument incontournable pour ceux qui veulent comprendre un peu la physique de l'univers."
        },
        {
            "start": 4036,
            "end": 4052,
            "text": "Donc là, j'ai volontairement un petit peu monté le niveau pour une conférence de grand public, puisque finalement, cette dernière partie n'était pas de très grand public, mais elle était à destination en particulier de mes étudiants de l1, que j'ai croisés récemment et pour lesquels je n'ai pas pu finir tous mes cours."
        },
        {
            "start": 4052,
            "end": 4055,
            "text": "Donc voilà, c'est un peu dédié à eux."
        },
        {
            "start": 4055,
            "end": 4056,
            "text": "J'espère que ça leur plaira."
        },
        {
            "start": 4056,
            "end": 4076,
            "text": "Et puis rendez-vous à la semaine prochaine pour parler de la fin de cette belle séance de cosmologie, partie 3 et 4, et puis du JWST, parce que je vais vous parler quand même de ce qui m'a occupé, moi et de nombreux autres collègues astrophysiciens de par le monde ces derniers temps."
        },
        {
            "start": 4076,
            "end": 4081,
            "text": "Donc le télescope spatial JWST de la NASA, de l'Agence spatiale européenne et de l'Agence canadienne."
        },
        {
            "start": 4081,
            "end": 4090,
            "text": "Portez-vous bien, bonne continuation, et à mercredi prochain pour une autre conférence confinée, même si le confinement commence à être un petit peu plus flou, mais écoutez, c'est pas grave."
        },
        {
            "start": 4090,
            "end": 4095,
            "text": "J'ai envie de continuer, donc ça ne durera peut-être pas éternellement, mais profitons-en."
        },
        {
            "start": 4095,
            "end": 4098,
            "text": "Bonne après-midi et bonne continuation."
        },
        {
            "start": 4098,
            "end": 4099,
            "text": "Ciao, ciao."
        }
    ],
    "text": "2, 1, 0, et lift off ! Le dernier lift off de l'Atlantique ! Showmaster de Space Shuttle ! Le dernier lift off de l'Atlantique ! Le dernier lift off de l'Atlantique ! Showmaster de Space Shuttle ! Conférence confinée ASTRO Bonjour, bienvenue à cette conférence confinée numéro 11 du 2 décembre 2020. Le confinement semble toucher à sa fin. Néanmoins, les conférences confinées continuent, parce que d'abord ça m'amuse, et puis j'ai l'impression que ça amuse certains d'entre vous, en tout cas ça intéresse certains d'entre vous, et certaines, donc nous allons continuer. Alors aujourd'hui, au programme, parce que la semaine dernière il n'y a pas eu de conférence confinée, et je m'en excuse parce qu'on y reviendra peut-être la semaine prochaine finalement, j'étais très impliqué dans la partie scientifique du nouveau satellite observatoire JWST, de la NASA, de l'ESA et de la CSA, donc américain pour faire simple, européen et canadien, c'est un grand télescope qui sera lancé dans à peu près un an par une fusée Ariane 5, et donc les programmes scientifiques étaient dus mercredi matin dernier, donc c'est pour ça que je n'ai pas pu avoir une semaine de conférences confinées astro avec vous la semaine dernière. Alors aujourd'hui un programme intéressant, voilà, je reprends ma petite feuille, parce que finalement c'est ce qu'il y a de plus pratique, nous allons parler de quatre choses aujourd'hui, tout d'abord des conseils pour peut-être les étudiants et les lycéens qui nous écoutent, et qui sont pour certains en confinement, en tout cas s'agissant de l'université malheureusement, même si on déploie tous les efforts à tous les niveaux pour que les universités ouvrent de nouveau, beaucoup plus tôt que ce qui est annoncé, donc si possible en janvier, mais voilà c'est en cours. Mais en attendant, certains d'entre vous sont en distanciel, peut-être aussi pour les lycées en partie, donc voilà quelques conseils d'un prof d'université qui a affaire à quelques étudiants, donc ce sera relativement court. Deuxièmement, on va parler un tout petit peu de la Station Spatiale Internationale, parce qu'on la voit très très bien en ce moment le soir depuis la France métropolitaine, donc c'est vraiment le moment pour la voir, surtout qu'en général il fait à peu près beau, enfin ça dépend de votre région, mais là ça sera court. On parlera un petit peu d'art dans ce monde de brut, parce que l'art et la culture ça nous nourrit, tout comme la science, donc on parlera un peu d'art, et puis on passera au plein de résistance, qui est la cosmologie, l'expansion de l'univers. Donc là c'est tiré d'un cours que je donnais en première année d'université à Mélun, alors que je ne donne plus parce que j'avais, bref, j'avais plus assez de séances, mais le niveau est à peu près du, disons, terminale, première année d'université, donc ça sera un petit peu technique, c'est pour ça qu'il y aura des équations, c'est pour ça que j'ai pris le papier, c'est pas hyper compliqué, s'il y a des petits aspects que vous ne comprenez pas, c'est pas très gênant, d'abord vous pouvez me poser des questions en chat, et puis ce qui compte c'est vraiment le raisonnement général, après les détails techniques, les calculs, ça c'est pas gênant, ça vous trouverez le moment pour les comprendre, ou l'année d'après, ça c'est pas gênant, mais la logique globale, vous verrez, elle est relativement simple. Donc, on y va, on commence par les conseils pour les, disons, terminale, première année, deuxième année d'université, pour passer cette période où il y a du cours en distanciel et comment essayer de préparer la suite de l'année universitaire pour être d'attaque. Et bien c'est parti ! Alors mes conseils sont les suivants, basés sur un petit peu d'expérience. Le premier conseil que je pourrais donner aux étudiants, c'est de travailler en groupe, ça c'est très important, pour réviser, pour se questionner mutuellement, pour répondre, parce que tout seul c'est difficile, alors même si vous êtes à distance, vous pouvez communiquer, il y a plein d'outils qui existent, ça va de WhatsApp, etc. Mais bon, quand même avoir du temps de parole, plus que juste du texte, c'est important. Alors pourquoi c'est important ? Parce qu'en général, on n'a pas tout compris d'un cours ou d'un concept, et le travail tout seul, ça peut être difficile, surtout si on est à distance, qu'on est seul, et que la motivation est difficile. Le fait d'être en groupe vous permet de poser des questions aux autres, les autres ont en général la réponse, la réciproque étant vraie, c'est-à-dire que vous pourrez certainement avoir des réponses aux questions que se posent vos copains. Et mine de rien, penser à des questions et penser à des réponses, ça permet de faire travailler la réflexion, et ça permet de mieux structurer son savoir et ses compétences. Et donc ça va au-delà juste de l'aide ponctuelle, qui est déjà très bienvenue, et très utile, et très sympathique, et très agréable, ça permet en plus de vraiment bien intégrer, de se faire une réflexion vraiment personnelle sur un sujet ou un concept. Donc vous verrez, ça marche très très bien. Donc ça c'est le conseil que je donne. Certains étudiants restent toujours un petit peu seuls, etc. C'est peut-être un choix, mais à mon avis ce n'est pas un choix idéal. Donc travaillez en groupe quand vous pouvez, les outils existent. Le deuxième conseil, c'est poser des questions à votre enseignant. Pour cela je propose plusieurs choses. D'abord c'est bien formuler vos questions, surtout si vous êtes à distance avec une interface genre Zoom, Collaborate, etc. Ou parfois le son passe mal, si vous dites « Monsieur, j'ai pas compris l'équation 4 » ou « Madame, j'ai pas compris l'équation 4 » Déjà le temps que votre micro se réveille, on n'entend rien. Donc plutôt que de faire une question vraiment en mode onomatopée, je suggère de dire, voilà, de lever la main selon l'outil, dire « Monsieur, Madame, l'équation 4, il y a des choses que je ne comprends pas, notamment le terme bidule ou le terme machin, vous pouvez réexpliquer pourquoi ce terme, qu'est-ce qu'il fait, etc » Donc, poser des questions, bien formuler vos questions, même si évidemment vous ne comprenez pas parce que vous posez une question. Et c'est normal, il faut poser des questions. Si vous êtes en cours, c'est qu'a priori, il y a des choses que vous ne connaissez pas. Et c'est absolument pas honteux de poser des questions, au contraire. Et l'enseignant se trouvera conforté dans son cours si vous posez des questions. Et puis il parle dans le vide, et puis en général le niveau part un petit peu en live. Enfin, ça dépend des profs, bien sûr. Et donc, c'est un peu difficile. Donc, poser des questions, formuler les bien, et puis parler distinctement. Peut-être que je peux passer à mon conseil numéro 4. Tester votre micro, parce que vous avez peut-être un ordinateur qui n'est peut-être pas de dernière génération, et donc peut-être que le micro ne marche pas très bien. Et donc si en plus, vous posez une question très très courte, le temps que le micro s'active, nous derrière, on n'entend rien. Donc, tester votre micro avant. Éventuellement, prenez un téléphone si vous avez un aboiement avec appel illimité. En général, c'est le cas. Vous pouvez accéder normalement aux cours, aux téléconférences, en voix, avec un numéro de téléphone. Et vous pouvez avoir la partie visio à côté. Surtout si vous avez une connexion Internet qui n'est pas extraordinaire, vous pouvez passer pour la voix par la partie téléphone. Et ça marche très très bien. Moi, j'ai des collègues qui font ça, qui mettent leur téléphone pour juste écouter et parler, et puis ils mettent sur leur écran juste la partie vidéo. Et comme ça, il n'y a pas de souci de micro. Donc, posez des questions, formulez bien vos questions si vous pouvez, donc plus que 5 secondes, c'est mon conseil. Faites une phrase un petit peu... ou quelques phrases un peu longues. Et puis si jamais il y a un ou des profs qui vous disent que votre question est idiote, etc., passez à votre chemin, parce que les mauvais profs, il y en a heureusement très peu, effectivement, tensent éventuellement les élèves ou les étudiants à cause de mauvaises questions. Mais ça, heureusement, c'est très rare. Donc en fait, toutes les questions sont bonnes, et ça permet un dialogue, et ça permet d'illustrer des concepts. Et puis figurez-vous que si vous avez une question, à 95% de chance, il y en a d'autres qui se posent la même question. Donc ne serait-ce que pour ça, n'hésitez pas. Et puis pour les profs, c'est beaucoup plus agréable, je peux vous le dire en tant qu'ensignant-chercheur, avoir des étudiants qui interagissent avec nous via l'écran, parce qu'évidemment, quand on est en classe, c'est beaucoup plus facile, c'est beaucoup plus agréable et beaucoup plus dynamique. Et puis troisièmement, être à l'aise avec les outils numériques. Ça, vous pouvez le tester sans être en cours. Je pense aux interfaces de visioconférence, aux messageries instantanées de type Slack, aux documents en ligne de type Framapad, évidemment, il y a Google, Legafa, mais enfin, si on peut éviter, ce n'est pas plus mal. Enfin, Slack, ça fait aussi partie de Google, mais enfin, il y a d'autres outils qui existent. Parce que pendant ce temps un peu, soit de confinement, soit de post-confinement, c'est une occasion unique, un peu imposée, mais de devenir très à l'aise avec ces outils, parce qu'après, quand on reviendra au présentiel, et puis qu'il y aura, je ne sais pas, des téléconférences ou des interactions à avoir de manière numérique, si en plus ces outils vous sont un peu étrangers, là, c'est un peu la double peine et c'est dommage. Donc, formez-vous à tous ces outils de partage de documents, de messagerie instantanée mais structurée, comme Slack ou les parties open source qui existent. Pareil, sur les plateformes de visioconférence que vous utilisez, il y a des outils intégrés, que ce soit pour poser des questions en chat, pour prendre la parole ou pour mettre des émotions, des questionnements, des bravos, etc. Et plus vous serez à l'aise là-dedans, plus ça sera simple ensuite de passer sur le fond. Voilà, donc mes trois conseils, un peu, si vous êtes à l'université ou en distanciel, pour des cours, alors la période n'est pas facile, heureusement je crois que c'est en voie de se terminer pour cette phase-là, en tout cas. Travaillez en groupe, posez des questions, et puis bien les formuler, mais même si ce n'est pas clair dans votre tête, ce qui est normal, au moins prenez le temps de dire ce que vous ne comprenez pas et de l'objet de votre question. Parce que si la question est trop courte, déjà le micro, ça ne passe pas, et en plus, nous derrière, on se demande, mais c'est quoi la question ? Donc précisez, et ça évite des « mais alors, c'est quoi que tu n'as pas compris ? » et puis de parler au même moment, etc. Donc ça évite de faire perdre cinq minutes à tout le monde, et puis c'est beaucoup plus agréable. Être à l'aise avec les outils, et puis tester votre système pour être vraiment bien entendu, ce qui est quand même plus agréable pour tout le monde, si c'est possible. Et bien voilà, on passe à la deuxième partie ... Nous allons passer à la deuxième partie, qui concerne la Station Spatiale Internationale. Et là, je vais vous mettre le site web que je préfère, qui s'appelle HeavensAbove. Vous avez l'adresse, je ne sais pas si on voit la souris, je ne crois pas trop, bon bref. Heavens-above.com, vous mettez votre ville, votre endroit géographique, il y a une petite carte si vous voulez, et puis vous cliquez sur ISS, il y a un menu, et là vous avez les prochains passages pour Paris, mais en France, vous mettez votre ville, et vous avez la date des passages, et vous voyez que tous les soirs, en ce moment, il y a des passages. Alors on peut aller au-delà du 8 décembre. Donc le 2 décembre, par exemple, le jour de notre conférence confinée, à 18h15, début d'un passage, maximum à 18h18, c'est-à-dire là où l'ISS sera le plus haut dans le ciel, et puis fin à 18h20. Je vous en ai parlé il y a une ou deux séances de ce site, mais là, ça vaut vraiment le coup, parce que tous les soirs, il se passe quelque chose. Et puis je vous conseille, si vous avez le choix, de regarder les passages dont la magnitude est la plus brillante, c'est-à-dire le chiffre le plus négatif, le plus petit, parce que la magnitude, c'est une échelle log inverse, enfin, moins log, donc plus c'est négatif, mieux c'est. Et donc on voit qu'une magnitude de moins 3,5, donc mercredi soir, je clique, et puis pour Paris, c'est relativement simple. Vous avez une carte du ciel, à droite, c'est l'Ouest, alors normalement, il y a Jupiter et Saturne qui se rapprochent, d'ailleurs, qui sont très très beaux à voir durant tous, au moins, donc je vous conseille, si vous avez des jumelles ou un télescope, elles sont très très basses sur l'horizon, mais vous regardez plein Ouest, et puis vous verrez un point qui avance, comme ça, vous voyez, vous avez les minutes, et puis qui passe rapproche du pôle Nord, céleste, avec la petite ours, et puis qui s'éteindra juste après d'en percer, et ça met plusieurs minutes, et c'est très très sympa à voir. Donc c'est la bonne saison, s'il fait beau chez vous, profitez-en pour regarder la Station Spatiale Internationale. C'est le moment, depuis sa fenêtre, il n'y a aucun souci, et puis il suffit que vous ayez le côté Ouest ou le côté Est, selon quel côté vous regarderez, pour pouvoir la visualiser. Voilà, et bien, bonnes observations ! On va passer à un peu d'art. Voilà, un peu d'art pour dans ce monde de brut. Alors je vais remettre cette fenêtre, que j'ai préparée, et donc je vais vous montrer un, deux, trois, quatre, cinq, six, six œuvres qui m'ont inspiré, voilà, c'est complètement subjectif, donc voilà, c'est le choix du chef, des œuvres emblématiques, certaines ont à peu près mille ans, et puis je vais aller vers des périodes croissantes, de plus en plus proches de nous. Alors ici je prends mes antisèches, même si je connais, mais c'est pour ne pas vous dire trop de bêtises, c'est la tapisserie de Bayeux, qui se trouve à Bayeux, qui était cousue, qui repose sur une table, qui était cousue, qui représente sur des dizaines de mètres, toute une histoire, donc, onzième siècle, vers à peu près 1080, et puis vous voyez en haut, tout en haut, au milieu, au-dessus de la tour, une sorte d'étoile avec une traînée, c'est une comète, la comète de Halley, qui a été observée à cette époque-là, et qui annonçait un destin funeste, les comètes étaient annonciateurs de nouvelles terrifiantes, en tout cas c'était la croyance de l'époque, et donc effectivement, le roi en question avait du souci à se faire, et je crois qu'il a eu des soucis ensuite. C'est pour ça que la comète a été signifiée, et cousue, et notifiée, dans cette tapisserie absolument extraordinaire, qui est un témoignage de ce qui se passait, il y a presque 1000 ans, dans un état de conservation épatant, et donc, c'est de l'histoire, mais c'est de l'art aussi, et puis c'est un petit peu d'astronomie. Donc voilà, aussi longtemps que l'humain existe, il a probablement levé les yeux au ciel. Donc c'était un petit incis de la tapisserie de Bayeux, qui est toujours agréable à voir, et qu'on peut voir en France. Cette mosaïque est extraordinaire, celle-ci est du 16e siècle, à peu près 1508, donc il y a à peu près 512 ans, quelque chose comme ça, et c'est le peintre Raphaël, enfin l'artiste Raphaël, parce que là il n'y a pas que de la peinture, c'est au Vatican, où il représente Uranie, donc l'une des muses du quadrivium, et qui représente l'univers tel qu'il est conçu à l'époque, avec la Terre au centre, et puis la sphère des fixes, avec les étoiles, toutes dorées, toutes brillantes. Donc voilà comment la conception de l'univers, et l'astronomie, inspire l'un des artistes les plus renommés de son époque, dans un endroit de pouvoir important, qui était le Vatican au 16e siècle. Alors évidemment, Raphaël, on pourrait y passer des heures, regarder la finesse, les couleurs, surtout quand on pense à l'époque lointaine à laquelle ça a été conçu. On passe à une autre œuvre, j'espère que tout ça vous plaît, les traits régisseurs du Duc de Béryd, je me suis trompé, ça devait être avant, c'est au 15e siècle, vers 1411. Elles sont conservées au château de Chantilly, si vous avez la chance de les voir, moi j'ai eu la chance de les voir il y a quelques années, et donc vous avez 12 mois, c'est un ouvrage dans l'huminure absolument magnifique, avec notamment un calendrier, donc 12 mois, de janvier en haut à décembre en bas à droite, et puis en haut, comme c'est un calendrier, vous voyez que vous avez des étoiles, la position du Soleil, et donc un calendrier, et puis la position du Soleil dans les constellations du Zodiac, parce que le Zodiac a une réalité astronomique et scientifique, même si après les astrologues en ont fait des âneries avec, n'empêche que le Zodiac est une bande de 13 constellations, de taille et de durée non homogènes, vous pouvez vous renseigner sur ça, et donc on peut voir ce calendrier avec ses couleurs, ce bleu épatant du 15e siècle, les constellations, et puis évidemment, ces très régisseurs du Luc du Berry nous renseignent sur la vie à l'époque, avec les semences au mois d'octobre, les vendanges au mois de septembre, je fais en sens inverse, les moissons en juin-juillet, et puis au mois de février, avec la neige, les semailles au mois de mars, et donc même si l'astronomie n'est peut-être pas l'inspiratrice, la première de cette œuvre majeure que sont les très riches œuvres du Luc du Berry, on voit néanmoins qu'il y a une part non négligeable qui est consacrée au phénomène céleste. Donc on était au 15e siècle de Raphaël, c'était donc le 16e, 1508, et donc on reprend l'ordre chronologique, j'espère que vous voyez bien sur cette fenêtre. Là aussi c'est au Vatican, et c'est Donato Cretti qui a peint plusieurs toiles, qui s'appellent Observations astronomiques, en pluriel. Il y en a plusieurs que je vais vous montrer, j'espère que ça fonctionne, et il s'est fait conseiller par des astronomes. Et donc voilà, là vous avez la Lune, je ne sais pas si vous arrivez à voir en bas, oui, normalement vous arrivez à voir en bas le titre, donc Donato Cretti, Observations astronomiques de la Lune, ça c'est de à peu près 1711, donc 18e siècle, et que la reproduction, l'œuvre est quand même, oserais-je dire, assez réaliste. On voit bien le cratère Copernicus, il y a vraiment une envie et une ambition de représenter le réel qui est assez réussi. Et puis vous avez une petite fenêtre avec un astronome qui observe. Donc ça c'était la Lune. Vous avez Mercure, dont les astronomes à l'époque avaient pu observer avec des lunettes depuis un siècle, la lune de Galilée c'est 1609, là on est en 1711, les phases Mercure, parce que Mercure est d'une planète intérieure, et donc selon sa position, on voit des phases, tout comme Vénus. Donc là il représente une des phases de Mercure. Alors évidemment l'échelle est à, j'allais dire géométrie variable, mais en tout cas ça représente fidèlement ce que les astronomes observaient à l'époque. Donc Mercure, Vénus, pareil, qui peut être en très fin croissant quand elle est en élongation modérée mais qu'elle est proche de nous, ça c'est tout à fait visible dans une lunette, elle est assez grande. Mars, c'est peut-être un petit peu too much, on peut la voir dans une phase gibbeuse, d'ailleurs elle commence, en ce moment si vous observez Mars, elle s'éloigne de l'opposition donc elle commence à avoir une ombre. Voilà, elle est représentée assez fidèlement, évidemment les lunettes de l'époque ne permettaient pas de voir trop de détails mais c'est assez fidèle. Jupiter, alors cette toile moi me touche particulièrement parce qu'elle est extrêmement fidèle, on voit les bandes de nuages sur le disque Jovien, on voit même la grande tâche rouge dans les bandes équatoriales de nuages, on voit trois de ces satellites, donc les satellites de Médicis, Galilée les avait nommés en leur honneur, donc il y en a quatre, Io, Europe, Galimée, Callisto, maintenant on les appelle les satellites galiléens, même si on a une soixantaine, effectivement quatre sont relativement bien visibles même avec des jumelles un peu puissantes. Donc là c'est très très fidèle et il y a Saturne qui connaissait bien sûr déjà avec des anneaux, alors après on peut se poser des questions sur la fidélité de la représentation des anneaux, mais en tout cas c'est assez bien fait avec à chaque fois une petite scène, puis je crois que c'est tout. Il y a une comète aussi, donc il y a toute une série qui représente les phénomènes célestes les plus importants, je crois qu'il y a le Soleil aussi, bon alors là on espère qu'ils n'ont pas trop observé sans filtre parce que sinon ils deviennent vite aveugles, mais je ne sais pas si on voit une tache solaire, mais en tout cas c'est également très fidèle. Donc oui c'est très inspirant, en tout cas pour moi, de représenter ces scènes un petit peu bucoliques, éventuellement sylvestres, voire romantiques, et puis il y a une lecture terrestre et puis la lecture astronomique, elle est très fidèle à ce que les contemporains pouvaient regarder. Donc ça c'était donc le 18e siècle 1711. On se rapproche de notre époque avec la dernière peinture que je vous propose, que vous pouvez voir dans la très belle salle de l'Observatoire de Paris, donc à Paris, dans le bâtiment Pérou, dans la salle du conseil où j'ai la chance d'aller régulièrement pour des réunions avec mes collègues, même si je ne travaille pas à l'Observatoire de Paris. Et donc c'est Vénus passant devant le char du soleil par monsieur Dupin en 1886, donc 19e siècle. Donc on voit l'astronome en bas avec sa lunette, puis Vénus, évidemment cette belle dame alors nue, dans cette représentation néo-antique, enfin je ne sais plus comment, néo-classique peut-être, c'est le terme, même si je ne suis absolument pas historien de l'art et je me défends de lui connaître, peut-être que quand j'aurai le temps. Donc qui passe devant le char du soleil qui est à gauche et puis voilà ça c'est très baroque comme représentation et puis même antique, le char du soleil. Et effectivement il y a eu un passage de Vénus à cette époque-là, je n'ai pu vérifier la date, mais Vénus passe devant le soleil de temps en temps, relativement rarement, mais de temps en temps, et c'était pour représenter ce phénomène avec cette allégorie que cette peinture de monsieur Dupin a été faite et donc c'est vraiment au sommet de la salle du conseil de l'Observatoire de Paris. Et effectivement quand on s'ennuie en réunion c'est très agréable de regarder le plafond et puis de songer à Vénus, au soleil, puis aux astronomes de l'époque. Et puis je termine avec cette dernière oeuvre qui est une photo mais qui m'a aussi beaucoup marqué, vous reconnaissez peut-être si vous êtes amateurs de photos contemporaines, en tout cas du XXe siècle, Ansel Adams en 1941. Le titre je l'ai noté mais je ne l'ai plus là, c'est en gros le lever de lune au Nouveau-Mexique. Et Ansel Adams a vraiment créé un courant artistique majeur avec une chambre photographique fermée à 11 ou 20 ou 30, pour ceux qui connaissent les objectifs photos, avec un ciel très sombre, une composition épatante. Et puis il a fait des images absolument inspirantes et magnifiques et uniques du sud-ouest américain notamment, donc dans les années 1940. Donc cette image m'a toujours frappé et effectivement quand on va aux Etats-Unis dans le sud-ouest, ce sont des choses qu'on peut voir assez régulièrement. Les étendues sont tellement grandes, on voit tellement loin qu'on peut voir des orages au loin ou des nuages et puis voir des objets célestes avec un avant-plan. Donc là c'est pris juste après ou pendant le coucher du soleil et on voit un cimetière de cette petite ville du Nouveau-Mexique. Et donc voilà très inspirant, noir et blanc, de très très beaux tirages. Voilà c'était la séquence art de notre petite séance. Je vous ai rappelé ici les œuvres que je vous ai proposées, Tapestries de Bayeux, Triâge de Jésus de Berry, Uranie, Observations astronomiques, donc Allégorie de Vénus passant devant le char du soleil et puis Ansel Adams des années 1940. Nous allons passer à la dernière partie qui est donc la cosmologie avec l'expansion de l'univers. Donc nous allons attaquer un peu de physique, un peu de calcul avec notamment les petites cartes que je vous ai préparées pour essayer de mieux expliquer tous ces concepts intéressants. C'est parti ! On attaque la partie cosmologie avec un plan détaillé j'espère. Donc on va parler d'expansion de l'univers, on va rendre ça intelligible et explicite. Tout d'abord dans la partie 1 on devra s'intéresser à la métrique de l'espace-temps. C'est un gros mot pour expliquer juste la notion de distance dans un espace disons normal à trois dimensions, clédien, puis à quatre dimensions, puis dans un univers courbe et dans un univers en expansion. La notion de distance est très importante. Ensuite on parlera du facteur d'échelle aux observations parce qu'on introduira un petit facteur d'échelle. Vous allez voir toute la clé est là. Et donc on parlera de distance, de redshift, c'est à dire de décalage cosmologique vers le rouge, et puis de cette fameuse constante de Bell qu'on peut paramétrer tout d'abord et puis on verra ensuite ce que ça donne. Grâce à ces deux parties d'introduction on peut aboutir aux parties 3 et 4 qui parlent vraiment de cosmologie, notamment de dynamique dans un univers en expansion. La dynamique c'est ce qui modélise le fait que ça s'expande. On va voir la loi de Hubble le mettre. Et puis on va faire des considérations relativement simples d'énergie cinétique potentielle et totale, chose que normalement les étudiants de Terminal et de L1 maîtrisent, l'énergie mécanique tout simplement. Là c'est une approche simplifiée que je prends évidemment. Elles nous permettent d'estimer la densité critique de l'univers, les densités réduites, les fameux paramètres oméga matière, oméga baryon, oméga lambda pour l'énergie sombre, etc. Et puis l'évolution du paramètre de facteur d'échelle. Et puis à la fin on attaque le modèle Friedman-Robertson-Walker. Donc pareil c'était écrit ici Robertson-Walker parce que j'écris pas tout, en plus j'écris mal. Mais voilà et donc on va regarder, alors là je vous balancerai les trois équations, je ne la démontrerai pas, mais on parlera un tout petit peu d'équations d'état qui expliquent la dynamique de l'univers et en fonction de quelle composante cette dynamique est sous-tendue ou en tout cas dominée, l'évolution de cette dynamique en fonction je crois du facteur d'échelle, on va voir ça, et puis le rôle de la matière et du rayonnement dans ces équations d'état et puis la dynamique totale. Donc je vous laisse ce petit plan qu'on ne peut pas avoir en entier. Vous avez parti 1, 2, 3, 4, vous pourrez y revenir si c'est un peu compliqué et puis on va parler donc d'expansion de l'univers. Donc voilà c'est parti, on part pour la partie 1, je mets le plan ici et pour cette partie 1, donc la métrique de l'espace-temps, c'est des maths pour l'instant, donc c'est tout simplement une définition pour commencer, je vais vous le dire à l'oral, en plus ça se reflète, une définition simple de la métrique, c'est un espace mathématique au sein duquel on définit une notion de distance entre deux éléments. Alors ça paraît bête de dire comme ça la distance, ok on le connaît, voilà donc je suis un point A et je vais à un point B, voilà une distance, voilà pourquoi on nous embête avec un espace métrique. Alors déjà là on est à une dimension, le point A et le point B, on est sur une ligne, on est éventuellement à deux dimensions si on est sur le plan de la feuille, on peut imaginer être à trois dimensions, la distance entre mes deux mains c'est une distance et il faut un espace métrique pour le définir, donc là on est à trois dimensions. Imaginez maintenant comme mon jogging de ce matin où j'ai d'ailleurs couru, un petit marathon tranquillement dans les bois, voilà j'ai fait un parcours qui ressemble de mémoire à un truc qui ressemble à ça, voilà. Mon point A et mon point B, le point de départ et le point d'arrivée sont les mêmes, donc est-ce que la distance que j'ai parcouru est nulle ? On peut décider parce que je suis parti et je reviens au même point. Maintenant on peut définir aussi une distance qui est le long de mon chemin parcouru à moi et donc il faut munir mon petit parcours d'une métrique, alors je mets des tirets d'une manière assez régulière même s'il y a des côtes etc, je vous passe les détails, mais pour montrer qu'en fait heureusement j'ai parcouru en l'occurrence un peu plus de 21 km alors que mon point de départ et d'arrivée sont les mêmes. Donc voilà la notion de distance ou en tout cas de là, elle est définie selon mon parcours. Donc vous voyez que même une distance toute bête peut être un petit peu plus rusée que juste distance entre point A et point B. Imaginons maintenant une distance mais en temps. T1 je me lève le matin, T2 je me couche le soir. Je suis sur un axe du temps par exemple et je définis ma durée d'éveil. Je vais la faire simple. C'est une distance entre deux temps, une distance au point de vue mathématique. C'est une différence de temps donc ça sera exprimé en secondes alors que dans cette première partie c'était des distances spatiales, c'est exprimé en mètres, en kilomètres, en ce qu'on veut. Mais en tout cas c'était homogène à une distance physique c'est à dire une unité de longueur, là c'est une unité de temps. Mais d'un point de vue mathématique c'est la même chose, c'est ce qui sépare deux points dans l'espace qu'on a défini. Ici en bas c'est l'espace du temps, je vais faire une petite zone comme ça pour bien séparer. Mais vous voyez qu'il faut quand même une notion de distance, soit de temps soit d'espace. Maintenant on peut être à trois dimensions. Je vais reprendre l'image. La métrique définit la distance toujours entre deux points mais on peut aussi définir la distance entre deux événements. Par exemple la station de RER le matin et le bureau quand j'arrive. Si je mets RER ici et l'université ici, il y a une distance disons physique mais il y a aussi un temps 1 et un temps 2. Ce sont deux événements. Le premier événement c'est quand je sors du RER, qui est le train. Ceux qui ne connaissent pas le RER, c'est un train. Donc l'instant où je sors du train et l'instant où j'arrive dans mon bureau à l'université Paris-Saclay dans un laboratoire qui s'appelle l'IAS. On voit que ce sont deux événements parce qu'il y a une position, on peut dire x, y, z, si on est en cartésien, et puis un temps t1. Là j'ai une position x2, y2, z2. Mes notations ne sont pas hyper logiques mais enfin c'est pas grave. C'est un autre événement et on peut définir une distance d'espace-temps entre ces deux événements, même si là ce n'est plus une distance physique, ce n'est plus un temps non plus, c'est un mélange des deux parce qu'il y a quatre coordonnées. Première coordonnée, deuxième coordonnée, troisième coordonnée, quatrième coordonnée. Pour définir tout ça il faut un espace métrique qui nous définit une notion de distance entre les événements. C'est le début. Alors maintenant si je reprends mon plan, il faut une métrique, on va l'appliquer à la cosmologie, on veut savoir ce que c'est que la métrique de l'espace euclidien. L'espace euclidien c'est l'espace à trois dimensions habituelles. On dit que la distance infinitésimale, c'est le tout petit élément de distance très court, on peut l'appeler d sigma carré, c'est sigma la distance infinitésimale mais on la met au carré, c'est plus simple. On dit que c'est dx2 plus dy2 plus dz2. C'est un peu comme la norme d'un vecteur, si vous connaissez les vecteurs, c'est la somme quadratique. Donc le petit élément de distance entre deux points de l'espace à trois dimensions ici euclidien, c'est tout simplement la somme des dx, dy et dz. Le d sigma 2, c'est donc un nombre qui est la somme quadratique des trois autres. On peut avoir cette expression dans d'autres systèmes de coordonnées, coordonnées sphériques etc mais je ne vais pas me lancer là pour rester aussi simple que possible. Là j'essaie de me concentrer sur les idées principales. On en est dans l'espace métrique, dans l'espace euclidien. On peut s'amuser à aller dans l'espace-temps euclidien. C'est maintenant métrique de l'espace-temps euclidien. On rajoute le temps. On peut simplifier. Là on est disons en physique classique. Vous reconnaissez peut-être notre sœur Isaac Newton. Je me suis donné pour faire des petits cadres. Là on est en physique classique. On est dans un univers statique, c'est à dire qu'on est dans un univers quotidien. C'est cool ça, ça tient sur le côté. Univers statique. J'ai mis des petites fleurs et puis un réseau stable. Un réseau à deux dimensions mais on peut le propager à trois dimensions. Là tout marche bien, on a l'habitude. On n'a pas encore besoin de l'hypothèse d'homogénéité et d'isotropie de l'univers mais ça ne va pas tarder. Je la mets hors champ mais on va la sortir dans pas longtemps. On continue, on rajoute le temps. Là vous voyez qu'on a affaire à des événements. On a trois coordonnées d'espace et une dimension de temps. On appelle ça parfois un quadrivecteur. Je ne vais pas vous sortir des gros mots. La distance entre deux points de l'espace-temps, c'est la distance entre deux événements. On l'appelle ds². On est obligé de passer en relativité restreinte. M. Newton peut aller se rhabiller un instant. C'est c²dt², le temps qui sépare les deux événements, moins ds². Je vais mettre le d² en noir dans son petit nuage. C'est le d² qui est ici. On a une partie que je vais mettre en rouge, temporelle. Et ici une partie spatiale. Et voilà comment définir un événement en relativité restreinte. Ce concept est éminemment relativiste. Il n'est pas en physique classique, même si la notion d'événement est présente en physique classique. Mais le temps s'écoute de la même manière. On passe déjà en physique un peu rigolote, même si on est dans un univers statique. Voilà comment définir un événement. C'est le module de la distance dans un espace-temps euclidien entre deux événements séparés du micro-instant dt et séparés spatialement de la micro-distance ds² et le décimaneux était ici, c'était la différence de coordonnées spatiales entre les deux événements. Voyez, on met progressivement les choses en place. On parle d'une métrique qui nous permet de définir des distances à 4 dimensions en mêlant le temps et l'espace. Vous voyez d'ailleurs qu'il y a des signes, ce n'est pas que positif. Donc en fait, vous voyez que ça se compense, il se passe des choses assez rigolotes. Alors ça c'était l'espace statique, tranquille, 4 dimensions, tout va bien. Maintenant on va s'amuser à... parce que ça ne veut rien dire, ça deviendrait trop compliqué. On va s'amuser à regarder des choses un peu plus compliquées, mais on va imposer que l'univers est homogène et isotrope. Alors c'est quoi homogène et isotrope ? Je vais essayer de le mettre... Ecoutez, il est statique là, ça tient comme ça. Il est homogène et isotrope. Ecoutez, vous vous rappelez qu'il est là, je vais le mettre comme ça. Homogène, ça veut dire, en tout cas en cosmologie, ça veut dire invariant par translation. Translation, vous savez, c'est se déplacer avec un vecteur. Donc ça veut dire que votre univers est le même partout si vous vous déplacez dans un certain vecteur. Par exemple un mur de briques est homogène si vous vous déplacez dans le mur de briques. Et isotrope, c'est invariant par rotation. Donc un oignon, si vous êtes au centre, est invariant par rotation, en supposant qu'il est évidemment tout sphérique, ou une étoile, etc. Donc on suppose, parce que sinon on ne s'en sort pas simplement en cinq minutes, que l'univers est homogène et isotrope, même si on sait qu'à certaines échelles ce n'est pas exactement le cas. Donc avec ces hypothèses, on en est au D, si je ne me suis pas trompé. Voilà, c'est ça. On en est au D et c'est métrique de l'espace courbe. Donc il faut cette hypothèse d'homogénéité et d'isotropie. Et alors là, on a quelque chose d'un petit peu plus souxe. Qu'est-ce que je vais vous dire ? Parce que j'ai mes notes que j'avais écrites il y a quelques années. Alors là je vous balance, je vous sors du chapeau, parce que sinon je n'ai pas y arrivé, en un temps relativement court. On définit, comme tout à l'heure, une distance entre deux événements. Mais ici on est dans un espace qui n'est plus Euclidien, c'est-à-dire qu'il peut avoir de la courbure, des accélérations des masses, etc. On va voir ça juste après. Donc il y a une partie temporelle qui ressemble, mais c'est là où ça devient assez magique. Je vais le mettre en noir. Il y a un terme qui arrive. Désigma 2. Alors, de quoi s'agit-il ? On fait aussi l'hypothèse, que je n'ai pas évoquée, que les variables sont séparées entre le temps et l'espace. Je vous l'avais fait vite, donc il y a plein de concepts un petit peu cachés. Mon parti pris, c'était de vous expliquer juste l'essence de toute cette démarche. Donc évidemment, s'il y a des spécialistes, j'espère que vous ne vous étranglez pas. Ou si c'est le cas, vous pouvez me le dire. Donc voilà, la distance entre deux événements dans un espace courbe, donc en relativité restreinte, toujours dans un univers statique, est homogène et isotrope. Il y a une partie temporelle, comme tout à l'heure, que j'avais mise en rouge. Je mets temps. Une partie spatiale, donc je mets espace, qui est la même, le dsigma², c'est le même que tout à l'heure dans la partie euclidienne. Mais regardez ce qu'il y a. Il y a un a de t qui dépend du temps. C'est-à-dire que le a de t, il va vous dire, j'ai le droit de faire gonfler, c'est un facteur multiplicatif, j'ai le droit d'appliquer une multiplication pour que la partie spatiale augmente ou diminue. Ça, on verra après de quoi il s'agit. Et ce a de t, parfois on l'appelle R de t dans certains bouquins, c'est le facteur d'échelle. Et si vous arrivez à intuiter, même si vous ne comprenez pas forcément tout ce qui est là, que les distances dans l'univers à quatre dimensions, avec des hypothèses simples, ont une partie temporelle qui vit sa vie, une partie spatiale qui vit sa vie, mais qui a un facteur multiplicatif qui dépend du temps où on est, de l'époque cosmique, et donc qui est un facteur multiplicatif, qui peut devenir grand. Genre, s'il est grand, il y a l'expansion. Vous avez à peu près tout compris, on va le voir ça dans un instant. L'expansion de l'univers, j'anticipe sur la suite bien sûr, c'est en fait l'impact de ce facteur qui est ici, toujours en faisant l'hypothèse d'une séparation des variables. Une autre... j'anticipe sur le E, c'était le E ça, le petit facteur d'échelle. On voit aussi que ces équations sont locales. Et ça c'est super important. Locales ça veut dire quoi ? Ça veut dire que ce sont des différences entre deux événements qui sont à une échelle... Alors là c'est infinité simile, donc c'est censé être petit, mais on voit que ça ne concerne pas tout l'univers dans son ensemble. Donc souvent les gens pensent, à juste titre, oui mais l'expansion de l'univers c'est dans quoi ? Regardez cette équation. Cette équation, elle ne dit rien d'autre que je prends deux événements, et je vois que si j'attends longtemps, dans l'hypothèse d'une expansion, j'anticipe, et bien cette distance entre les deux événements, cette distance spatio-temporelle, va augmenter. Elle ne dit rien sur l'extérieur de l'univers, l'intérieur, etc. Elle est locale, et elle dit juste ça, que la métrique s'étend. Juste ça. Ça c'est très important. Parce que nous les humains, c'est normal, on essaie d'interpréter cette notion d'expansion. L'expansion, elle nous dit juste, bêtement entre guillemets, regardez, c'est un facteur multiplicatif tout simple. Et ça marche. C'est ça qui est assez fascinant. Parce que ça ne marcherait pas, on ne serait pas là pour en parler. J'espère que ça vous a clarifié les choses, même si c'était un peu formel, c'est que le début, de ce côté expansion et facteur d'échelle. Dans un univers, on était plus statique, on passait un peu en expansion, j'ai mis des flèches, des paf, crac, boum, i, etc. Donc on arrive dans un peu le dur. On peut même commencer à avoir une petite transition vers la relativité générale, mais on n'y est pas encore formellement. On va passer à la partie 2, qui est du facteur d'échelle, dont on vient de parler, aux observations. Voilà, deuxième partie. Le parti pris que j'ai pris ici, c'est d'être très simple, de ne pas tout démontrer, et d'avoir un lien avec les observations. On pourrait avoir une partie de ce cours de manière tout à fait théorique, à partir de la relativité générale, etc. J'ai des collègues qui le font très bien, et ça serait plus précis, plus rigoureux, mais j'ai pris un parti un peu plus simple. J'ai oublié de vous dire dans la fois d'avant que l'on peut appeler ça... Là je vous ai mis une forme très générale, mais quand ça prend une forme particulière, que je ne vais pas vous écrire là, parce qu'il y a des fonctions qui sont très intéressantes, c'est que l'on peut appeler ça la forme de la résolution. Là je vous ai mis une forme très générale, mais quand ça prend une forme particulière, que je ne vais pas vous écrire là, parce qu'il y a des fonctions mathématiques un peu partout, on a la métrique qu'on va utiliser, qui s'appelle la métrique de Robertson-Walker. Rw comme petit nom. La métrique de Robertson-Walker, parce que ces deux personnes ont indépendamment trouvé cette métrique, qu'elle correspondait bien aux problèmes posés d'un univers en expansion. Et donc quand on parlera de métrique Robertson-Walker, on s'intéresserait à une métrique de l'espace courbe avec une forme particulière, que je ne vais pas détailler là. Et puis j'en profite parce que je relis les notes. Nous en cosmologie, on sera intéressé à des événements qui sont non-simultanés dans le temps, dans l'espace. Enfin surtout dans le temps. Par exemple quand on regarde une galaxie lointaine, on voit la lumière qui s'est propagée depuis longtemps, donc en fait on voit une galaxie qui est non seulement loin de nous d'un point de vue distance, mais aussi en temps, parce qu'on la voit telle qu'elle était dans le passé. Donc en cosmologie, on sera surtout intéressé à des événements non-simultanés. Donc loin et dans le passé, pour ce qu'on observe, des galaxies, le fond cosmologique, que sais-je, et puis nous on est là aujourd'hui. Donc c'est pour ça que le temps est imbriqué à l'espace, en tout cas pour la métrique. C'est pour ça que c'est important et que ça joue. Il y a deux termes, il y a un terme de temps et un terme d'espace, c'est important. Il n'y a pas un qui domine sur l'autre. Alors, distance propre, qu'est-ce que j'ai mis comme distance propre ? La distance propre, c'est la distance spatiale qui sépare deux événements simultanés. Donc vous faites l'hypothèse qu'ils se produisent au même moment, puis vous prenez la distance. Donc en fait, ça annule la partie temporelle. Bon, on ne va pas l'utiliser, mais c'est pour fixer les idées, parce qu'en fait, on pense souvent à ça. On a ce qu'on appelle aussi la distance commobile. Commobile, ça veut dire qui bouge avec quelque chose qui bouge, en l'occurrence peut-être l'expansion de l'univers. Alors, j'aurais dû vous retrouver un dessin, je vais le faire, je vais retrouver le dessin, puis je vais vous le mettre. Mais on va faire un petit peu de démonstration. Je vais vous le mettre, mais je vais vous le faire ici en direct. Si je me mets un temps qui s'appelle T1, je vais mettre à deux dimensions, sinon je ne vais pas y arriver. Enfin, je pourrais, mais ça serait illisible. Je vais mettre une galaxie A et une galaxie B. Pourquoi je parle de galaxie ? Parce que vous voyez que cette métrique-là, peut-être que je vais l'appeler l'équation 1, cette métrique, elle concerne vraiment l'espace-temps de l'univers, en fait à grande échelle. Ça ne nous concerne pas, nous, humains ou terriens. Je ne vais pas avoir mon ventre qui gonfle à cause de ce facteur d'échelle. Si mon ventre gonfle, c'est plutôt parce que j'aurais pris trop de pains au chocolat ou de croissant le matin au petit-déj, mais pas par l'expansion de l'univers. Donc il y a d'autres forces physiques qui dominent. La gravité, les forces électromagnétiques, les forces nucléaires fortes et faibles, donc là, il n'y a pas de soucis. L'expansion ici, le facteur d'échelle, joue très très peu. Pareil, la distance Terre-Lune n'est absolument pas affectée par cette expansion de l'univers. Il se trouve que la distance Terre-Lune augmente un petit peu, mais c'est dû aux effets de marée, aux conditions énergétiques, etc. Pareil, dans une galaxie, ou même dans un amas de galaxies, l'expansion de l'univers joue très très peu. Par contre, c'est vraiment entre galaxies très lointaines qui n'ont pas de causalité ou de force entre elles, là, cet aspect d'espace-temps va jouer dans les événements. On pourrait détailler un peu plus. Donc là, je considère deux galaxies très lointaines, qui sont déjà très lointaines, et qui s'attirent très très très peu, par rapport à, je ne sais pas, si il y a une galaxie C ici, les deux B et C s'attireront, il n'y a aucun souci. Elles s'attireront, et un peu comme la Voie lactée avec la galaxie d'Andromède, ça s'attire, et ce n'est absolument pas contradictoire avec l'expansion de l'univers. Ce qui est un peu compliqué en physique, c'est qu'il y a des domaines d'application. Donc, voilà, un univers en expansion. Donc, AT1, je suis comme ça, mais imaginons qu'AT2, je sois... Alors, je fais un autre dessin. Mon espace-temps se soit dilaté. Donc A sera là, et B sera là, et puis C sera peut-être plus rapproché, parce qu'entre-temps, il aurait été attiré par la gravité. Mais on voit que la distance entre les deux a augmenté, même si eux, ils n'ont rien fait. A est resté tranquille dans sa coordonnée. C'est juste le système de coordonnées, donc la métrique, donc l'espace-temps, qui s'est dilaté. Donc, ils n'ont rien demandé, mais en ce moment, ils ont fait un petit détail. C'est juste le système de coordonnées qui s'est dilaté. Donc, ils n'ont rien demandé, mais entre A et B, la distance a augmenté. Et donc, on fait intervenir la distance co-mobile. Il faut d'abord choisir une référence temporelle. On dit que c'est T égale aujourd'hui. On appelle ça T0. Donc, on dit, aujourd'hui, par exemple, les coordonnées de A et B sont celles-ci. Et puis, on définit un système qui, finalement, est attaché aux coordonnées de l'espace-temps, ce qui nous évite de prendre en compte l'expansion de l'univers. Je vais vous détailler ça. Je vais calculer la distance entre A et B. Je considère qu'il y a une distance r1 entre les deux, et puis que A émet un photon vers B. Je dis que la distance d1, on va dire que c'est aujourd'hui, même si je l'ai appelé 0, que c'est le facteur d'échelle correspondant au temps d'aujourd'hui, fois la distance r1, je vais la dessiner avec la tête en noir. La distance d1, c'est r1 fois le facteur d'échelle d'aujourd'hui, qui vaut, par exemple, 1. Vu qu'on est aujourd'hui, il n'y a pas de souci. Par contre, si je regarde à un autre instant, l'instant T2, j'aurais la distance d2, qui serait le facteur d'échelle à un instant ultérieur, mais toujours r1, puisque c'est un facteur multiplicatif. Le r1 restera le même, mais ce qu'il y a entre les deux, c'est le taux d'expansion, qui est le facteur A. On préfère exprimer les distances entre objets dans l'univers D de T, comme étant le facteur d'échelle à l'instant T, fois la distance aujourd'hui, divisé par le facteur d'échelle aujourd'hui. Donc ça, c'est la distance à un instant T quelconque. Et puis, je vais le mettre en rouge, ça c'est D aujourd'hui. Ça c'est le facteur d'échelle aujourd'hui. Étant pris comme zéro. Et donc, c'est beaucoup plus pratique de parler de distances comobiles, qui ne prennent pas en compte ce côté expansion de l'univers, qui est quand même plus gênant. J'espère que je suis clair, parce que... Je relis mes choses. On aurait pareil avec les volumes, on met au cube. Tout peut se déduire grâce au facteur d'échelle dont on avait parlé tout à l'heure. On est muni de ces distances comobiles. On va passer au redshift. Il paraît qu'il y a le décalage cosmologique vers le rouge, dû à l'expansion de l'univers, vu que c'est rouge. Je simplifie. Il y a plusieurs définitions. Je vous la fais courte, on pourrait lier ça de manière beaucoup plus fondamentale avec la théorie, etc. La restreinte c'est jouable, mais on est dans un univers en expansion, toujours, et toujours homogène, on est toujours bon avec nos petites cartes. Il y a plusieurs définitions. La première, qui est vraiment observationnelle, le redshift, on l'appelle communément z, petit z. Petit z, parce que grand z c'est la métallicité. Je le note. Petit z, c'est égal parfois à la longueur d'onde reçue au sol, sur Terre, par par exemple une galaxie très lointaine qui s'éloigne, par rapport à elle, la longueur d'onde qu'elle a émise. Parce que les deux longueurs d'ondes ne sont pas les mêmes à cause de ce fameux facteur d'expansion. Ce n'est pas vraiment celle-là qu'on va utiliser, mais on peut montrer, je vous le sors du chapeau, que 1 plus z c'est égal au facteur d'échelle aujourd'hui, sur le facteur d'échelle à l'instant t correspondant au redshift considéré. Parce que le redshift c'est dans le passé. Aujourd'hui on est aujourd'hui, et puis l'univers passé, il est passé. C'est ça qui va être intéressant de garder en mémoire, c'est que 1 plus le redshift, qui est une quantité mesurable, c'est le rapport des facteurs d'échelle. On voit que le redshift est sans dimension, et on voit que le redshift intègre la notion de facteur d'échelle, donc il est directement lié à l'époque cosmique et au taux d'expansion de l'univers. Alors on peut voir que... Je m'en remets un peu, mais c'est pas grave. On peut montrer, on va faire plus simple, que finalement A2t est croissante. Avec le temps. Si A2t est croissante, ça veut dire que l'univers est en expansion. Super important. Donc le facteur d'échelle, il augmente. A2t augmente. Et pour revenir à l'équation 1 de tout à l'heure, le A2t c'est juste le facteur que l'on applique devant la partie spatiale de la métrique, de la distance entre deux événements. Rien de plus. C'est hyper profond évidemment, mais il n'y a pas de notion d'extérieur, d'univers. Je parle juste de distance et d'événements. Et donc ça c'est assez lumineux j'espère. Et donc on va pouvoir parler du paramètre de Hubble, qui a aussi une définition. Je vous balance pour pouvoir démontrer des choses. Mais on peut dire que le paramètre de Hubble c'est A0.0 sur A0. Alors si vous n'êtes pas trop fort en maths, c'est pas grave, vous n'êtes pas obligé de comprendre cette partie là. Mais en gros A0.0 c'est la dérivée temporelle de A sur la dérivée de A. Donc on peut réécrire ici 1 sur A0. A0 c'est le paramètre de Hubble, 0 c'est aujourd'hui. Mais la constante de Hubble, qui n'est pas une constante, est définie à n'importe quel instant. Si je mettais un t ici, je serais en train de mettre un t aux autres. Donc A0 c'est aujourd'hui. Donc 1 sur A0, D de A0 sur Dt. Si vous connaissez l'expression de la dérivée temporelle de A, c'est comme ça que ça s'écrit. Voilà la définition du paramètre de Hubble. On voit que la constante de Hubble est directement reliée à la vitesse d'expansion renormalisée par le facteur d'échelle aujourd'hui. On peut se convaincre que ça c'est homogène à un temps moins 1. Parce que la dérivée temporelle, il y a 1 sur t qui arrive. Donc c'est homogène à 1 sur temps moins 1. Et on l'exprime en général en astrophysique, non pas en secondes moins 1, encore moins verte, mais en kilomètres par seconde par mégaparsec. Donc c'est bien 1 temps moins 1 ici. Mais ça c'est pour des raisons pratiques, parce que les mesures sont plus pratiques dans cette unité-là. J'espère que pour ces deux premières parties, vous avez tous les éléments. Je remets le petit plan qui me sert de guide aussi. On a parlé de maîtrise de l'espace-temps, qui est un concept mathématique, mais vous voyez à quoi ça sert, parce qu'on a introduit le facteur d'échelle. Et puis ce facteur d'échelle nous permet de parler de distance propre et commobile, bon là j'espère que je ne vous ai pas trop embrouillé, mais surtout de décalage vers le rouge, et puis de paramètres de Hubble et de lien avec le A de t, dont on voit qu'il y a une fonction croissante avec le temps. On a tous les éléments en main pour pouvoir parler maintenant de dynamique de l'univers et puis du modèle Friedman-Robertson-Walker, qui mélange la partie Robinson-Walker de la métrique avec la partie physique de la relation des équations de Friedman, qui est une solution des équations d'Einstein, qui permet de rendre compte de la dynamique physique de l'expansion de l'univers. Partie 3 Indigestion Alors vous savez quoi, je me rends compte que ça prend pas mal de temps, ce qui est chouette, mais j'ai peur que vous soyez un petit peu... non pas sous l'eau, mais qu'il y ait une petite indigestion, donc je propose de parler de la partie 3 et 4 la semaine prochaine. Je vais l'enregistrer, mais j'ai peur que ça fasse trop pour une seule séance. Je vais résumer ce qu'on a vu aujourd'hui. Désolé, j'improvise un peu, je vous le disais, c'est les conditions du direct. Pour parler d'expansion de l'univers, on a parlé de métrique et de facteur d'échelle, pour arriver jusqu'au paramètre de Hubble. J'espère que ça sera à peu près clair, avec une équation mètre qui est la fameuse équation 1, que j'aime bien remettre, qui est la distance séparant deux événements, distance au sens large, parce que ça mélange le temps et l'espace, mais avec ce facteur d'échelle qui est donc très important, qui maintenant utilise la notion d'univers en expansion, de relativité restreinte pour l'instant, donc la physique classique, on la met dessous, et on a fait l'hypothèse d'un univers homogène et isotrope. Et puis les cartes que je garde pour la prochaine fois, c'est cartes relativité générale et univers statique. Il nous restera à sortir la carte majeure, qui est relat G, mais on garde ça pour la semaine prochaine. J'espère que ça n'a pas été trop difficile. Je me suis bien amusé, même si je redécouvrais certaines de mes notes. J'ai mon excuse, mais c'est la vie. Avant la bonne continuation, on va parler des livres. Allons-y pour la séquence livre. Pour la séquence livre, il y a des références que j'aime beaucoup. Je vais vous présenter les principales qui servent à faire ce que j'ai évoqué à l'instant. La Bible de la cosmologie de Jim Peebles, dont je vous rappelle qu'il a pris Nobel de physique l'année dernière, 2019. Principles of Physical Cosmology, chez Princeton. Il y a un peu tout là-dedans. J'ai toutes mes notes, etc. C'est niveau avancé, fin de licence. Il y a un livre d'introduction que j'aime beaucoup, le Réunement cosmologique, de Marc Lachaiseret. J'ai une édition un peu ancienne, mais je pense que ce livre a été réédité. J'ai tout un tas de marque-pages, parce qu'il y a plein de choses sympathiques. Le livre que je pourrais conseiller à tous les étudiants, éventuellement lycéens, mais en tout cas étudiants, qui sont intéressés par la astrophysique, c'est Astrophysical Concepts de Martin Harwit, avec Grande Classe. Vous ne le voyez peut-être pas, mais j'ai la dédicace de mon ami Martin Harwit, qui est un très grand scientifique, qui est quelqu'un absolument d'épatante, extraordinaire, d'une humilité. Mes rencontres avec lui me restent gravées dans ma petite mémoire. Il y a aussi plein de notes. L'avantage de Astrophysical Concepts, ça ne parle pas que de cosmologie, ça parle vraiment de physique simple, de tout l'univers, donc des étoiles, des planètes, etc. Il parle même, je crois, d'exobiologie. Est-ce que c'est dans cette édition ? Life in the Universe, oui c'est ça. Il parle de la thermodynamique. C'est en anglais, je ne pense pas que c'était traduible, mais bon, je pense qu'on peut y arriver. Et donc, il parle de cosmologie, de gaz, d'étoiles, de comment tout se forme. C'est vraiment une référence absolument incontournable pour ceux qui veulent comprendre un peu la physique de l'univers. Donc là, j'ai volontairement un petit peu monté le niveau pour une conférence de grand public, puisque finalement, cette dernière partie n'était pas de très grand public, mais elle était à destination en particulier de mes étudiants de l1, que j'ai croisés récemment et pour lesquels je n'ai pas pu finir tous mes cours. Donc voilà, c'est un peu dédié à eux. J'espère que ça leur plaira. Et puis rendez-vous à la semaine prochaine pour parler de la fin de cette belle séance de cosmologie, partie 3 et 4, et puis du JWST, parce que je vais vous parler quand même de ce qui m'a occupé, moi et de nombreux autres collègues astrophysiciens de par le monde ces derniers temps. Donc le télescope spatial JWST de la NASA, de l'Agence spatiale européenne et de l'Agence canadienne. Portez-vous bien, bonne continuation, et à mercredi prochain pour une autre conférence confinée, même si le confinement commence à être un petit peu plus flou, mais écoutez, c'est pas grave. J'ai envie de continuer, donc ça ne durera peut-être pas éternellement, mais profitons-en. Bonne après-midi et bonne continuation. Ciao, ciao."
}