{
    "original_file_name": "europe.mp4",
    "language": "fr",
    "sentences": [
        {
            "start": 0,
            "end": 13,
            "text": "Mon sujet, vous l'avez vu sur les affiches, l'Europe en crise, renouveau ou décadence ?"
        },
        {
            "start": 13,
            "end": 15,
            "text": "Je vais vous parler de l'Europe."
        },
        {
            "start": 15,
            "end": 21,
            "text": "Depuis quelques temps, les actualités, la presse, l'Europe est en crise."
        },
        {
            "start": 21,
            "end": 25,
            "text": "Je vous propose un plan assez simple."
        },
        {
            "start": 25,
            "end": 27,
            "text": "D'abord, comment penser l'histoire ?"
        },
        {
            "start": 27,
            "end": 33,
            "text": "Je pense que vos souvenirs d'histoire sont assez lointains, en terminale, en histoire-géographie."
        },
        {
            "start": 33,
            "end": 35,
            "text": "Peut-être que vous avez des clichés sur l'histoire."
        },
        {
            "start": 35,
            "end": 39,
            "text": "Je vais essayer de combattre quelques clichés."
        },
        {
            "start": 39,
            "end": 48,
            "text": "Ensuite, on rentre dans le vif du sujet avec l'identité européenne, l'idée européenne, la crise ou les crises en Europe."
        },
        {
            "start": 48,
            "end": 52,
            "text": "Le rôle de la crise, mon sujet de recherche, c'est un prétexte."
        },
        {
            "start": 52,
            "end": 56,
            "text": "Je travaille sur l'Europe, mais c'est un prisme, un angle spécifique."
        },
        {
            "start": 56,
            "end": 59,
            "text": "C'est un prétexte pour évoquer le concept de crise."
        },
        {
            "start": 59,
            "end": 61,
            "text": "Est-ce qu'on va vers la décadence ?"
        },
        {
            "start": 61,
            "end": 65,
            "text": "Et après, décadence contre vitalité historique."
        },
        {
            "start": 65,
            "end": 69,
            "text": "En introduction, quelques notions de méthodologie historique."
        },
        {
            "start": 69,
            "end": 72,
            "text": "Je le crie haut et fort, même de façon très vulgaire."
        },
        {
            "start": 72,
            "end": 74,
            "text": "On n'en a rien à faire des dates."
        },
        {
            "start": 74,
            "end": 80,
            "text": "Vous avez dû apprendre en histoire des dates, Marignan, prise de la Bastille, et du reste."
        },
        {
            "start": 80,
            "end": 82,
            "text": "Prenons un exemple."
        },
        {
            "start": 82,
            "end": 85,
            "text": "Tout le monde connaît la date de la Révolution française, la date symbolique."
        },
        {
            "start": 85,
            "end": 87,
            "text": "Le 14 juillet 89."
        },
        {
            "start": 87,
            "end": 90,
            "text": "Ça, jusque-là, tout le monde connaît à peu près."
        },
        {
            "start": 90,
            "end": 93,
            "text": "On va sur Wikipédia, on la connaît de tête."
        },
        {
            "start": 93,
            "end": 95,
            "text": "Qu'est-ce qui s'est passé le 14 juillet 89 ?"
        },
        {
            "start": 95,
            "end": 98,
            "text": "Quand je fais mon séminaire en 3ème année, c'est un petit jeu."
        },
        {
            "start": 98,
            "end": 101,
            "text": "Là, on n'a pas le temps de le faire, mais on sait qu'il s'est passé la prise de la Bastille."
        },
        {
            "start": 101,
            "end": 104,
            "text": "Ça, jusque-là, logiquement, je ne vous ai pas perdu."
        },
        {
            "start": 104,
            "end": 112,
            "text": "On sait qu'on est allé rechercher de la poudre, et non 7 pauvres prisonniers qui se battaient en duel 3 fous, 4 prisonniers."
        },
        {
            "start": 112,
            "end": 117,
            "text": "Le Marquis de Sade a été sorti de la Bastille quelques jours avant."
        },
        {
            "start": 117,
            "end": 119,
            "text": "Donc ça, c'est les faits."
        },
        {
            "start": 119,
            "end": 125,
            "text": "Mais ça ne nous explique pas toujours pourquoi le 14 juillet, et pourquoi c'est une date symbolique importante."
        },
        {
            "start": 125,
            "end": 131,
            "text": "En fait, dans la continuité du temps, il y a eu le renvoi de Necker le 11 juillet."
        },
        {
            "start": 131,
            "end": 138,
            "text": "Sans rentrer dans le détail, Necker, ministre des Finances, qui était aimé du peuple, on le renvoie quelques temps avant."
        },
        {
            "start": 138,
            "end": 140,
            "text": "Donc le peuple de Paris est un peu inquiet."
        },
        {
            "start": 140,
            "end": 142,
            "text": "Il y a des troupes aux abords de Paris."
        },
        {
            "start": 142,
            "end": 145,
            "text": "Ce sont des troupes mercenaires, des troupes étrangères."
        },
        {
            "start": 145,
            "end": 147,
            "text": "Donc là, le peuple de Paris commence un peu à s'inquiéter."
        },
        {
            "start": 147,
            "end": 150,
            "text": "Et bien sûr, vous avez entendu parler peut-être des États généraux."
        },
        {
            "start": 150,
            "end": 154,
            "text": "Depuis quelques mois, il y a les grands États généraux qui sont lancés en France."
        },
        {
            "start": 154,
            "end": 165,
            "text": "Mais en fait, un an après, le 14 juillet 90, il y a une fête de la Fédération, où Louis XVI prête serment à l'État et à la Nation."
        },
        {
            "start": 165,
            "end": 167,
            "text": "Et c'est la fête de la Fédération."
        },
        {
            "start": 167,
            "end": 175,
            "text": "Ça signifie qu'en fait, le 14 juillet, en tant que tel, ce n'est pas du tout le symbole du 14 juillet 89."
        },
        {
            "start": 175,
            "end": 191,
            "text": "Pendant un siècle, j'ai trouvé ça sur Internet, jusqu'au 6 juillet 80, on fête non pas la prise de la Bastille, mais on commémore la fête de la Fédération de 1790."
        },
        {
            "start": 191,
            "end": 199,
            "text": "Et en 1890, sur proposition d'un député, on décide que cette date devient symbole de la France, c'est jour national."
        },
        {
            "start": 199,
            "end": 211,
            "text": "Mais en fait, l'année n'est pas marquée, pour faire plaisir à la fois aux républicains qui voulaient accentuer le 14 juillet 89 et aux conservateurs qui voulaient plutôt fêter le 14 juillet 90."
        },
        {
            "start": 211,
            "end": 217,
            "text": "Tout ça pour vous dire que je suis parti d'une date, et en fait, ça aurait pu être le 13, le 15, le 12, on n'en a un peu rien à faire."
        },
        {
            "start": 217,
            "end": 223,
            "text": "L'histoire, c'est essayer de voir tout ce qu'il y a autour, essayer de comprendre tout ce qui s'est passé."
        },
        {
            "start": 223,
            "end": 226,
            "text": "Alors, deuxième cliché, on n'invente rien."
        },
        {
            "start": 226,
            "end": 240,
            "text": "Je vous lis un texte « Notre forme d'existence actuelle résulte principalement de l'inversion excessive de chaque minute écoulée, et de la domination, chose qui, sans aucun doute, détruise de manière radicale toute joie de vivre."
        },
        {
            "start": 240,
            "end": 251,
            "text": "Nous obéissons à la devise qui commande de faire le maximum de choses en un minimum de temps » Ma copine, qui appelle ça mon doudou, elle en est totalement consciente."
        },
        {
            "start": 251,
            "end": 259,
            "text": "On a l'impression que cette phrase, elle a été écrite de nos jours, on est tous sur nos portables, on est en train de tweeter en direct, on fait des réunions, voilà."
        },
        {
            "start": 259,
            "end": 262,
            "text": "Ça a été écrit en 1899 par Emma Ness, l'art de l'oisiveté."
        },
        {
            "start": 262,
            "end": 269,
            "text": "Tout ça pour vous montrer qu'en histoire, on prend aussi un peu de recul, et on se rend compte qu'on n'invente rien."
        },
        {
            "start": 269,
            "end": 272,
            "text": "Troisième notion, penser l'incertain."
        },
        {
            "start": 272,
            "end": 278,
            "text": "Je sais qu'ici c'est important parce qu'on travaille sur la complexité, et aussi sur penser l'incertain."
        },
        {
            "start": 278,
            "end": 282,
            "text": "En histoire, on réfléchit en tout cas aussi à ce qui est arrivé sur le non-advenu."
        },
        {
            "start": 282,
            "end": 296,
            "text": "Je vous l'affiche et je vous lis juste quelques paragraphes « Le gouvernement du Royaume-Uni et de la République française se déclarent indissolublement unis et inébranlablement résolus à défendre en commun la justice et la liberté."
        },
        {
            "start": 296,
            "end": 301,
            "text": "Les deux gouvernements ne font plus qu'un, les deux nations ne font plus qu'une seule Union franco-britannique."
        },
        {
            "start": 301,
            "end": 310,
            "text": "Tous citoyens français, je vous lirai mieux de même en suite, et réciproquement » Je suis en train de vous lire un texte où on propose la fusion."
        },
        {
            "start": 310,
            "end": 316,
            "text": "Il y a une fusion centrale-superlégue, mais non, là c'est la fusion de la France et de la Grande-Bretagne."
        },
        {
            "start": 316,
            "end": 331,
            "text": "Ce texte a été présenté par De Gaulle au téléphone à Paul Reynaud, président du Conseil des ministres, la veille du 5 juin 1940, ou même le 16 juin 1940 au matin, lorsqu'il allait après démissionner pour laisser la place à Pétain."
        },
        {
            "start": 331,
            "end": 337,
            "text": "Pour vous montrer aussi que l'histoire c'est aussi de réfléchir ce qui n'est pas arrivé, et aussi l'incertain."
        },
        {
            "start": 337,
            "end": 340,
            "text": "Alors quatrième notion, le temps long."
        },
        {
            "start": 340,
            "end": 349,
            "text": "Je vous présente une carte qui peut-être ne parle pas aux plus jeunes d'entre nous, parce que malheureusement maintenant je dois faire la séparation, c'est moi je suis moins jeune."
        },
        {
            "start": 349,
            "end": 351,
            "text": "Ça moi je l'ai appris en cours, en troisième, en quatrième."
        },
        {
            "start": 351,
            "end": 361,
            "text": "Ça c'est la carte en 1988, où vous voyez les missiles russes, les SS-20, et les Pershing II américains."
        },
        {
            "start": 361,
            "end": 363,
            "text": "Ça c'est la carte en 1988."
        },
        {
            "start": 363,
            "end": 370,
            "text": "On est d'accord que c'était il y a 20 ans 20 ans dans l'histoire, c'est même pas une respiration, c'est rien."
        },
        {
            "start": 370,
            "end": 373,
            "text": "Donc on se rend compte aussi qu'on réfléchit sur le temps long."
        },
        {
            "start": 373,
            "end": 378,
            "text": "Il y a 20 ans, c'était les missiles qui étaient sur le sol européen."
        },
        {
            "start": 378,
            "end": 380,
            "text": "Cinquième notion, des césures."
        },
        {
            "start": 380,
            "end": 384,
            "text": "Il y a des césures en histoire, même si la césure le fait, historique ne fait pas tout."
        },
        {
            "start": 384,
            "end": 387,
            "text": "Il y a des césures qu'on peut prendre en tout cas comme date symbolique."
        },
        {
            "start": 387,
            "end": 390,
            "text": "J'ai voulu prendre une césure qui ne concerne pas l'histoire de l'Europe."
        },
        {
            "start": 390,
            "end": 394,
            "text": "Je ne sais pas si tout le monde voit, c'est la bataille d'Axiom."
        },
        {
            "start": 394,
            "end": 404,
            "text": "En 31, avant Jésus-Christ, César vient de se faire assassiner."
        },
        {
            "start": 404,
            "end": 408,
            "text": "Il y a Marc-Antoine d'un côté et Octave de l'autre."
        },
        {
            "start": 408,
            "end": 413,
            "text": "Octave va voir en Égypte, il va être gouverneur de l'Égypte."
        },
        {
            "start": 413,
            "end": 415,
            "text": "L'inconvénient, c'est qu'il est avec Cléopâtre."
        },
        {
            "start": 415,
            "end": 421,
            "text": "Et il y a une guerre entre d'un côté, Marc-Antoine et Cléopâtre, et de l'autre, Octave."
        },
        {
            "start": 421,
            "end": 429,
            "text": "Sur cette guerre, à cause du vent ou du général Agrippa, qui fut un très illustre général du côté d'Octave, la guerre a tourné."
        },
        {
            "start": 429,
            "end": 435,
            "text": "Ce n'est pas cette guerre qui a fait que Rome a gagné contre l'Égypte, mais ça a été une césure importante."
        },
        {
            "start": 435,
            "end": 438,
            "text": "C'est aussi pour vous montrer que parfois, il y a vraiment des césures."
        },
        {
            "start": 438,
            "end": 441,
            "text": "Et l'histoire, nous, on est là pour chercher des césures."
        },
        {
            "start": 441,
            "end": 445,
            "text": "Sixième et avant-dernière notion, attention à l'interprétation."
        },
        {
            "start": 445,
            "end": 452,
            "text": "Je vous lis les paroles de la Marseillaise très connues « Aux armes, citoyens, formez vos bataillons, marchons, marchons, quand sang impur abreuve nos sillons."
        },
        {
            "start": 452,
            "end": 462,
            "text": "» Vous avez tous entendu, dis donc, quel chant guerrier, le sang impur des autres « Qu'est-ce que c'est un chant criminel contre l'adversaire ?"
        },
        {
            "start": 462,
            "end": 474,
            "text": "» Pas du tout « Quand sang impur abreuve nos sillons », c'est les gens qui sont en train de chanter ça, qui demandent que leur sang, qui est impur puisqu'il n'est pas noble, abreuve les sillons de la terre, c'est-à-dire qu'ils nourrissent leur terre."
        },
        {
            "start": 474,
            "end": 478,
            "text": "Donc, ils demandent à ce que leur sang soit versé pour défendre la patrie."
        },
        {
            "start": 478,
            "end": 482,
            "text": "Voilà comment on peut interpréter ou mal interpréter aussi."
        },
        {
            "start": 482,
            "end": 486,
            "text": "Et l'histoire aussi est là pour essayer de clarifier les choses."
        },
        {
            "start": 486,
            "end": 497,
            "text": "Alors, cette petite introduction sur comment penser l'histoire, j'essaye de vous montrer qu'on problématise un événement, que l'histoire n'est pas linéaire et que ça ne donne pas à voir."
        },
        {
            "start": 497,
            "end": 499,
            "text": "Il faut aller la chercher."
        },
        {
            "start": 499,
            "end": 504,
            "text": "L'histoire s'intéresse au temps long, aux césures et aux ruptures, et à la discordance des temps."
        },
        {
            "start": 504,
            "end": 512,
            "text": "Alors, je pense que ça doit vous trotter dans la tête, mais est-ce que l'histoire, il nous parle, mais nous, on est des scientifiques, est-ce que l'histoire est une science ?"
        },
        {
            "start": 512,
            "end": 514,
            "text": "En tout cas, l'histoire est une démarche."
        },
        {
            "start": 514,
            "end": 517,
            "text": "Et sur cette démarche, on peut dire que c'est une démarche scientifique."
        },
        {
            "start": 517,
            "end": 519,
            "text": "On cherche à comprendre plutôt qu'à expliquer."
        },
        {
            "start": 519,
            "end": 524,
            "text": "On n'est pas dans la causalité, on est dans la compréhension, ce qui est très différent."
        },
        {
            "start": 524,
            "end": 529,
            "text": "Elle rend lisible et intelligible, elle donne à voir, ça c'est une démarche scientifique."
        },
        {
            "start": 529,
            "end": 537,
            "text": "Il n'y a pas de jugement normatif, l'historien doit s'extraire de sa subjectivité, mais naturellement il en est conscient et c'est justement aussi un atout."
        },
        {
            "start": 537,
            "end": 541,
            "text": "Et il n'y a pas de déterminisme historique, ni de relativisme historique à outrance."
        },
        {
            "start": 541,
            "end": 551,
            "text": "Le déterminisme, vous savez, c'est que l'histoire a un objectif donné, la fin du communisme, fin de l'histoire, le capitalisme, c'est la fin du train."
        },
        {
            "start": 551,
            "end": 555,
            "text": "L'histoire et l'actualité nous rendent compte que non."
        },
        {
            "start": 555,
            "end": 564,
            "text": "Et en fait, pour simplifier, une seule phrase à retenir de cette introduction, l'histoire parle au présent, on n'en a rien à faire de la révolution française."
        },
        {
            "start": 564,
            "end": 566,
            "text": "Enfin, on n'en a rien à faire."
        },
        {
            "start": 566,
            "end": 571,
            "text": "Toute l'histoire doit nous permettre de rendre compréhensible le présent."
        },
        {
            "start": 571,
            "end": 574,
            "text": "Alors maintenant, on rentre dans le vif du sujet."
        },
        {
            "start": 574,
            "end": 576,
            "text": "Donc, Laurent Pancriz, Renouveau aux décadences."
        },
        {
            "start": 576,
            "end": 578,
            "text": "Moi, ma thèse, c'est un combat."
        },
        {
            "start": 578,
            "end": 582,
            "text": "Je fais un combat entre décadence, contre vitalité historique."
        },
        {
            "start": 582,
            "end": 586,
            "text": "Et je vais vous montrer comment je navigue à travers ce combat."
        },
        {
            "start": 586,
            "end": 590,
            "text": "Alors, on rentre vraiment maintenant sur l'identité européenne."
        },
        {
            "start": 590,
            "end": 595,
            "text": "Là aussi, je ne vais pas faire d'interaction, mais il y a quatre symboles officiels de l'Europe."
        },
        {
            "start": 595,
            "end": 598,
            "text": "Logiquement, on est tous à peu près capables de dire le drapeau européen."
        },
        {
            "start": 598,
            "end": 603,
            "text": "On est tous à peu près capables de dire l'hymne européen, la neuvième de Beethoven."
        },
        {
            "start": 603,
            "end": 609,
            "text": "La journée de l'Europe, je ne fais pas un sondage, mais il y en a deux qui sont capables de donner la date de la journée de l'Europe."
        },
        {
            "start": 609,
            "end": 613,
            "text": "Voilà, le 9 mai 1950."
        },
        {
            "start": 613,
            "end": 626,
            "text": "Et si, mis à part mes collègues estimés, il y en a ici qui sont capables de nous sortir la devise de l'Europe, là aussi, je demande à voir, c'est donc, je suis allé trop vite, pardon, c'est unis dans la diversité."
        },
        {
            "start": 626,
            "end": 630,
            "text": "Donc, l'idée d'identité européenne, ce sont ces quatre symboles, en tout cas, officiels."
        },
        {
            "start": 630,
            "end": 637,
            "text": "Donc, au fur et à mesure de la prése, je fais à chaque fois des schémas, comme ça, je ne vais pas vous perdre."
        },
        {
            "start": 637,
            "end": 640,
            "text": "Donc, le premier point dans le schéma, l'Europe."
        },
        {
            "start": 640,
            "end": 643,
            "text": "Qu'est-ce que l'identité d'un groupe donné ?"
        },
        {
            "start": 643,
            "end": 665,
            "text": "Des valeurs, donc là, les valeurs européennes, démocratie, droit de l'homme, modal social européen, une mythologie commune, on va en parler après, parce que pour construire une identité, pour construire l'Europe, il faut bien des personnages et des lieux de mémoire, une mythologie, comme il peut y avoir à Centrale une mythologie avec ses fondateurs, par exemple, ou en tout cas, ses lieux, ou sa statue, ou ce que vous voulez."
        },
        {
            "start": 665,
            "end": 671,
            "text": "Une histoire commune, des succès économiques, ça c'est un fait, mais qui sont aujourd'hui mis à mal."
        },
        {
            "start": 671,
            "end": 682,
            "text": "Des réalisations, alors j'en parlerai aussi, mais on réalise, enfin, on n'oublie, pardon, trop vite que l'un des principaux apports de l'Union européenne, c'est quand même la paix entre la France et l'Allemagne."
        },
        {
            "start": 682,
            "end": 701,
            "text": "Je ne vous refais pas, il y a eu trois guerres, 70, 14, 40, en même pas un siècle, on ne parle pas des dizaines de millions de morts, et réconcilier la France et l'Allemagne, c'est peut-être le premier et le plus important, parce que maintenant, il est difficilement imaginable que la France et l'Allemagne se battent entre eux, mais ce n'était pas si évident en 1945."
        },
        {
            "start": 701,
            "end": 704,
            "text": "Et un projet d'avenir, je vais en parler."
        },
        {
            "start": 704,
            "end": 712,
            "text": "Et en fait, pour vous montrer que l'identité européenne, elle est en question, tout à l'heure, j'ai parlé de mythes et de mythologies, sur quoi on peut s'appuyer."
        },
        {
            "start": 712,
            "end": 721,
            "text": "Alors l'historien aussi, il s'appuie sur des sources, il s'appuie sur des œuvres, cette cantation n'est pas de moi, je compile plusieurs choses."
        },
        {
            "start": 721,
            "end": 763,
            "text": "Je vous lis rapidement, Mélie Barnavis, c'est un chercheur israélien, « Les cathédrales et les bûchers, l'universalisme et l'esclavage, les merveilles de l'art baroque et l'inquisition, la raison scientifique et la chasse aux sorcières, le progrès et la guerre totale, démocratie et bureaucratie, fraternité et goulag, Beethoven et Auschwitz », la répétition est voulue, c'est de lui, « Beethoven et Auschwitz, ainsi est l'Europe, la tête dans les étoiles et les pieds dans le sang » Si on part du principe que l'Europe a été construite, parce que je parle de l'Europe au niveau de son politique, on va dire en 1950, après la guerre, l'inconvénient c'est qu'elle s'est construite sur des milliers de morts, et sous forme de provocation, je vous demande quel est le meilleur lieu de mémoire commun en Europe qu'Auschwitz."
        },
        {
            "start": 763,
            "end": 768,
            "text": "Vous ne répondez pas Bruxelles, je serais embêté."
        },
        {
            "start": 768,
            "end": 778,
            "text": "Edgar Morin dit que jusqu'à présent, jamais ne s'est créé une conscience ou un sentiment à partir de futur, lorsqu'on unit deux personnes, c'est qu'au départ il y a une histoire commune."
        },
        {
            "start": 778,
            "end": 786,
            "text": "Oui, là il y a une histoire commune, mais il y a tellement de points négatifs, c'est qu'on est vraiment dans une identité paradoxale."
        },
        {
            "start": 786,
            "end": 802,
            "text": "Peut-être que le symbole européen le plus fort, mais qui est malheureusement un peu vieux, c'est celui-là, encore sur la paix européenne, donc c'est Helmut Kohl et François Mitterrand à Verdun en 1984 qui se prennent la main, ce n'était pas prévu au programme."
        },
        {
            "start": 802,
            "end": 810,
            "text": "C'est peut-être ça l'identité européenne, ou en tout cas le symbole européen, mais malheureusement il en faudrait d'autres, parce que ça commence un peu à vieillir."
        },
        {
            "start": 810,
            "end": 819,
            "text": "Donc on en est là de mon exposé, l'Europe, une identité en question, et des mythes et des symboles en question, en tout cas à renouveler."
        },
        {
            "start": 819,
            "end": 823,
            "text": "L'idée européenne, pourquoi est-ce qu'on a fait l'Europe, la construction européenne ?"
        },
        {
            "start": 823,
            "end": 828,
            "text": "Bien sûr c'est très schématique, naturellement je vais très vite et il y a beaucoup de choses d'autres à dire."
        },
        {
            "start": 828,
            "end": 832,
            "text": "Elle partait de plusieurs nécessités, je vous ai dit, France et l'Allemagne, je ne reviens pas."
        },
        {
            "start": 832,
            "end": 853,
            "text": "Elle partait sur une idée déjà très vieille qui était enrayer le déclin, c'est-à-dire que dès la fin de la première guerre mondiale, l'Europe perd sa place de super gendarme au profit en tout cas des États-Unis, il fallait enrayer un déclin économique, développer l'économie parce qu'au sortir de la guerre tout le monde est ruiné, donc il faut bien reconstruire, et transcender, devenir des peuples européens."
        },
        {
            "start": 853,
            "end": 860,
            "text": "Victor Hugo en a parlé dans un discours fameux en 1848, Benda en a parlé, même les résistances européennes en ont parlé."
        },
        {
            "start": 860,
            "end": 867,
            "text": "C'est intéressant lorsqu'on travaille sur des sources, parce que moi je travaille sur des sources, de découvrir dans des archives, vous vous travaillez sur des expériences, moi je travaille avec des cartons."
        },
        {
            "start": 867,
            "end": 871,
            "text": "C'est mon matériau, je vais en archive, il y a des cartons, et je dépouille."
        },
        {
            "start": 871,
            "end": 887,
            "text": "Et dans le meilleur des mondes possible, je trouve sur des pépites parfois, je ne suis pas tombé sur cette pépite-là parce qu'elle est assez connue, mais c'est que les résistances européennes, qu'elles soient roumaines, polonaises, anglaises, françaises, dès 1941-1942, appellent à une Europe unie, ce qui n'était pas aussi évident."
        },
        {
            "start": 887,
            "end": 892,
            "text": "Donc ça c'est l'idée européenne d'il y a quelques années, malheureusement ça ne suffit plus."
        },
        {
            "start": 892,
            "end": 902,
            "text": "L'idée est toujours plus belle que la réalisation, l'idée doit être entretenue, elle doit être vraiment surveillée, alimentée, sinon à la moindre crise elle peut être détruite."
        },
        {
            "start": 902,
            "end": 906,
            "text": "Et au fond maintenant, on ne sait plus trop pourquoi on fait l'Europe."
        },
        {
            "start": 906,
            "end": 916,
            "text": "Donc voilà où on en est, l'Europe, mythes et symboles, identités, une économie mise à mal, une transcendance un peu oubliée, et une paix effective, oui, mais il faut un peu plus que ça."
        },
        {
            "start": 916,
            "end": 922,
            "text": "Maintenant sur la crise de l'Europe, il y a X chiffres, il y a X faits, on ne va pas se les rappeler."
        },
        {
            "start": 922,
            "end": 928,
            "text": "Je vous montre trois schémas très rapides pour vous dire que la crise est effective, on pourrait nous demander mais est-ce qu'il y a une vraie crise ?"
        },
        {
            "start": 928,
            "end": 932,
            "text": "Oui, il y a une vraie crise économique, une vraie crise de confiance."
        },
        {
            "start": 932,
            "end": 948,
            "text": "L'Union Européenne fait un baromètre tous les deux fois par an, donc là vous voyez en bleu l'opinion positive sur l'Europe, en jaune l'opinion neutre, et en rouge l'opinion négative, donc là il y a une vraie crise de confiance."
        },
        {
            "start": 948,
            "end": 964,
            "text": "Alors je suis incompétent et totalement inintéressé par l'économie, mais je montre deux trois schémas, le taux d'intérêt des emprunts à 10 ans, vous voyez, crise des subprimes en haut à droite, mais après regardez la Grèce, le Portugal, il y a une vraie crise de l'économie."
        },
        {
            "start": 964,
            "end": 968,
            "text": "Je passe un peu vite parce que je trouve que ce n'est pas hyper intéressant."
        },
        {
            "start": 968,
            "end": 986,
            "text": "Taux de chômage en pourcentage, je ne vous le commande pas, en bleu 2007, en rouge 2011, vous voyez où on en est, Espagne, Lettonie, Grèce, Hollande, le chômage explose, et quoi qu'on en dise, le chômage est un indicateur d'une santé économique d'une nation, ou là en tout cas de l'Europe."
        },
        {
            "start": 986,
            "end": 987,
            "text": "Donc on en est là."
        },
        {
            "start": 987,
            "end": 989,
            "text": "L'Europe est effectivement en crise."
        },
        {
            "start": 989,
            "end": 997,
            "text": "Voilà, donc ça c'est la couverture d'un économiste d'il y a un an, est-ce qu'on peut faire quelque chose pour relever l'Europe ?"
        },
        {
            "start": 997,
            "end": 1005,
            "text": "La première chose que je veux vous montrer, c'est que la crise, ce n'est pas forcément négatif, et en tout cas ça fait partie d'une histoire."
        },
        {
            "start": 1005,
            "end": 1021,
            "text": "On peut parler de la crise du Real de Madrid, on peut parler de la crise d'un couple, on peut parler de la crise de ce que vous voulez, mais la crise fait toujours partie de la vie, c'est j'ose dire, et je vais vous montrer plusieurs exemples, notamment bien sûr sur l'Europe, que l'Europe s'est toujours servie des crises pour se relancer."
        },
        {
            "start": 1021,
            "end": 1026,
            "text": "Alors je vous montre plusieurs cycles, enfin plusieurs exemples, il y en a vraiment beaucoup plus."
        },
        {
            "start": 1026,
            "end": 1038,
            "text": "Donc là un peu d'apport théorique, mais pour vous, peu importe les dates, mais ce qu'il faut retenir c'est qu'il y a toujours eu une crise, une relance, une crise, une relance, et que justement la crise n'est pas forcément négative."
        },
        {
            "start": 1038,
            "end": 1051,
            "text": "Donc en 1945 les Europes sortent de la guerre ruinée, la France et la Grande-Bretagne sont incapables de s'entendre sur ce qu'ils veulent mettre dans l'Europe, donc il y a une première crise dès 1947 sur qu'est-ce qu'on veut mettre dans l'Europe."
        },
        {
            "start": 1051,
            "end": 1063,
            "text": "Première relance, la stratégie des petits pas, en fait la France se tourne vers l'Allemagne, son ancien ennemi juré, et le 9 mai donc 50, déclaration Schuman, qu'est-ce que c'est en gros ?"
        },
        {
            "start": 1063,
            "end": 1069,
            "text": "C'est qu'on propose à certains pays, tous les pays européens qui veulent, de mettre en commun le charbon et l'acier."
        },
        {
            "start": 1069,
            "end": 1073,
            "text": "Économique, européenne, pardon, le charbon et l'acier."
        },
        {
            "start": 1073,
            "end": 1074,
            "text": "Pourquoi le charbon et l'acier ?"
        },
        {
            "start": 1074,
            "end": 1079,
            "text": "Parce que ce sont les deux matériaux avec lesquels on fabrique les armes et les munitions, entre autres."
        },
        {
            "start": 1079,
            "end": 1091,
            "text": "Donc voilà de l'échec du couple franco-britannique, l'est le couple franco-allemand, donc une relance, mais un nouvel échec, quelques années après on se dit que si l'économie a marché, on va faire pareil sur la défense."
        },
        {
            "start": 1091,
            "end": 1104,
            "text": "La stratégie des petits pas c'est une stratégie fonctionnaliste, les pères de l'Europe se disaient on commence à faire petit, et comme une boule de neige on va en venir à une vraie Europe politique, ce qui était leur vision, leur objectif premier."
        },
        {
            "start": 1104,
            "end": 1116,
            "text": "En CED, l'Assemblée nationale française rejette la CED, c'est la catastrophe, on pense que l'Europe va s'arrêter, et en tout cas les fédéralistes savent qu'ils ont raté le coche."
        },
        {
            "start": 1116,
            "end": 1126,
            "text": "Mais dès 55 on relance, on se dit bon la défense ça n'a pas marché, on va continuer sur ce qui a marché, c'est-à-dire l'économie, donc on étend le charbon et l'acier au marché commun."
        },
        {
            "start": 1126,
            "end": 1144,
            "text": "Et là aussi c'est parti, ça remarche, jusqu'à ce que De Gaulle bloque plusieurs fois l'adhésion britannique, puisqu'elle a fait une demande d'adhésion par deux fois, et De Gaulle par deux fois l'a refusée, donc là dans les années 60, l'Europe est vraiment en crise au niveau politique."
        },
        {
            "start": 1144,
            "end": 1158,
            "text": "Une relance, suite aussi bien sûr au départ de De Gaulle, qui démissionne quelques mois avant, le sommet de la haie qui est la relance, et un an ou deux ans après, la Grande-Bretagne reviendra en Europe."
        },
        {
            "start": 1158,
            "end": 1176,
            "text": "Donc pour vous montrer en premier que les crises européennes sont inhérentes à la construction, ce n'est pas forcément négatif, l'historien permet de prendre du recul, de relativiser, et de rendre intelligibles les choses, les crises européennes ont toujours fait partie."
        },
        {
            "start": 1176,
            "end": 1182,
            "text": "En revanche là en 2014 il y a une crise, mais le problème c'est qu'on n'arrive pas à aller au-delà de ça."
        },
        {
            "start": 1182,
            "end": 1205,
            "text": "Une chose dans ma recherche qui prend vraiment beaucoup de temps, et là j'ai failli enlever ce slide parce qu'il mérite de passer du temps, c'est sur le rôle de la crise en tant que telle, donc là c'est un peu plus de la science politique on va dire, c'est un texte de Paul Ricoeur très important écrit en 1986, on s'interroge sur les concepts de la crise, qu'est-ce que ça veut dire en fait crise ?"
        },
        {
            "start": 1205,
            "end": 1207,
            "text": "L'historien est aussi là pour ça, pour réfléchir sur les mots."
        },
        {
            "start": 1207,
            "end": 1216,
            "text": "Le premier sens de la crise c'est l'origine médicale, c'est-à-dire qu'il y a une crise de foi, vraiment ça, et c'est le moment décisif où se décide l'issue, en bien ou en mal."
        },
        {
            "start": 1216,
            "end": 1222,
            "text": "Donc c'est un peu vraiment l'apogée du moment, et après derrière on va aller vers autre chose."
        },
        {
            "start": 1222,
            "end": 1235,
            "text": "C'est un état de malaise profond, la crise d'ado, je pense que ça c'est assez clair, c'est un tournant dur à négocier, mais on n'est pas nécessairement en train de parler de destruction, on parle aussi de source de création."
        },
        {
            "start": 1235,
            "end": 1241,
            "text": "La crise est transitoire, et ça c'est très important, la crise est transitoire car elle précède un changement."
        },
        {
            "start": 1241,
            "end": 1252,
            "text": "C'est comme la banalité, après la pluie, le beau temps, logiquement après toute crise il doit y avoir quelque chose, un changement qui n'est pas fait forcément bénéfique, mais en tout cas un changement."
        },
        {
            "start": 1252,
            "end": 1262,
            "text": "Et la crise, et ça je vais vite car je pense que vous en savez plus que moi, la crise comme rupture de la continuité, le caractère discontinu de l'invention scientifique."
        },
        {
            "start": 1262,
            "end": 1264,
            "text": "Le progrès aussi se fait par une série d'échecs."
        },
        {
            "start": 1264,
            "end": 1267,
            "text": "Ne me dites pas que votre expérience et votre thèse, c'est un long fleuve tranquille."
        },
        {
            "start": 1267,
            "end": 1272,
            "text": "J'imagine que tout le monde vit dans son labo des moments de doute, des moments de crise, ça ne marche pas."
        },
        {
            "start": 1272,
            "end": 1279,
            "text": "Mais justement, la crise, c'est une discontinuité, c'est transitoire, mais il n'y a aucune idée de pathologie ou de malaise."
        },
        {
            "start": 1279,
            "end": 1284,
            "text": "Vous voyez déjà que j'essaie de redonner un peu de valeur au concept de crise."
        },
        {
            "start": 1284,
            "end": 1289,
            "text": "Dans ma thèse, c'est aussi un travail de source et même d'indexation et de métadonnées."
        },
        {
            "start": 1289,
            "end": 1293,
            "text": "Si on prend la presse de nos jours, vous allumez la radio, vous parlez avec quelqu'un."
        },
        {
            "start": 1293,
            "end": 1294,
            "text": "Quel est le vocabulaire ?"
        },
        {
            "start": 1294,
            "end": 1295,
            "text": "Quel vocabulaire sort ?"
        },
        {
            "start": 1295,
            "end": 1312,
            "text": "Vous lisez l'engueur, paralysie, défaitisme, agonie de l'imaginaire, nostalgie du passé, immobilisme, fatalisme, paresse, crise au singulier, au pluriel, la crise, une crise, des crises, un déclin, une économie en déclin."
        },
        {
            "start": 1312,
            "end": 1317,
            "text": "Donc, on est vraiment aujourd'hui, en 2014, sur une crise."
        },
        {
            "start": 1317,
            "end": 1327,
            "text": "Là, j'ai modifié ce que vous voyez en bleu, non plus sur une crise économique, ce qui est déjà l'écart, oui, effectivement, depuis au moins 2008, mais une crise de sens qui est vraiment importante."
        },
        {
            "start": 1327,
            "end": 1332,
            "text": "Alors, lorsqu'on pense à crise de sens et déclin et décadence, est-ce que c'est nouveau ?"
        },
        {
            "start": 1332,
            "end": 1334,
            "text": "Est-ce que c'est en 2014 qu'on parle de décadence ?"
        },
        {
            "start": 1334,
            "end": 1336,
            "text": "Donc, là aussi, une petite citation."
        },
        {
            "start": 1336,
            "end": 1342,
            "text": "C'est une citation assez connue de Husserl, sur une conférence à Vienne, en 1935."
        },
        {
            "start": 1342,
            "end": 1345,
            "text": "La décadence, l'idée de décadence, l'idée de crise, elle n'a pas des subprimes."
        },
        {
            "start": 1345,
            "end": 1348,
            "text": "Voilà, pour le dire pratiquement, c'est comme ça."
        },
        {
            "start": 1348,
            "end": 1351,
            "text": "Elle a toujours imprégné le XXe siècle."
        },
        {
            "start": 1351,
            "end": 1352,
            "text": "J'en suis là."
        },
        {
            "start": 1352,
            "end": 1353,
            "text": "Alors, la décadence, qu'est-ce que c'est ?"
        },
        {
            "start": 1353,
            "end": 1356,
            "text": "Pour certains, c'est Oscar Wilde, pour d'autres, c'est le power metal scandinave."
        },
        {
            "start": 1356,
            "end": 1360,
            "text": "Pour moi, ça serait plutôt, peut-être, en tant qu'exemple, la chute de l'Empire romain."
        },
        {
            "start": 1360,
            "end": 1364,
            "text": "Lorsqu'on parle de décadence, tout le monde pense à la chute de l'Empire romain."
        },
        {
            "start": 1364,
            "end": 1367,
            "text": "Donc, je vous ai mis deux dates."
        },
        {
            "start": 1367,
            "end": 1371,
            "text": "Deux définitions sur la décadence, et j'aimerais y passer un peu de temps."
        },
        {
            "start": 1371,
            "end": 1372,
            "text": "Qu'est-ce qu'on entend par décadence ?"
        },
        {
            "start": 1372,
            "end": 1378,
            "text": "Encore une fois, l'historien, il est toujours en train de triturer les mots, de décortiquer, de revenir."
        },
        {
            "start": 1378,
            "end": 1379,
            "text": "Rien n'est jamais arrêté sur les mots."
        },
        {
            "start": 1379,
            "end": 1382,
            "text": "Je pense que vous aussi, rien n'est jamais arrêté sur un résultat."
        },
        {
            "start": 1382,
            "end": 1384,
            "text": "Rien n'est jamais arrêté sur une hypothèse de travail."
        },
        {
            "start": 1384,
            "end": 1386,
            "text": "Et nous, parfois, voilà, on triture."
        },
        {
            "start": 1386,
            "end": 1392,
            "text": "Et la décadence a largement été discutée, commentée, analysée, depuis très longtemps."
        },
        {
            "start": 1392,
            "end": 1397,
            "text": "Le principal sens de décadence, et comment les gens l'emploient, c'est au niveau biologique."
        },
        {
            "start": 1397,
            "end": 1398,
            "text": "C'est une dégénérescence."
        },
        {
            "start": 1398,
            "end": 1409,
            "text": "Alors, pour ceux que ça intéresse, c'est un auteur très, très connu à l'époque, qui s'appelle Oswald Spengler, un philosophe allemand qui a sorti la décadence de l'Occident, juste après la Première Guerre mondiale."
        },
        {
            "start": 1409,
            "end": 1428,
            "text": "Et pour lui, c'est une évidence, toute civilisation, là, je vous demande votre attention, parce que c'est un point important que j'aimerais que vous compreniez, toute civilisation est amenée comme un être humain, à naître, à croître, à arriver à son apogée, et forcément, automatiquement, systématiquement, à dégénérer et à détruire."
        },
        {
            "start": 1428,
            "end": 1429,
            "text": "Quelles sont les causes ?"
        },
        {
            "start": 1429,
            "end": 1431,
            "text": "Pourquoi là, n'est pas le sujet de ma présentation ?"
        },
        {
            "start": 1431,
            "end": 1436,
            "text": "Mais voilà, c'est une dégénérescence au sens biologique du terme."
        },
        {
            "start": 1436,
            "end": 1443,
            "text": "Perte des valeurs, impossible de penser son histoire, paralysie, agonie, et puis destruction, qu'elle soit lente ou qu'elle soit soudaine."
        },
        {
            "start": 1443,
            "end": 1448,
            "text": "Et des exemples de chutes de civilisations à travers le monde, on peut en citer des quantités."
        },
        {
            "start": 1448,
            "end": 1451,
            "text": "Donc, la plus connue, c'est la chute de l'Empire romain."
        },
        {
            "start": 1451,
            "end": 1453,
            "text": "Ne me demandez pas pourquoi l'Empire romain a chuté."
        },
        {
            "start": 1453,
            "end": 1457,
            "text": "Il existe 45 versions de 45 auteurs différents."
        },
        {
            "start": 1457,
            "end": 1459,
            "text": "Est-ce que c'était un délitement ?"
        },
        {
            "start": 1459,
            "end": 1460,
            "text": "Est-ce que c'était une perte des valeurs ?"
        },
        {
            "start": 1460,
            "end": 1461,
            "text": "Est-ce que c'est l'aristocratie ?"
        },
        {
            "start": 1461,
            "end": 1466,
            "text": "Est-ce que c'est de toute manière l'évidence face aux inventions barbares ?"
        },
        {
            "start": 1466,
            "end": 1475,
            "text": "Là n'est pas la question, mais c'est pour vous montrer que certaines personnes partent du principe que toute civilisation est amenée à dégénérer et à être donc décadent parce qu'elle perd ses valeurs."
        },
        {
            "start": 1475,
            "end": 1484,
            "text": "Un autre, j'ai écrit en tout petit, c'est une historienne qui s'appelle Maroui, qui a écrit un article assez connu aussi, enfin assez connu dans le monde de la recherche en histoire, bien sûr."
        },
        {
            "start": 1484,
            "end": 1487,
            "text": "C'est la décadence comme un oubli nécessaire."
        },
        {
            "start": 1487,
            "end": 1494,
            "text": "On peut très bien imaginer que la décadence, c'est on arrive à un moment donné, on va perdre des choses, mais c'est préalable à une transformation."
        },
        {
            "start": 1494,
            "end": 1503,
            "text": "Et toute la discussion est, lorsque la civilisation agonise et se détruit, est-ce que c'est une fin ou est-ce que c'est une transformation ?"
        },
        {
            "start": 1503,
            "end": 1508,
            "text": "Est-ce que c'est une fin de cycle ou est-ce que le cycle se renouvelle ?"
        },
        {
            "start": 1508,
            "end": 1513,
            "text": "Voilà, je vous ai mis courrier international, l'Occident est-il fini ?"
        },
        {
            "start": 1513,
            "end": 1528,
            "text": "Alors, parce que certaines personnes savent que je dors et je vis avec Raymond Aron depuis pas mal d'années, je vous ai mis une citation que j'aimerais commenter, qui est très importante et c'est un pan de ma recherche dont j'aimerais vous parler."
        },
        {
            "start": 1528,
            "end": 1542,
            "text": "C'est assez long, la conscience que ces régimes peuvent susciter, les régimes démocratiques, la conscience que ces mêmes régimes peuvent susciter une sorte de guerre civile permanente, les citoyens y devenir de purs consommateurs, les groupes de pression s'y multiplier et paralyser l'État."
        },
        {
            "start": 1542,
            "end": 1556,
            "text": "Il est légitime de se demander, à la suite de Pareto et de beaucoup d'autres, si l'épanouissement des libertés, le pluralisme des convictions, l'hédonisme individualiste ne mettent pas en péril la cohérence des sociétés et leur capacité d'action."
        },
        {
            "start": 1556,
            "end": 1565,
            "text": "Pareto, auteur italien entre les deux guerres, dont s'est inspiré certains auteurs de l'Allemagne nazie, qui a surtout parlé sur la destruction des élites."
        },
        {
            "start": 1565,
            "end": 1569,
            "text": "Sur ce point-là, c'est très important et ce n'est pas du tout une provocation."
        },
        {
            "start": 1569,
            "end": 1577,
            "text": "Beaucoup de chercheurs se posent la question si la principale cause de l'Occident, donc là, au-delà de l'Europe, je parle de l'Occident, ce n'est pas la démocratie."
        },
        {
            "start": 1577,
            "end": 1581,
            "text": "Donc, ce n'est pas forcément tous des fachos de droite ou tous des royalistes, pas du tout."
        },
        {
            "start": 1581,
            "end": 1599,
            "text": "Ils se posent la question si la démocratie, en tant que telle, bien sûr, c'est le meilleur à l'exception de tous les autres, tout le monde connaît ça, mais si les défauts ou en tout cas les petits aléas de la démocratie font que l'État se paralyse et font que forcément, il y a une destruction de la civilisation."
        },
        {
            "start": 1599,
            "end": 1603,
            "text": "Revenons un peu en détail, une sorte de guerre civile permanente."
        },
        {
            "start": 1603,
            "end": 1624,
            "text": "Aron, à un moment donné, dit dans ses écrits, l'URSS, à l'époque de la guerre froide, bien sûr, forcément, elle avance, puisque ces personnes, je simplifie beaucoup, bien sûr, mais si en tout cas une décision est plus vite prise et plus vite, comment dire, amendée et mise en pratique qu'une décision démocratique, donc ainsi, il faut discuter."
        },
        {
            "start": 1624,
            "end": 1626,
            "text": "Et on est à la recherche du compromis."
        },
        {
            "start": 1626,
            "end": 1634,
            "text": "Mais est-ce que la recherche du plus petit compromis possible, ce n'est pas justement quelque chose qui va paralyser ou qui va en tout cas affaiblir les groupes de pression ?"
        },
        {
            "start": 1634,
            "end": 1646,
            "text": "S'y multiplier et paralyser l'État, naturellement, Aron ne remet pas en question ces groupes de pression, il remet en question ou il se pose la question, est-ce qu'avoir X groupes de pression ne paralysent pas l'État ?"
        },
        {
            "start": 1646,
            "end": 1654,
            "text": "Oui, forcément, mais de dire oui forcément, ce n'est pas être le dernier des hommes."
        },
        {
            "start": 1654,
            "end": 1663,
            "text": "Donc il est légitime de se demander la suite de Pareto et de beaucoup d'autres, si l'épanouissement des libertés, le pluralisme des convictions et l'hédonisme individualiste ne mettent pas en péril la cohérence des sociétés."
        },
        {
            "start": 1663,
            "end": 1670,
            "text": "Marcel Gaucher, si vous connaissez, auteur français qui travaille beaucoup sur la démocratie, en parle aussi depuis une centaine d'années."
        },
        {
            "start": 1670,
            "end": 1675,
            "text": "Naturellement, c'est le droit de l'individu, c'est le droit à l'individualité, c'est moi-je."
        },
        {
            "start": 1675,
            "end": 1684,
            "text": "Mais forcément, quand on dit moi-je, la problématique, ce n'est pas forcée, mais la problématique, c'est que la société, le tout, l'ensemble peut en pâtir."
        },
        {
            "start": 1684,
            "end": 1692,
            "text": "L'épanouissement des libertés, le pluralisme des convictions, l'hédonisme individualiste ne mettent pas en péril, c'est surtout la capacité d'action."
        },
        {
            "start": 1692,
            "end": 1699,
            "text": "C'est un peu comme si dans une société, dans une entreprise, on était en parfaite démocratie, il n'y avait pas un chef qui tranchait à un moment donné."
        },
        {
            "start": 1699,
            "end": 1700,
            "text": "Forcément, oui, ça paralyse."
        },
        {
            "start": 1700,
            "end": 1702,
            "text": "Forcément, on va vers le plus petit notaire commun."
        },
        {
            "start": 1702,
            "end": 1703,
            "text": "Forcément, c'est plus long."
        },
        {
            "start": 1703,
            "end": 1707,
            "text": "Forcément, ils sont paralysés en termes de cohérence et de capacité."
        },
        {
            "start": 1707,
            "end": 1712,
            "text": "Donc voilà, est-ce qu'on va vers la vie et mort, avec une faute d'orthographe, pardon, sur la mort d'une civilisation ?"
        },
        {
            "start": 1712,
            "end": 1714,
            "text": "C'est une partie importante de ma recherche."
        },
        {
            "start": 1714,
            "end": 1721,
            "text": "Est-ce qu'une civilisation est amenée forcément à mourir ou si elle est amenée à se recycler ?"
        },
        {
            "start": 1721,
            "end": 1723,
            "text": "Alors, qu'est-ce qu'on fait de la décadence ?"
        },
        {
            "start": 1723,
            "end": 1727,
            "text": "Après avoir dit tout ça, est-ce que c'est un concept opératoire ?"
        },
        {
            "start": 1727,
            "end": 1731,
            "text": "Un concept opératoire, en histoire, c'est quelque chose qui nous permet de… C'est comme un levier."
        },
        {
            "start": 1731,
            "end": 1732,
            "text": "Je m'appuie dessus pour travailler."
        },
        {
            "start": 1732,
            "end": 1733,
            "text": "C'est une grille de lecture."
        },
        {
            "start": 1733,
            "end": 1735,
            "text": "Je ne dis pas que c'est bien ou pas bien."
        },
        {
            "start": 1735,
            "end": 1742,
            "text": "Je dis qu'il est légitime de prendre la décadence comme concept opératoire pour travailler, pour décortiquer un peu."
        },
        {
            "start": 1742,
            "end": 1744,
            "text": "Donc c'est un jugement moral et non un jugement de fait."
        },
        {
            "start": 1744,
            "end": 1747,
            "text": "Voilà, mais c'est ce que je dis, la décadence est opératoire."
        },
        {
            "start": 1747,
            "end": 1749,
            "text": "C'est une médiation sur le sens de l'histoire."
        },
        {
            "start": 1749,
            "end": 1754,
            "text": "Au 19e, tout le monde parlait du positivisme et la notion de progrès."
        },
        {
            "start": 1754,
            "end": 1758,
            "text": "Début du 20e aussi, mais à partir de la Première Guerre mondiale et qui a été vraiment le choc."
        },
        {
            "start": 1758,
            "end": 1763,
            "text": "On ne réalise pas comme la Première Guerre mondiale a été un choc pour les gens, dans les millions de morts."
        },
        {
            "start": 1763,
            "end": 1765,
            "text": "Donc on peut s'autodétruire beaucoup plus."
        },
        {
            "start": 1765,
            "end": 1765,
            "text": "Enfin beaucoup plus."
        },
        {
            "start": 1765,
            "end": 1771,
            "text": "Tout le monde a bien sûr en tête la Seconde Guerre mondiale, mais la Première Guerre mondiale a vraiment été un choc."
        },
        {
            "start": 1771,
            "end": 1776,
            "text": "On peut s'autodétruire et on est en train de décliner parce que nous, Europe, on est en train de s'autodétruire."
        },
        {
            "start": 1776,
            "end": 1779,
            "text": "Donc oui, c'est une médiation sur le sens de l'histoire."
        },
        {
            "start": 1779,
            "end": 1787,
            "text": "Elle agit comme un repoussoir et surtout, elle imprène la pensée européenne, vraiment depuis le 19e et jusqu'à maintenant."
        },
        {
            "start": 1787,
            "end": 1788,
            "text": "Alors voilà où est-ce qu'on en est."
        },
        {
            "start": 1788,
            "end": 1790,
            "text": "C'est bientôt, j'arrive presque à la fin."
        },
        {
            "start": 1790,
            "end": 1791,
            "text": "Voilà où est-ce qu'on en est."
        },
        {
            "start": 1791,
            "end": 1794,
            "text": "Je suis parti de l'Europe, crise économique, le rôle des crises."
        },
        {
            "start": 1794,
            "end": 1796,
            "text": "La décadence, est-ce que c'est une médiation ?"
        },
        {
            "start": 1796,
            "end": 1798,
            "text": "Est-ce que la démocratie est décadente ?"
        },
        {
            "start": 1798,
            "end": 1801,
            "text": "C'est une petite partie, je n'ai pas voulu détailler plus."
        },
        {
            "start": 1801,
            "end": 1803,
            "text": "Est-ce que c'est la fin de l'histoire ?"
        },
        {
            "start": 1803,
            "end": 1807,
            "text": "Est-ce qu'on arrive, voilà, est-ce qu'on est de toute manière amené à être décadent ?"
        },
        {
            "start": 1807,
            "end": 1811,
            "text": "Alors on espère que non, parce que l'homme a une capacité de réinvention insoupçonnée."
        },
        {
            "start": 1811,
            "end": 1814,
            "text": "L'humanité n'avance qu'en se vouant au problème qu'elle est incapable de se résoudre."
        },
        {
            "start": 1814,
            "end": 1816,
            "text": "Je trouve que c'est plutôt une belle phrase."
        },
        {
            "start": 1816,
            "end": 1818,
            "text": "C'est donc Marcel Gaucher."
        },
        {
            "start": 1818,
            "end": 1826,
            "text": "Un petit point sur Marcel Gaucher, pour ceux que ça intéresse, il travaille beaucoup sur les problématiques de la démocratie en 2014."
        },
        {
            "start": 1826,
            "end": 1831,
            "text": "Légitimisme des opinions, protestations et révolutions."
        },
        {
            "start": 1831,
            "end": 1833,
            "text": "Il dit à force de faire des manifestations, on proteste."
        },
        {
            "start": 1833,
            "end": 1839,
            "text": "Mais voilà, on ne fait ni des révolutions ni des manifestations et c'est loin d'être constructif."
        },
        {
            "start": 1839,
            "end": 1847,
            "text": "Alors, pour revenir, et c'est vraiment ce que j'aimerais, c'est peut-être le slide le plus important, c'est en fait au travers de l'Europe, je vous parle plus de la crise que de l'Europe."
        },
        {
            "start": 1847,
            "end": 1848,
            "text": "L'Europe, c'est un prétexte."
        },
        {
            "start": 1848,
            "end": 1852,
            "text": "Lorsque je fais mes recherches, voilà, je suis européen convaincu et je le prends comme un prétexte."
        },
        {
            "start": 1852,
            "end": 1855,
            "text": "Mais je travaille plus sur le rôle de la crise."
        },
        {
            "start": 1855,
            "end": 1857,
            "text": "Donc la crise, elle est consubstantielle."
        },
        {
            "start": 1857,
            "end": 1860,
            "text": "Si on la remplace par tension, c'est l'acte de choisir."
        },
        {
            "start": 1860,
            "end": 1861,
            "text": "Mais à un moment donné, il faut choisir."
        },
        {
            "start": 1861,
            "end": 1863,
            "text": "À un moment donné, il faut avancer."
        },
        {
            "start": 1863,
            "end": 1866,
            "text": "Et je vais vous parler de l'Europe en 2014 dans le dernier slide."
        },
        {
            "start": 1866,
            "end": 1870,
            "text": "La crise, elle est ici comprise comme action de jugement."
        },
        {
            "start": 1870,
            "end": 1871,
            "text": "La crise est alors l'acte de trancher."
        },
        {
            "start": 1871,
            "end": 1880,
            "text": "Et en s'identifiant à une cause qui nous transcende, c'est-à-dire qui dépasse notre capacité, qui nous dépasse, nous, en tant qu'êtres humains, on va vers un engagement."
        },
        {
            "start": 1880,
            "end": 1882,
            "text": "Et alors, c'est une véritable sortie de crise."
        },
        {
            "start": 1882,
            "end": 1910,
            "text": "Et là, c'est Paul Ricoeur qui dit « La crise naît ainsi au carrefour où l'engagement est en lutte avec la tendance à l'inertie, à la fuite et à la désertion » Et l'Europe en 2014, de sens politique, de vision, d'avenir, de rêve, mettez tous les qualificatifs que vous voulez au travers ça, elle est vraiment en lutte avec l'inertie, avec le fatalisme, avec la fuite et vers la désertion."
        },
        {
            "start": 1910,
            "end": 1920,
            "text": "Et donc avant dernier slide où je résume à peu près tout ce que j'ai voulu vous dire, je suis parti d'abord de l'identité européenne et de l'idée européenne."
        },
        {
            "start": 1920,
            "end": 1928,
            "text": "Je vous rappelle rapidement, la paix est une chose effective, mais ce n'est plus nécessaire, dans le sens où ça y est, on y est arrivé, mais maintenant il faut aller au-delà."
        },
        {
            "start": 1928,
            "end": 1935,
            "text": "La transcendance, c'est-à-dire le sentiment européen, il est quand même très très mal engagé actuellement."
        },
        {
            "start": 1935,
            "end": 1946,
            "text": "On pourrait discuter de la poussée des parties d'extrême droite, en tout cas, sur le sentiment européen."
        },
        {
            "start": 1946,
            "end": 1950,
            "text": "Les pères de l'Europe n'ont jamais réussi à faire naître un véritable sentiment européen."
        },
        {
            "start": 1950,
            "end": 1953,
            "text": "Peut-être que pour avoir un sentiment européen, il faut que ça nous touche."
        },
        {
            "start": 1953,
            "end": 1959,
            "text": "L'Europe de la culture, l'Europe du sport, ça existe, mais malheureusement trop morcelé."
        },
        {
            "start": 1959,
            "end": 1967,
            "text": "L'économie, si c'était un des plus grands succès, parce qu'on ne se rend pas compte, mais en 1945, l'Europe est ruinée, quand je vous dis ruinée, c'est-à-dire des ruines au sens propre et au sens figuré."
        },
        {
            "start": 1967,
            "end": 1976,
            "text": "Et fin des années 1960, elle devient vraiment un candidat et un concurrent très très important des États-Unis."
        },
        {
            "start": 1976,
            "end": 1984,
            "text": "Maintenant, l'Europe, c'est encore le plus grand marché mondial au sens propre du terme, mais l'économie va mal."
        },
        {
            "start": 1984,
            "end": 1987,
            "text": "L'identité, on en a parlé, l'identité européenne en question."
        },
        {
            "start": 1987,
            "end": 2000,
            "text": "Moi, dans mon séminaire en troisième année, je fais un jeu, je dis aux élèves, sortez-moi un lieu de mémoire, une personne, une date, et ne me dites pas Charlemagne, 9 mai 1950 et Auschwitz."
        },
        {
            "start": 2000,
            "end": 2001,
            "text": "Dites-moi autre chose."
        },
        {
            "start": 2001,
            "end": 2004,
            "text": "Quel est le mythe en 2014 de l'Europe ?"
        },
        {
            "start": 2004,
            "end": 2008,
            "text": "C'est le moine au XIIe siècle qui faisait tous les monastères, c'est quoi ?"
        },
        {
            "start": 2008,
            "end": 2011,
            "text": "C'est l'Inquisition, c'est le roman européen, qu'est-ce que c'est ?"
        },
        {
            "start": 2011,
            "end": 2014,
            "text": "C'est quand même très difficile à trouver."
        },
        {
            "start": 2014,
            "end": 2021,
            "text": "Je vous ai montré que durant la construction européenne, les crises étaient inhérentes à la construction et qu'on avait toujours des relances."
        },
        {
            "start": 2021,
            "end": 2025,
            "text": "L'inconvénient, c'est qu'en 2014, la relance, elle se fait attendre."
        },
        {
            "start": 2025,
            "end": 2031,
            "text": "Il y avait une crise économique et une crise de sens, donc le rôle des crises, un rôle pas forcément négatif."
        },
        {
            "start": 2031,
            "end": 2035,
            "text": "On pouvait aller vers la décadence, démocratie ou médiation, mort d'une civilisation."
        },
        {
            "start": 2035,
            "end": 2040,
            "text": "Là, on en est là, la crise de sens, il faudrait un acte de choisir et l'engagement."
        },
        {
            "start": 2040,
            "end": 2042,
            "text": "Est-ce qu'on est sur une crise sans fin ?"
        },
        {
            "start": 2042,
            "end": 2044,
            "text": "Je l'ai rajouté un quart d'heure avant, tout à l'heure."
        },
        {
            "start": 2044,
            "end": 2056,
            "text": "C'est un auteur que je suis en train de lire et qui est très intéressant et qui indique que le gros problème de l'Europe actuellement est de la crise et que tous les jours aux infos, on ne parle même pas d'une crise, on parle de la crise."
        },
        {
            "start": 2056,
            "end": 2057,
            "text": "Je ne sais pas si vous voyez le changement de vocabulaire."
        },
        {
            "start": 2057,
            "end": 2060,
            "text": "Une crise, c'est un temps, un début et une fin."
        },
        {
            "start": 2060,
            "end": 2061,
            "text": "On sait qu'il va y avoir quelque chose."
        },
        {
            "start": 2061,
            "end": 2063,
            "text": "Maintenant, la crise, c'est comme si c'était un état d'esprit."
        },
        {
            "start": 2063,
            "end": 2068,
            "text": "Oui, vous savez, on est en crise et ça alimente et ça argumente tout."
        },
        {
            "start": 2068,
            "end": 2069,
            "text": "C'est une crise sans fin."
        },
        {
            "start": 2069,
            "end": 2072,
            "text": "Il n'y a même pas de vision d'avenir."
        },
        {
            "start": 2072,
            "end": 2074,
            "text": "On va en sortir, mais quand, comment, pourquoi ?"
        },
        {
            "start": 2074,
            "end": 2075,
            "text": "Est-ce que c'est la crise sans fin ?"
        },
        {
            "start": 2075,
            "end": 2077,
            "text": "L'acte de choisir et l'engagement."
        },
        {
            "start": 2077,
            "end": 2080,
            "text": "Là, j'avais mis une petite couverture aussi d'economiste, qu'est-ce qu'il faut faire ?"
        },
        {
            "start": 2080,
            "end": 2092,
            "text": "Et ce que, dans ma thèse, je montre aussi, pour finir quand même sur une note positive, ça fera plaisir à Pierre-Emerick qui m'avait dit quand même, sois positif, Olivier, à la fin de ton présentation, c'est que tout est à faire parce que tout est possible."
        },
        {
            "start": 2092,
            "end": 2093,
            "text": "Et on parle de vitalité historique."
        },
        {
            "start": 2093,
            "end": 2097,
            "text": "La vitalité, c'est la possibilité de dire jeu, de penser son histoire."
        },
        {
            "start": 2097,
            "end": 2113,
            "text": "Et Raymond Aron et d'autres s'appuient sur Machiavel, non pas sur Machiavel, le prince, comme tout le monde connaît, mais sur son opposition entre la vertu et la fortune, pour ceux qui connaissent, la fortune, c'est le hasard, la vertu, c'est la capacité à choisir, à modifier, à décider, à aller au-delà."
        },
        {
            "start": 2113,
            "end": 2123,
            "text": "L'histoire est tragique, dans le sens propre du terme, on en est tous d'accord, mais il faut être vertueux, enfin pas dans le sens vertueux, au sens moral du terme, bien sûr que non, mais il faut avoir la capacité à avoir une vitalité historique."
        },
        {
            "start": 2123,
            "end": 2132,
            "text": "Et donc, toute ma recherche, c'est le balancier, on va dire, c'est le va-et-vient, l'Europe au milieu, entre le marteau et l'enclume, entre la décadence et la vitalité historique."
        },
        {
            "start": 2132,
            "end": 2138,
            "text": "Penser la complexité, donc l'histoire doit parler au présent, j'ai bien conscience que tout ça, dans trois jours, tout le monde aura oublié, et ce n'est pas ça l'intérêt."
        },
        {
            "start": 2138,
            "end": 2151,
            "text": "Moi, quand je fais de l'histoire et quand j'en parle, à mes élèves, j'en ai 15, attention, mais en tout cas, lorsque je parle de l'histoire à certaines personnes, peu importe qu'on se souvienne des dates, l'important, c'est que l'histoire, elle parle au présent, elle rend intelligible le présent."
        },
        {
            "start": 2151,
            "end": 2171,
            "text": "La culture historique, ça ne sert pas à savoir 1515, Marignan et après, on en a un, mais ça sert à savoir ce qui s'est passé avec François 1er et compagnie, ou la Révolution, comme je vous ai montré, elle doit parler au présent, peu importe les faits, les dates, vous prenez Wikipédia, mais une culture historique doit logiquement vous aider à mieux lire un article du monde."
        },
        {
            "start": 2171,
            "end": 2177,
            "text": "Ne serait-ce que ça, moi, je trouve qu'en tant que vaquetaire ou en tant que chercheur, j'aurais gagné mon pari."
        },
        {
            "start": 2177,
            "end": 2199,
            "text": "Et donc, toute petite synthèse très vite sur la crise, c'est une rupture ou c'est un moment décisif, on peut mesurer une crise, les enjeux, la complexité, l'intensité, la durée, j'en ai pas parlé, j'en parle aussi dans ma recherche, mais en 2014, on peut être conscient qu'on parle d'une crise vraiment complexe et intense avec de graves enjeux, et mon trio avec qui je me balade tout le temps, c'est la crise, la décadence et la vitalité historique."
        },
        {
            "start": 2199,
            "end": 2200,
            "text": "Merci."
        }
    ],
    "text": "Mon sujet, vous l'avez vu sur les affiches, l'Europe en crise, renouveau ou décadence ? Je vais vous parler de l'Europe. Depuis quelques temps, les actualités, la presse, l'Europe est en crise. Je vous propose un plan assez simple. D'abord, comment penser l'histoire ? Je pense que vos souvenirs d'histoire sont assez lointains, en terminale, en histoire-géographie. Peut-être que vous avez des clichés sur l'histoire. Je vais essayer de combattre quelques clichés. Ensuite, on rentre dans le vif du sujet avec l'identité européenne, l'idée européenne, la crise ou les crises en Europe. Le rôle de la crise, mon sujet de recherche, c'est un prétexte. Je travaille sur l'Europe, mais c'est un prisme, un angle spécifique. C'est un prétexte pour évoquer le concept de crise. Est-ce qu'on va vers la décadence ? Et après, décadence contre vitalité historique. En introduction, quelques notions de méthodologie historique. Je le crie haut et fort, même de façon très vulgaire. On n'en a rien à faire des dates. Vous avez dû apprendre en histoire des dates, Marignan, prise de la Bastille, et du reste. Prenons un exemple. Tout le monde connaît la date de la Révolution française, la date symbolique. Le 14 juillet 89. Ça, jusque-là, tout le monde connaît à peu près. On va sur Wikipédia, on la connaît de tête. Qu'est-ce qui s'est passé le 14 juillet 89 ? Quand je fais mon séminaire en 3ème année, c'est un petit jeu. Là, on n'a pas le temps de le faire, mais on sait qu'il s'est passé la prise de la Bastille. Ça, jusque-là, logiquement, je ne vous ai pas perdu. On sait qu'on est allé rechercher de la poudre, et non 7 pauvres prisonniers qui se battaient en duel 3 fous, 4 prisonniers. Le Marquis de Sade a été sorti de la Bastille quelques jours avant. Donc ça, c'est les faits. Mais ça ne nous explique pas toujours pourquoi le 14 juillet, et pourquoi c'est une date symbolique importante. En fait, dans la continuité du temps, il y a eu le renvoi de Necker le 11 juillet. Sans rentrer dans le détail, Necker, ministre des Finances, qui était aimé du peuple, on le renvoie quelques temps avant. Donc le peuple de Paris est un peu inquiet. Il y a des troupes aux abords de Paris. Ce sont des troupes mercenaires, des troupes étrangères. Donc là, le peuple de Paris commence un peu à s'inquiéter. Et bien sûr, vous avez entendu parler peut-être des États généraux. Depuis quelques mois, il y a les grands États généraux qui sont lancés en France. Mais en fait, un an après, le 14 juillet 90, il y a une fête de la Fédération, où Louis XVI prête serment à l'État et à la Nation. Et c'est la fête de la Fédération. Ça signifie qu'en fait, le 14 juillet, en tant que tel, ce n'est pas du tout le symbole du 14 juillet 89. Pendant un siècle, j'ai trouvé ça sur Internet, jusqu'au 6 juillet 80, on fête non pas la prise de la Bastille, mais on commémore la fête de la Fédération de 1790. Et en 1890, sur proposition d'un député, on décide que cette date devient symbole de la France, c'est jour national. Mais en fait, l'année n'est pas marquée, pour faire plaisir à la fois aux républicains qui voulaient accentuer le 14 juillet 89 et aux conservateurs qui voulaient plutôt fêter le 14 juillet 90. Tout ça pour vous dire que je suis parti d'une date, et en fait, ça aurait pu être le 13, le 15, le 12, on n'en a un peu rien à faire. L'histoire, c'est essayer de voir tout ce qu'il y a autour, essayer de comprendre tout ce qui s'est passé. Alors, deuxième cliché, on n'invente rien. Je vous lis un texte « Notre forme d'existence actuelle résulte principalement de l'inversion excessive de chaque minute écoulée, et de la domination, chose qui, sans aucun doute, détruise de manière radicale toute joie de vivre. Nous obéissons à la devise qui commande de faire le maximum de choses en un minimum de temps » Ma copine, qui appelle ça mon doudou, elle en est totalement consciente. On a l'impression que cette phrase, elle a été écrite de nos jours, on est tous sur nos portables, on est en train de tweeter en direct, on fait des réunions, voilà. Ça a été écrit en 1899 par Emma Ness, l'art de l'oisiveté. Tout ça pour vous montrer qu'en histoire, on prend aussi un peu de recul, et on se rend compte qu'on n'invente rien. Troisième notion, penser l'incertain. Je sais qu'ici c'est important parce qu'on travaille sur la complexité, et aussi sur penser l'incertain. En histoire, on réfléchit en tout cas aussi à ce qui est arrivé sur le non-advenu. Je vous l'affiche et je vous lis juste quelques paragraphes « Le gouvernement du Royaume-Uni et de la République française se déclarent indissolublement unis et inébranlablement résolus à défendre en commun la justice et la liberté. Les deux gouvernements ne font plus qu'un, les deux nations ne font plus qu'une seule Union franco-britannique. Tous citoyens français, je vous lirai mieux de même en suite, et réciproquement » Je suis en train de vous lire un texte où on propose la fusion. Il y a une fusion centrale-superlégue, mais non, là c'est la fusion de la France et de la Grande-Bretagne. Ce texte a été présenté par De Gaulle au téléphone à Paul Reynaud, président du Conseil des ministres, la veille du 5 juin 1940, ou même le 16 juin 1940 au matin, lorsqu'il allait après démissionner pour laisser la place à Pétain. Pour vous montrer aussi que l'histoire c'est aussi de réfléchir ce qui n'est pas arrivé, et aussi l'incertain. Alors quatrième notion, le temps long. Je vous présente une carte qui peut-être ne parle pas aux plus jeunes d'entre nous, parce que malheureusement maintenant je dois faire la séparation, c'est moi je suis moins jeune. Ça moi je l'ai appris en cours, en troisième, en quatrième. Ça c'est la carte en 1988, où vous voyez les missiles russes, les SS-20, et les Pershing II américains. Ça c'est la carte en 1988. On est d'accord que c'était il y a 20 ans 20 ans dans l'histoire, c'est même pas une respiration, c'est rien. Donc on se rend compte aussi qu'on réfléchit sur le temps long. Il y a 20 ans, c'était les missiles qui étaient sur le sol européen. Cinquième notion, des césures. Il y a des césures en histoire, même si la césure le fait, historique ne fait pas tout. Il y a des césures qu'on peut prendre en tout cas comme date symbolique. J'ai voulu prendre une césure qui ne concerne pas l'histoire de l'Europe. Je ne sais pas si tout le monde voit, c'est la bataille d'Axiom. En 31, avant Jésus-Christ, César vient de se faire assassiner. Il y a Marc-Antoine d'un côté et Octave de l'autre. Octave va voir en Égypte, il va être gouverneur de l'Égypte. L'inconvénient, c'est qu'il est avec Cléopâtre. Et il y a une guerre entre d'un côté, Marc-Antoine et Cléopâtre, et de l'autre, Octave. Sur cette guerre, à cause du vent ou du général Agrippa, qui fut un très illustre général du côté d'Octave, la guerre a tourné. Ce n'est pas cette guerre qui a fait que Rome a gagné contre l'Égypte, mais ça a été une césure importante. C'est aussi pour vous montrer que parfois, il y a vraiment des césures. Et l'histoire, nous, on est là pour chercher des césures. Sixième et avant-dernière notion, attention à l'interprétation. Je vous lis les paroles de la Marseillaise très connues « Aux armes, citoyens, formez vos bataillons, marchons, marchons, quand sang impur abreuve nos sillons. » Vous avez tous entendu, dis donc, quel chant guerrier, le sang impur des autres « Qu'est-ce que c'est un chant criminel contre l'adversaire ? » Pas du tout « Quand sang impur abreuve nos sillons », c'est les gens qui sont en train de chanter ça, qui demandent que leur sang, qui est impur puisqu'il n'est pas noble, abreuve les sillons de la terre, c'est-à-dire qu'ils nourrissent leur terre. Donc, ils demandent à ce que leur sang soit versé pour défendre la patrie. Voilà comment on peut interpréter ou mal interpréter aussi. Et l'histoire aussi est là pour essayer de clarifier les choses. Alors, cette petite introduction sur comment penser l'histoire, j'essaye de vous montrer qu'on problématise un événement, que l'histoire n'est pas linéaire et que ça ne donne pas à voir. Il faut aller la chercher. L'histoire s'intéresse au temps long, aux césures et aux ruptures, et à la discordance des temps. Alors, je pense que ça doit vous trotter dans la tête, mais est-ce que l'histoire, il nous parle, mais nous, on est des scientifiques, est-ce que l'histoire est une science ? En tout cas, l'histoire est une démarche. Et sur cette démarche, on peut dire que c'est une démarche scientifique. On cherche à comprendre plutôt qu'à expliquer. On n'est pas dans la causalité, on est dans la compréhension, ce qui est très différent. Elle rend lisible et intelligible, elle donne à voir, ça c'est une démarche scientifique. Il n'y a pas de jugement normatif, l'historien doit s'extraire de sa subjectivité, mais naturellement il en est conscient et c'est justement aussi un atout. Et il n'y a pas de déterminisme historique, ni de relativisme historique à outrance. Le déterminisme, vous savez, c'est que l'histoire a un objectif donné, la fin du communisme, fin de l'histoire, le capitalisme, c'est la fin du train. L'histoire et l'actualité nous rendent compte que non. Et en fait, pour simplifier, une seule phrase à retenir de cette introduction, l'histoire parle au présent, on n'en a rien à faire de la révolution française. Enfin, on n'en a rien à faire. Toute l'histoire doit nous permettre de rendre compréhensible le présent. Alors maintenant, on rentre dans le vif du sujet. Donc, Laurent Pancriz, Renouveau aux décadences. Moi, ma thèse, c'est un combat. Je fais un combat entre décadence, contre vitalité historique. Et je vais vous montrer comment je navigue à travers ce combat. Alors, on rentre vraiment maintenant sur l'identité européenne. Là aussi, je ne vais pas faire d'interaction, mais il y a quatre symboles officiels de l'Europe. Logiquement, on est tous à peu près capables de dire le drapeau européen. On est tous à peu près capables de dire l'hymne européen, la neuvième de Beethoven. La journée de l'Europe, je ne fais pas un sondage, mais il y en a deux qui sont capables de donner la date de la journée de l'Europe. Voilà, le 9 mai 1950. Et si, mis à part mes collègues estimés, il y en a ici qui sont capables de nous sortir la devise de l'Europe, là aussi, je demande à voir, c'est donc, je suis allé trop vite, pardon, c'est unis dans la diversité. Donc, l'idée d'identité européenne, ce sont ces quatre symboles, en tout cas, officiels. Donc, au fur et à mesure de la prése, je fais à chaque fois des schémas, comme ça, je ne vais pas vous perdre. Donc, le premier point dans le schéma, l'Europe. Qu'est-ce que l'identité d'un groupe donné ? Des valeurs, donc là, les valeurs européennes, démocratie, droit de l'homme, modal social européen, une mythologie commune, on va en parler après, parce que pour construire une identité, pour construire l'Europe, il faut bien des personnages et des lieux de mémoire, une mythologie, comme il peut y avoir à Centrale une mythologie avec ses fondateurs, par exemple, ou en tout cas, ses lieux, ou sa statue, ou ce que vous voulez. Une histoire commune, des succès économiques, ça c'est un fait, mais qui sont aujourd'hui mis à mal. Des réalisations, alors j'en parlerai aussi, mais on réalise, enfin, on n'oublie, pardon, trop vite que l'un des principaux apports de l'Union européenne, c'est quand même la paix entre la France et l'Allemagne. Je ne vous refais pas, il y a eu trois guerres, 70, 14, 40, en même pas un siècle, on ne parle pas des dizaines de millions de morts, et réconcilier la France et l'Allemagne, c'est peut-être le premier et le plus important, parce que maintenant, il est difficilement imaginable que la France et l'Allemagne se battent entre eux, mais ce n'était pas si évident en 1945. Et un projet d'avenir, je vais en parler. Et en fait, pour vous montrer que l'identité européenne, elle est en question, tout à l'heure, j'ai parlé de mythes et de mythologies, sur quoi on peut s'appuyer. Alors l'historien aussi, il s'appuie sur des sources, il s'appuie sur des œuvres, cette cantation n'est pas de moi, je compile plusieurs choses. Je vous lis rapidement, Mélie Barnavis, c'est un chercheur israélien, « Les cathédrales et les bûchers, l'universalisme et l'esclavage, les merveilles de l'art baroque et l'inquisition, la raison scientifique et la chasse aux sorcières, le progrès et la guerre totale, démocratie et bureaucratie, fraternité et goulag, Beethoven et Auschwitz », la répétition est voulue, c'est de lui, « Beethoven et Auschwitz, ainsi est l'Europe, la tête dans les étoiles et les pieds dans le sang » Si on part du principe que l'Europe a été construite, parce que je parle de l'Europe au niveau de son politique, on va dire en 1950, après la guerre, l'inconvénient c'est qu'elle s'est construite sur des milliers de morts, et sous forme de provocation, je vous demande quel est le meilleur lieu de mémoire commun en Europe qu'Auschwitz. Vous ne répondez pas Bruxelles, je serais embêté. Edgar Morin dit que jusqu'à présent, jamais ne s'est créé une conscience ou un sentiment à partir de futur, lorsqu'on unit deux personnes, c'est qu'au départ il y a une histoire commune. Oui, là il y a une histoire commune, mais il y a tellement de points négatifs, c'est qu'on est vraiment dans une identité paradoxale. Peut-être que le symbole européen le plus fort, mais qui est malheureusement un peu vieux, c'est celui-là, encore sur la paix européenne, donc c'est Helmut Kohl et François Mitterrand à Verdun en 1984 qui se prennent la main, ce n'était pas prévu au programme. C'est peut-être ça l'identité européenne, ou en tout cas le symbole européen, mais malheureusement il en faudrait d'autres, parce que ça commence un peu à vieillir. Donc on en est là de mon exposé, l'Europe, une identité en question, et des mythes et des symboles en question, en tout cas à renouveler. L'idée européenne, pourquoi est-ce qu'on a fait l'Europe, la construction européenne ? Bien sûr c'est très schématique, naturellement je vais très vite et il y a beaucoup de choses d'autres à dire. Elle partait de plusieurs nécessités, je vous ai dit, France et l'Allemagne, je ne reviens pas. Elle partait sur une idée déjà très vieille qui était enrayer le déclin, c'est-à-dire que dès la fin de la première guerre mondiale, l'Europe perd sa place de super gendarme au profit en tout cas des États-Unis, il fallait enrayer un déclin économique, développer l'économie parce qu'au sortir de la guerre tout le monde est ruiné, donc il faut bien reconstruire, et transcender, devenir des peuples européens. Victor Hugo en a parlé dans un discours fameux en 1848, Benda en a parlé, même les résistances européennes en ont parlé. C'est intéressant lorsqu'on travaille sur des sources, parce que moi je travaille sur des sources, de découvrir dans des archives, vous vous travaillez sur des expériences, moi je travaille avec des cartons. C'est mon matériau, je vais en archive, il y a des cartons, et je dépouille. Et dans le meilleur des mondes possible, je trouve sur des pépites parfois, je ne suis pas tombé sur cette pépite-là parce qu'elle est assez connue, mais c'est que les résistances européennes, qu'elles soient roumaines, polonaises, anglaises, françaises, dès 1941-1942, appellent à une Europe unie, ce qui n'était pas aussi évident. Donc ça c'est l'idée européenne d'il y a quelques années, malheureusement ça ne suffit plus. L'idée est toujours plus belle que la réalisation, l'idée doit être entretenue, elle doit être vraiment surveillée, alimentée, sinon à la moindre crise elle peut être détruite. Et au fond maintenant, on ne sait plus trop pourquoi on fait l'Europe. Donc voilà où on en est, l'Europe, mythes et symboles, identités, une économie mise à mal, une transcendance un peu oubliée, et une paix effective, oui, mais il faut un peu plus que ça. Maintenant sur la crise de l'Europe, il y a X chiffres, il y a X faits, on ne va pas se les rappeler. Je vous montre trois schémas très rapides pour vous dire que la crise est effective, on pourrait nous demander mais est-ce qu'il y a une vraie crise ? Oui, il y a une vraie crise économique, une vraie crise de confiance. L'Union Européenne fait un baromètre tous les deux fois par an, donc là vous voyez en bleu l'opinion positive sur l'Europe, en jaune l'opinion neutre, et en rouge l'opinion négative, donc là il y a une vraie crise de confiance. Alors je suis incompétent et totalement inintéressé par l'économie, mais je montre deux trois schémas, le taux d'intérêt des emprunts à 10 ans, vous voyez, crise des subprimes en haut à droite, mais après regardez la Grèce, le Portugal, il y a une vraie crise de l'économie. Je passe un peu vite parce que je trouve que ce n'est pas hyper intéressant. Taux de chômage en pourcentage, je ne vous le commande pas, en bleu 2007, en rouge 2011, vous voyez où on en est, Espagne, Lettonie, Grèce, Hollande, le chômage explose, et quoi qu'on en dise, le chômage est un indicateur d'une santé économique d'une nation, ou là en tout cas de l'Europe. Donc on en est là. L'Europe est effectivement en crise. Voilà, donc ça c'est la couverture d'un économiste d'il y a un an, est-ce qu'on peut faire quelque chose pour relever l'Europe ? La première chose que je veux vous montrer, c'est que la crise, ce n'est pas forcément négatif, et en tout cas ça fait partie d'une histoire. On peut parler de la crise du Real de Madrid, on peut parler de la crise d'un couple, on peut parler de la crise de ce que vous voulez, mais la crise fait toujours partie de la vie, c'est j'ose dire, et je vais vous montrer plusieurs exemples, notamment bien sûr sur l'Europe, que l'Europe s'est toujours servie des crises pour se relancer. Alors je vous montre plusieurs cycles, enfin plusieurs exemples, il y en a vraiment beaucoup plus. Donc là un peu d'apport théorique, mais pour vous, peu importe les dates, mais ce qu'il faut retenir c'est qu'il y a toujours eu une crise, une relance, une crise, une relance, et que justement la crise n'est pas forcément négative. Donc en 1945 les Europes sortent de la guerre ruinée, la France et la Grande-Bretagne sont incapables de s'entendre sur ce qu'ils veulent mettre dans l'Europe, donc il y a une première crise dès 1947 sur qu'est-ce qu'on veut mettre dans l'Europe. Première relance, la stratégie des petits pas, en fait la France se tourne vers l'Allemagne, son ancien ennemi juré, et le 9 mai donc 50, déclaration Schuman, qu'est-ce que c'est en gros ? C'est qu'on propose à certains pays, tous les pays européens qui veulent, de mettre en commun le charbon et l'acier. Économique, européenne, pardon, le charbon et l'acier. Pourquoi le charbon et l'acier ? Parce que ce sont les deux matériaux avec lesquels on fabrique les armes et les munitions, entre autres. Donc voilà de l'échec du couple franco-britannique, l'est le couple franco-allemand, donc une relance, mais un nouvel échec, quelques années après on se dit que si l'économie a marché, on va faire pareil sur la défense. La stratégie des petits pas c'est une stratégie fonctionnaliste, les pères de l'Europe se disaient on commence à faire petit, et comme une boule de neige on va en venir à une vraie Europe politique, ce qui était leur vision, leur objectif premier. En CED, l'Assemblée nationale française rejette la CED, c'est la catastrophe, on pense que l'Europe va s'arrêter, et en tout cas les fédéralistes savent qu'ils ont raté le coche. Mais dès 55 on relance, on se dit bon la défense ça n'a pas marché, on va continuer sur ce qui a marché, c'est-à-dire l'économie, donc on étend le charbon et l'acier au marché commun. Et là aussi c'est parti, ça remarche, jusqu'à ce que De Gaulle bloque plusieurs fois l'adhésion britannique, puisqu'elle a fait une demande d'adhésion par deux fois, et De Gaulle par deux fois l'a refusée, donc là dans les années 60, l'Europe est vraiment en crise au niveau politique. Une relance, suite aussi bien sûr au départ de De Gaulle, qui démissionne quelques mois avant, le sommet de la haie qui est la relance, et un an ou deux ans après, la Grande-Bretagne reviendra en Europe. Donc pour vous montrer en premier que les crises européennes sont inhérentes à la construction, ce n'est pas forcément négatif, l'historien permet de prendre du recul, de relativiser, et de rendre intelligibles les choses, les crises européennes ont toujours fait partie. En revanche là en 2014 il y a une crise, mais le problème c'est qu'on n'arrive pas à aller au-delà de ça. Une chose dans ma recherche qui prend vraiment beaucoup de temps, et là j'ai failli enlever ce slide parce qu'il mérite de passer du temps, c'est sur le rôle de la crise en tant que telle, donc là c'est un peu plus de la science politique on va dire, c'est un texte de Paul Ricoeur très important écrit en 1986, on s'interroge sur les concepts de la crise, qu'est-ce que ça veut dire en fait crise ? L'historien est aussi là pour ça, pour réfléchir sur les mots. Le premier sens de la crise c'est l'origine médicale, c'est-à-dire qu'il y a une crise de foi, vraiment ça, et c'est le moment décisif où se décide l'issue, en bien ou en mal. Donc c'est un peu vraiment l'apogée du moment, et après derrière on va aller vers autre chose. C'est un état de malaise profond, la crise d'ado, je pense que ça c'est assez clair, c'est un tournant dur à négocier, mais on n'est pas nécessairement en train de parler de destruction, on parle aussi de source de création. La crise est transitoire, et ça c'est très important, la crise est transitoire car elle précède un changement. C'est comme la banalité, après la pluie, le beau temps, logiquement après toute crise il doit y avoir quelque chose, un changement qui n'est pas fait forcément bénéfique, mais en tout cas un changement. Et la crise, et ça je vais vite car je pense que vous en savez plus que moi, la crise comme rupture de la continuité, le caractère discontinu de l'invention scientifique. Le progrès aussi se fait par une série d'échecs. Ne me dites pas que votre expérience et votre thèse, c'est un long fleuve tranquille. J'imagine que tout le monde vit dans son labo des moments de doute, des moments de crise, ça ne marche pas. Mais justement, la crise, c'est une discontinuité, c'est transitoire, mais il n'y a aucune idée de pathologie ou de malaise. Vous voyez déjà que j'essaie de redonner un peu de valeur au concept de crise. Dans ma thèse, c'est aussi un travail de source et même d'indexation et de métadonnées. Si on prend la presse de nos jours, vous allumez la radio, vous parlez avec quelqu'un. Quel est le vocabulaire ? Quel vocabulaire sort ? Vous lisez l'engueur, paralysie, défaitisme, agonie de l'imaginaire, nostalgie du passé, immobilisme, fatalisme, paresse, crise au singulier, au pluriel, la crise, une crise, des crises, un déclin, une économie en déclin. Donc, on est vraiment aujourd'hui, en 2014, sur une crise. Là, j'ai modifié ce que vous voyez en bleu, non plus sur une crise économique, ce qui est déjà l'écart, oui, effectivement, depuis au moins 2008, mais une crise de sens qui est vraiment importante. Alors, lorsqu'on pense à crise de sens et déclin et décadence, est-ce que c'est nouveau ? Est-ce que c'est en 2014 qu'on parle de décadence ? Donc, là aussi, une petite citation. C'est une citation assez connue de Husserl, sur une conférence à Vienne, en 1935. La décadence, l'idée de décadence, l'idée de crise, elle n'a pas des subprimes. Voilà, pour le dire pratiquement, c'est comme ça. Elle a toujours imprégné le XXe siècle. J'en suis là. Alors, la décadence, qu'est-ce que c'est ? Pour certains, c'est Oscar Wilde, pour d'autres, c'est le power metal scandinave. Pour moi, ça serait plutôt, peut-être, en tant qu'exemple, la chute de l'Empire romain. Lorsqu'on parle de décadence, tout le monde pense à la chute de l'Empire romain. Donc, je vous ai mis deux dates. Deux définitions sur la décadence, et j'aimerais y passer un peu de temps. Qu'est-ce qu'on entend par décadence ? Encore une fois, l'historien, il est toujours en train de triturer les mots, de décortiquer, de revenir. Rien n'est jamais arrêté sur les mots. Je pense que vous aussi, rien n'est jamais arrêté sur un résultat. Rien n'est jamais arrêté sur une hypothèse de travail. Et nous, parfois, voilà, on triture. Et la décadence a largement été discutée, commentée, analysée, depuis très longtemps. Le principal sens de décadence, et comment les gens l'emploient, c'est au niveau biologique. C'est une dégénérescence. Alors, pour ceux que ça intéresse, c'est un auteur très, très connu à l'époque, qui s'appelle Oswald Spengler, un philosophe allemand qui a sorti la décadence de l'Occident, juste après la Première Guerre mondiale. Et pour lui, c'est une évidence, toute civilisation, là, je vous demande votre attention, parce que c'est un point important que j'aimerais que vous compreniez, toute civilisation est amenée comme un être humain, à naître, à croître, à arriver à son apogée, et forcément, automatiquement, systématiquement, à dégénérer et à détruire. Quelles sont les causes ? Pourquoi là, n'est pas le sujet de ma présentation ? Mais voilà, c'est une dégénérescence au sens biologique du terme. Perte des valeurs, impossible de penser son histoire, paralysie, agonie, et puis destruction, qu'elle soit lente ou qu'elle soit soudaine. Et des exemples de chutes de civilisations à travers le monde, on peut en citer des quantités. Donc, la plus connue, c'est la chute de l'Empire romain. Ne me demandez pas pourquoi l'Empire romain a chuté. Il existe 45 versions de 45 auteurs différents. Est-ce que c'était un délitement ? Est-ce que c'était une perte des valeurs ? Est-ce que c'est l'aristocratie ? Est-ce que c'est de toute manière l'évidence face aux inventions barbares ? Là n'est pas la question, mais c'est pour vous montrer que certaines personnes partent du principe que toute civilisation est amenée à dégénérer et à être donc décadent parce qu'elle perd ses valeurs. Un autre, j'ai écrit en tout petit, c'est une historienne qui s'appelle Maroui, qui a écrit un article assez connu aussi, enfin assez connu dans le monde de la recherche en histoire, bien sûr. C'est la décadence comme un oubli nécessaire. On peut très bien imaginer que la décadence, c'est on arrive à un moment donné, on va perdre des choses, mais c'est préalable à une transformation. Et toute la discussion est, lorsque la civilisation agonise et se détruit, est-ce que c'est une fin ou est-ce que c'est une transformation ? Est-ce que c'est une fin de cycle ou est-ce que le cycle se renouvelle ? Voilà, je vous ai mis courrier international, l'Occident est-il fini ? Alors, parce que certaines personnes savent que je dors et je vis avec Raymond Aron depuis pas mal d'années, je vous ai mis une citation que j'aimerais commenter, qui est très importante et c'est un pan de ma recherche dont j'aimerais vous parler. C'est assez long, la conscience que ces régimes peuvent susciter, les régimes démocratiques, la conscience que ces mêmes régimes peuvent susciter une sorte de guerre civile permanente, les citoyens y devenir de purs consommateurs, les groupes de pression s'y multiplier et paralyser l'État. Il est légitime de se demander, à la suite de Pareto et de beaucoup d'autres, si l'épanouissement des libertés, le pluralisme des convictions, l'hédonisme individualiste ne mettent pas en péril la cohérence des sociétés et leur capacité d'action. Pareto, auteur italien entre les deux guerres, dont s'est inspiré certains auteurs de l'Allemagne nazie, qui a surtout parlé sur la destruction des élites. Sur ce point-là, c'est très important et ce n'est pas du tout une provocation. Beaucoup de chercheurs se posent la question si la principale cause de l'Occident, donc là, au-delà de l'Europe, je parle de l'Occident, ce n'est pas la démocratie. Donc, ce n'est pas forcément tous des fachos de droite ou tous des royalistes, pas du tout. Ils se posent la question si la démocratie, en tant que telle, bien sûr, c'est le meilleur à l'exception de tous les autres, tout le monde connaît ça, mais si les défauts ou en tout cas les petits aléas de la démocratie font que l'État se paralyse et font que forcément, il y a une destruction de la civilisation. Revenons un peu en détail, une sorte de guerre civile permanente. Aron, à un moment donné, dit dans ses écrits, l'URSS, à l'époque de la guerre froide, bien sûr, forcément, elle avance, puisque ces personnes, je simplifie beaucoup, bien sûr, mais si en tout cas une décision est plus vite prise et plus vite, comment dire, amendée et mise en pratique qu'une décision démocratique, donc ainsi, il faut discuter. Et on est à la recherche du compromis. Mais est-ce que la recherche du plus petit compromis possible, ce n'est pas justement quelque chose qui va paralyser ou qui va en tout cas affaiblir les groupes de pression ? S'y multiplier et paralyser l'État, naturellement, Aron ne remet pas en question ces groupes de pression, il remet en question ou il se pose la question, est-ce qu'avoir X groupes de pression ne paralysent pas l'État ? Oui, forcément, mais de dire oui forcément, ce n'est pas être le dernier des hommes. Donc il est légitime de se demander la suite de Pareto et de beaucoup d'autres, si l'épanouissement des libertés, le pluralisme des convictions et l'hédonisme individualiste ne mettent pas en péril la cohérence des sociétés. Marcel Gaucher, si vous connaissez, auteur français qui travaille beaucoup sur la démocratie, en parle aussi depuis une centaine d'années. Naturellement, c'est le droit de l'individu, c'est le droit à l'individualité, c'est moi-je. Mais forcément, quand on dit moi-je, la problématique, ce n'est pas forcée, mais la problématique, c'est que la société, le tout, l'ensemble peut en pâtir. L'épanouissement des libertés, le pluralisme des convictions, l'hédonisme individualiste ne mettent pas en péril, c'est surtout la capacité d'action. C'est un peu comme si dans une société, dans une entreprise, on était en parfaite démocratie, il n'y avait pas un chef qui tranchait à un moment donné. Forcément, oui, ça paralyse. Forcément, on va vers le plus petit notaire commun. Forcément, c'est plus long. Forcément, ils sont paralysés en termes de cohérence et de capacité. Donc voilà, est-ce qu'on va vers la vie et mort, avec une faute d'orthographe, pardon, sur la mort d'une civilisation ? C'est une partie importante de ma recherche. Est-ce qu'une civilisation est amenée forcément à mourir ou si elle est amenée à se recycler ? Alors, qu'est-ce qu'on fait de la décadence ? Après avoir dit tout ça, est-ce que c'est un concept opératoire ? Un concept opératoire, en histoire, c'est quelque chose qui nous permet de… C'est comme un levier. Je m'appuie dessus pour travailler. C'est une grille de lecture. Je ne dis pas que c'est bien ou pas bien. Je dis qu'il est légitime de prendre la décadence comme concept opératoire pour travailler, pour décortiquer un peu. Donc c'est un jugement moral et non un jugement de fait. Voilà, mais c'est ce que je dis, la décadence est opératoire. C'est une médiation sur le sens de l'histoire. Au 19e, tout le monde parlait du positivisme et la notion de progrès. Début du 20e aussi, mais à partir de la Première Guerre mondiale et qui a été vraiment le choc. On ne réalise pas comme la Première Guerre mondiale a été un choc pour les gens, dans les millions de morts. Donc on peut s'autodétruire beaucoup plus. Enfin beaucoup plus. Tout le monde a bien sûr en tête la Seconde Guerre mondiale, mais la Première Guerre mondiale a vraiment été un choc. On peut s'autodétruire et on est en train de décliner parce que nous, Europe, on est en train de s'autodétruire. Donc oui, c'est une médiation sur le sens de l'histoire. Elle agit comme un repoussoir et surtout, elle imprène la pensée européenne, vraiment depuis le 19e et jusqu'à maintenant. Alors voilà où est-ce qu'on en est. C'est bientôt, j'arrive presque à la fin. Voilà où est-ce qu'on en est. Je suis parti de l'Europe, crise économique, le rôle des crises. La décadence, est-ce que c'est une médiation ? Est-ce que la démocratie est décadente ? C'est une petite partie, je n'ai pas voulu détailler plus. Est-ce que c'est la fin de l'histoire ? Est-ce qu'on arrive, voilà, est-ce qu'on est de toute manière amené à être décadent ? Alors on espère que non, parce que l'homme a une capacité de réinvention insoupçonnée. L'humanité n'avance qu'en se vouant au problème qu'elle est incapable de se résoudre. Je trouve que c'est plutôt une belle phrase. C'est donc Marcel Gaucher. Un petit point sur Marcel Gaucher, pour ceux que ça intéresse, il travaille beaucoup sur les problématiques de la démocratie en 2014. Légitimisme des opinions, protestations et révolutions. Il dit à force de faire des manifestations, on proteste. Mais voilà, on ne fait ni des révolutions ni des manifestations et c'est loin d'être constructif. Alors, pour revenir, et c'est vraiment ce que j'aimerais, c'est peut-être le slide le plus important, c'est en fait au travers de l'Europe, je vous parle plus de la crise que de l'Europe. L'Europe, c'est un prétexte. Lorsque je fais mes recherches, voilà, je suis européen convaincu et je le prends comme un prétexte. Mais je travaille plus sur le rôle de la crise. Donc la crise, elle est consubstantielle. Si on la remplace par tension, c'est l'acte de choisir. Mais à un moment donné, il faut choisir. À un moment donné, il faut avancer. Et je vais vous parler de l'Europe en 2014 dans le dernier slide. La crise, elle est ici comprise comme action de jugement. La crise est alors l'acte de trancher. Et en s'identifiant à une cause qui nous transcende, c'est-à-dire qui dépasse notre capacité, qui nous dépasse, nous, en tant qu'êtres humains, on va vers un engagement. Et alors, c'est une véritable sortie de crise. Et là, c'est Paul Ricoeur qui dit « La crise naît ainsi au carrefour où l'engagement est en lutte avec la tendance à l'inertie, à la fuite et à la désertion » Et l'Europe en 2014, de sens politique, de vision, d'avenir, de rêve, mettez tous les qualificatifs que vous voulez au travers ça, elle est vraiment en lutte avec l'inertie, avec le fatalisme, avec la fuite et vers la désertion. Et donc avant dernier slide où je résume à peu près tout ce que j'ai voulu vous dire, je suis parti d'abord de l'identité européenne et de l'idée européenne. Je vous rappelle rapidement, la paix est une chose effective, mais ce n'est plus nécessaire, dans le sens où ça y est, on y est arrivé, mais maintenant il faut aller au-delà. La transcendance, c'est-à-dire le sentiment européen, il est quand même très très mal engagé actuellement. On pourrait discuter de la poussée des parties d'extrême droite, en tout cas, sur le sentiment européen. Les pères de l'Europe n'ont jamais réussi à faire naître un véritable sentiment européen. Peut-être que pour avoir un sentiment européen, il faut que ça nous touche. L'Europe de la culture, l'Europe du sport, ça existe, mais malheureusement trop morcelé. L'économie, si c'était un des plus grands succès, parce qu'on ne se rend pas compte, mais en 1945, l'Europe est ruinée, quand je vous dis ruinée, c'est-à-dire des ruines au sens propre et au sens figuré. Et fin des années 1960, elle devient vraiment un candidat et un concurrent très très important des États-Unis. Maintenant, l'Europe, c'est encore le plus grand marché mondial au sens propre du terme, mais l'économie va mal. L'identité, on en a parlé, l'identité européenne en question. Moi, dans mon séminaire en troisième année, je fais un jeu, je dis aux élèves, sortez-moi un lieu de mémoire, une personne, une date, et ne me dites pas Charlemagne, 9 mai 1950 et Auschwitz. Dites-moi autre chose. Quel est le mythe en 2014 de l'Europe ? C'est le moine au XIIe siècle qui faisait tous les monastères, c'est quoi ? C'est l'Inquisition, c'est le roman européen, qu'est-ce que c'est ? C'est quand même très difficile à trouver. Je vous ai montré que durant la construction européenne, les crises étaient inhérentes à la construction et qu'on avait toujours des relances. L'inconvénient, c'est qu'en 2014, la relance, elle se fait attendre. Il y avait une crise économique et une crise de sens, donc le rôle des crises, un rôle pas forcément négatif. On pouvait aller vers la décadence, démocratie ou médiation, mort d'une civilisation. Là, on en est là, la crise de sens, il faudrait un acte de choisir et l'engagement. Est-ce qu'on est sur une crise sans fin ? Je l'ai rajouté un quart d'heure avant, tout à l'heure. C'est un auteur que je suis en train de lire et qui est très intéressant et qui indique que le gros problème de l'Europe actuellement est de la crise et que tous les jours aux infos, on ne parle même pas d'une crise, on parle de la crise. Je ne sais pas si vous voyez le changement de vocabulaire. Une crise, c'est un temps, un début et une fin. On sait qu'il va y avoir quelque chose. Maintenant, la crise, c'est comme si c'était un état d'esprit. Oui, vous savez, on est en crise et ça alimente et ça argumente tout. C'est une crise sans fin. Il n'y a même pas de vision d'avenir. On va en sortir, mais quand, comment, pourquoi ? Est-ce que c'est la crise sans fin ? L'acte de choisir et l'engagement. Là, j'avais mis une petite couverture aussi d'economiste, qu'est-ce qu'il faut faire ? Et ce que, dans ma thèse, je montre aussi, pour finir quand même sur une note positive, ça fera plaisir à Pierre-Emerick qui m'avait dit quand même, sois positif, Olivier, à la fin de ton présentation, c'est que tout est à faire parce que tout est possible. Et on parle de vitalité historique. La vitalité, c'est la possibilité de dire jeu, de penser son histoire. Et Raymond Aron et d'autres s'appuient sur Machiavel, non pas sur Machiavel, le prince, comme tout le monde connaît, mais sur son opposition entre la vertu et la fortune, pour ceux qui connaissent, la fortune, c'est le hasard, la vertu, c'est la capacité à choisir, à modifier, à décider, à aller au-delà. L'histoire est tragique, dans le sens propre du terme, on en est tous d'accord, mais il faut être vertueux, enfin pas dans le sens vertueux, au sens moral du terme, bien sûr que non, mais il faut avoir la capacité à avoir une vitalité historique. Et donc, toute ma recherche, c'est le balancier, on va dire, c'est le va-et-vient, l'Europe au milieu, entre le marteau et l'enclume, entre la décadence et la vitalité historique. Penser la complexité, donc l'histoire doit parler au présent, j'ai bien conscience que tout ça, dans trois jours, tout le monde aura oublié, et ce n'est pas ça l'intérêt. Moi, quand je fais de l'histoire et quand j'en parle, à mes élèves, j'en ai 15, attention, mais en tout cas, lorsque je parle de l'histoire à certaines personnes, peu importe qu'on se souvienne des dates, l'important, c'est que l'histoire, elle parle au présent, elle rend intelligible le présent. La culture historique, ça ne sert pas à savoir 1515, Marignan et après, on en a un, mais ça sert à savoir ce qui s'est passé avec François 1er et compagnie, ou la Révolution, comme je vous ai montré, elle doit parler au présent, peu importe les faits, les dates, vous prenez Wikipédia, mais une culture historique doit logiquement vous aider à mieux lire un article du monde. Ne serait-ce que ça, moi, je trouve qu'en tant que vaquetaire ou en tant que chercheur, j'aurais gagné mon pari. Et donc, toute petite synthèse très vite sur la crise, c'est une rupture ou c'est un moment décisif, on peut mesurer une crise, les enjeux, la complexité, l'intensité, la durée, j'en ai pas parlé, j'en parle aussi dans ma recherche, mais en 2014, on peut être conscient qu'on parle d'une crise vraiment complexe et intense avec de graves enjeux, et mon trio avec qui je me balade tout le temps, c'est la crise, la décadence et la vitalité historique. Merci."
}