{
    "original_file_name": "RI1.mp4",
    "language": "fr",
    "sentences": [
        {
            "start": 0,
            "end": 12,
            "text": "Bonjour, nous entamons aujourd'hui la dernière thématique qui sera traitée dans ce cours spécifique de la ST4 et qui traite de l'apprentissage pour la recherche d'informations."
        },
        {
            "start": 12,
            "end": 20,
            "text": "Ce sera un cours en deux parties, il y aura donc la suite de ce cours qui sera le sujet de la prochaine séance."
        },
        {
            "start": 20,
            "end": 35,
            "text": "Rapidement, pour introduire ce nouveau paradigme pour la recherche d'informations, je vais d'abord revenir sur les systèmes de recherche d'informations classiques que nous avons vus jusqu'alors."
        },
        {
            "start": 35,
            "end": 53,
            "text": "Ce que nous avons vu jusqu'alors, c'est que pour une requête de NéQ qui traduit un besoin d'information, une collection de documents qui est indexée, on a vu un certain nombre de modèles de recherche qui permettent de retourner une liste ordonnée de documents."
        },
        {
            "start": 53,
            "end": 59,
            "text": "Ces modèles de recherche peuvent être divers, nous en avons vu plusieurs lors de ce cours."
        },
        {
            "start": 59,
            "end": 87,
            "text": "Par exemple, ici, ce modèle de recherche pourrait être la probabilité de pertinence sachant Q et D et qui pourrait être estimée en utilisant par exemple le modèle BM25 qui est fonction de l'IDF et puis d'une fonction de pondération portant sur la fréquence des termes dans un document et puis une normalisation par la longueur du document."
        },
        {
            "start": 87,
            "end": 98,
            "text": "Tout au long du cours, on a vu plusieurs types de modèles, des modèles basés similarités comme le modèle booléen ou le modèle vectoriel."
        },
        {
            "start": 98,
            "end": 107,
            "text": "On a aussi présenté plusieurs modèles probabilistes, notamment le modèle d'indépendance binaire et le modèle BM25."
        },
        {
            "start": 107,
            "end": 125,
            "text": "Et puis, plus dernièrement, on a présenté des modèles qui prennent en compte la structure de la collection et notamment tous les modèles qui sont basés sur une analyse des liens de la collection, comme par exemple le modèle du page rank ou le modèle head."
        },
        {
            "start": 125,
            "end": 130,
            "text": "Quelques discussions sur ces modèles de classement."
        },
        {
            "start": 130,
            "end": 137,
            "text": "Pour un modèle particulier, on a vu que le paramétrage est souvent difficile, surtout quand il y a beaucoup de paramètres."
        },
        {
            "start": 137,
            "end": 150,
            "text": "Typiquement, pour le modèle vectoriel, quelle est la bonne mesure de pondération à utiliser pour le document pour la requête, quelle est la bonne distance à utiliser, etc."
        },
        {
            "start": 150,
            "end": 153,
            "text": "Pour comparer deux modèles, on a vu aussi que c'était compliqué."
        },
        {
            "start": 153,
            "end": 157,
            "text": "Ça, c'est notamment tout le cours qui a trait à l'évaluation."
        },
        {
            "start": 157,
            "end": 168,
            "text": "La comparaison rigoureuse, c'est quelque chose qui est assez difficile et notamment en recherche d'informations, on met plutôt en œuvre des évaluations par benchmark, donc une évaluation empirique."
        },
        {
            "start": 168,
            "end": 175,
            "text": "On peut souvent être dans des problématiques où on est dans des cas de surparamétrage."
        },
        {
            "start": 175,
            "end": 186,
            "text": "Et puis, si cette fois-ci on prend une collection de modèles, par exemple l'ensemble des modèles probabilistes versus l'ensemble des modèles par similarité, ça se complexifie."
        },
        {
            "start": 186,
            "end": 189,
            "text": "On a notamment beaucoup de modèles qui existent."
        },
        {
            "start": 189,
            "end": 194,
            "text": "Dans la littérature, on en dénombre plus d'une centaine, voire maintenant même des milliers."
        },
        {
            "start": 194,
            "end": 199,
            "text": "Et il y a plusieurs questions qui peuvent se poser, notamment quel est le meilleur des modèles ?"
        },
        {
            "start": 199,
            "end": 204,
            "text": "Comment je peux comparer ces modèles et éventuellement comment je peux les combiner ?"
        },
        {
            "start": 204,
            "end": 215,
            "text": "Les systèmes actuels, notamment les systèmes de recherche web que vous utilisez quotidiennement, pour une requête donnée, ils calculent souvent plusieurs centaines de fonctions de score de base."
        },
        {
            "start": 215,
            "end": 220,
            "text": "Entre cette requête et chaque document de la collection, et ils combinent ces scores."
        },
        {
            "start": 220,
            "end": 223,
            "text": "Donc une question clé, c'est comment combiner ces scores ?"
        },
        {
            "start": 223,
            "end": 228,
            "text": "Et notamment, ça c'est toute la science qu'on appelle la science des CEO."
        },
        {
            "start": 228,
            "end": 243,
            "text": "Avec typiquement, vous pourrez trouver un ensemble d'articles assez généralistes qui justement parlent des 200 facteurs de classement de Google et qui donnent des recommandations, notamment si vous voulez que votre site web soit bien référencé."
        },
        {
            "start": 243,
            "end": 250,
            "text": "Il y a un paquet d'illustrations assez rigolotes d'ailleurs sur ces facteurs et paramètres."
        },
        {
            "start": 250,
            "end": 266,
            "text": "Alors voilà, notamment une illustration sous la forme d'une table périodique, justement des facteurs de succès des SEO, notamment pour tout ce qui est référencement de site web."
        },
        {
            "start": 266,
            "end": 272,
            "text": "Avec donc des facteurs qui sont propres à la page, des facteurs qui sont extérieurs, contextuels, etc."
        },
        {
            "start": 272,
            "end": 277,
            "text": "Il y a toute une littérature sur ce sujet là."
        },
        {
            "start": 277,
            "end": 302,
            "text": "Voilà, et c'est là qu'intervient l'apprentissage pour la recherche d'informations, parce qu'en fait les techniques d'apprentissage automatique, c'est des bons outils pour le paramétrage automatique, pour combiner plusieurs évidences, donc la question de la combinaison et de la fusion des scores dont on parlait juste avant, et puis ils permettent aussi d'éviter le surparamétrage."
        },
        {
            "start": 302,
            "end": 314,
            "text": "Donc toutes ces approches d'apprentissage pour la RI, elles ont un nom, c'est ce qu'on appelle le Learning to Rank, et ça rassemble l'ensemble des méthodes qui vont utiliser des approches d'apprentissage pour le problème de l'ordonnancement."
        },
        {
            "start": 314,
            "end": 323,
            "text": "C'est la science qu'on appelle la science d'apprendre à ordonner, et qui a explosé dans le domaine de la recherche d'informations à partir de 2005."
        },
        {
            "start": 323,
            "end": 331,
            "text": "Tous les moteurs de recherche actuels utilisent des approches à base d'apprentissage, et même aujourd'hui à base d'apprentissage profond."
        },
        {
            "start": 331,
            "end": 341,
            "text": "Notamment, ce dont on va parler aujourd'hui, c'est l'optimisation automatique à l'aide d'algorithmes d'apprentissage de la fonction d'ordonnancement."
        },
        {
            "start": 341,
            "end": 348,
            "text": "Et donc on va introduire un nouveau modèle pour la recherche d'informations qui va suivre ce schéma-là."
        },
        {
            "start": 348,
            "end": 365,
            "text": "C'est-à-dire qu'on va considérer un ensemble de données, qui vont être nos données d'apprentissage, qui sont composées de requêtes et d'un ensemble de documents qui sont associés à ces requêtes, et bien sûr de jugements de pertinence entre cette requête et ces documents."
        },
        {
            "start": 365,
            "end": 370,
            "text": "Donc ça on va le faire, on va prendre en compte des données pour plusieurs requêtes."
        },
        {
            "start": 370,
            "end": 385,
            "text": "Et puis sur cet ensemble de données, qu'on va appeler l'ensemble d'apprentissage, on va utiliser un système d'apprentissage qui va apprendre une fonction de classement F de QD."
        },
        {
            "start": 385,
            "end": 413,
            "text": "Et puis pour une nouvelle requête, Q de M plus 1, et notre ensemble de documents, notre collection qui reste indexée, avec l'ensemble des principes d'indexation qu'on a vus jusqu'alors, et bien on va appliquer ce modèle appris, ce système d'ordonnancement appris, pour classer les documents pertinents pour la requête QI de M1, avec ce modèle d'apprentissage."
        },
        {
            "start": 413,
            "end": 416,
            "text": "Donc on aura toujours en sortie une liste ordonnée de documents."
        },
        {
            "start": 416,
            "end": 418,
            "text": "Ça, ça ne change pas."
        },
        {
            "start": 418,
            "end": 433,
            "text": "Ce qui change, c'est vraiment ce système d'apprentissage qui va utiliser des données d'apprentissage pour apprendre cette fonction d'ordonnancement, qui elle ensuite est utilisée de manière classique dans un système d'ordonnancement."
        },
        {
            "start": 433,
            "end": 449,
            "text": "Donc l'apprentissage pour l'AERI, en fait, il va reposer sur deux concepts principaux, qui sont la notation des données et la représentation des couples requêtes documents dans un espace de caractéristiques qu'il faudra déterminer."
        },
        {
            "start": 449,
            "end": 456,
            "text": "Ça, c'est une étape très importante, qu'on appelle l'étape de description ou feature engineering."
        },
        {
            "start": 456,
            "end": 478,
            "text": "Et puis, il y a la phase d'apprentissage en tant que telle, avec l'utilisation d'une structure d'apprentissage en deux étapes assez classique, avec une étape d'apprentissage de la fonction d'ordonnancement F de QD, et puis une étape de test, d'utilisation du modèle appris sur de nouvelles requêtes."
        },
        {
            "start": 478,
            "end": 497,
            "text": "Voilà, donc au final, on a vraiment ce schéma-là pour la recherche d'informations avec apprentissage, donc pour le learning to rank, un ensemble de jeux de données d'apprentissage qui sont composés de couples requêtes documents qu'on va décrire."
        },
        {
            "start": 497,
            "end": 507,
            "text": "Voilà, donc notamment, en fait, une grosse partie du travail, ça va être de constituer ce vecteur X, qui est un vecteur caractéristique de ce couple requêtes documents."
        },
        {
            "start": 507,
            "end": 519,
            "text": "Ces données, elles sont labellisées, c'est-à-dire qu'on a une vérité terrain, et cette vérité terrain, en fait, elle est fonction de la pertinence du document D1 pour la requête Q1."
        },
        {
            "start": 519,
            "end": 525,
            "text": "Et puis, donc, on a un système d'apprentissage qui va reposer sur l'optimisation d'une fonction et d'un critère."
        },
        {
            "start": 525,
            "end": 532,
            "text": "On va donc, en sortie, avoir un modèle F qui est appris à partir de ces données d'apprentissage."
        },
        {
            "start": 532,
            "end": 548,
            "text": "Et puis, donc, on a nos nouvelles données qui sont nos données de test ou nos données de production où, cette fois-ci, on n'a pas la vérité terrain, donc on n'a pas les valeurs de pertinence, et l'objectif, ça va être justement de prédire ces valeurs avec le modèle appris."
        },
        {
            "start": 548,
            "end": 560,
            "text": "Donc, on va décrire de la même manière le couple Q1 D1, et puis, en fait, ce que va retourner le système d'ordonnancement, c'est une liste ordonnée des documents, donc selon cette fonction d'ordonnancement."
        },
        {
            "start": 560,
            "end": 572,
            "text": "On va donc détailler tous ces concepts lors de ce cours, et je vais d'abord vous rappeler quelques généralités sur l'apprentissage, et notamment l'apprentissage supervisé."
        },
        {
            "start": 572,
            "end": 579,
            "text": "Puis, on parlera du cas spécifique de la catégorisation de documents appliqués à la recherche d'informations."
        },
        {
            "start": 579,
            "end": 583,
            "text": "On parlera donc de la recherche d'informations et de l'ordonnancement."
        },
        {
            "start": 583,
            "end": 601,
            "text": "Et puis, la semaine prochaine, on parlera plus spécifiquement, donc on continuera à la partie arrière d'ordonnancement, et on parlera aussi plus spécifiquement des données d'apprentissage à utiliser ou à constituer, et des différents jeux de tests qui sont à disposition de la communauté."
        },
        {
            "start": 601,
            "end": 606,
            "text": "Donc, pour commencer, quelques généralités sur l'apprentissage."
        },
        {
            "start": 606,
            "end": 623,
            "text": "On va considérer un processus d'inférence en trois étapes, où la première étape va être d'observer un phénomène, puis à partir de cette observation du phénomène, à partir de données d'observation de ce phénomène, on va construire un modèle associé à ce phénomène."
        },
        {
            "start": 623,
            "end": 629,
            "text": "Et puis, l'idée, c'est ensuite d'utiliser ce modèle pour faire des prédictions relatives justement à ce phénomène."
        },
        {
            "start": 629,
            "end": 634,
            "text": "L'apprentissage automatique, c'est l'automatisation de ce processus d'inférence."
        },
        {
            "start": 634,
            "end": 646,
            "text": "Avec une hypothèse forte qui dit qu'il existe des relations entre les données et que les algorithmes d'apprentissage vont nous permettre de les trouver."
        },
        {
            "start": 646,
            "end": 656,
            "text": "Il existe différentes familles d'algorithmes d'apprentissage, et classiquement, on les catégorise selon deux grands axes."
        },
        {
            "start": 656,
            "end": 663,
            "text": "Le premier axe, c'est le mode d'apprentissage, avec différents modes d'apprentissage assez connus."
        },
        {
            "start": 663,
            "end": 678,
            "text": "Notamment l'apprentissage supervisé, pour lequel on va vouloir apprendre des relations entre des entrées et des sorties, avec un oracle qui nous donne des exemples qui vont exprimer ces relations."
        },
        {
            "start": 678,
            "end": 688,
            "text": "On va avoir à disposition ce qu'on va appeler un ensemble d'apprentissage, avec des données d'entrée qui vont être labellisées."
        },
        {
            "start": 688,
            "end": 692,
            "text": "L'autre mode d'apprentissage, c'est l'apprentissage non supervisé."
        },
        {
            "start": 692,
            "end": 700,
            "text": "Cette fois-ci, on n'a pas d'oracle, donc on n'a pas d'exemple qui exprime des relations entre des entrées et des sorties."
        },
        {
            "start": 700,
            "end": 705,
            "text": "Ce qu'on va chercher à faire, c'est apprendre une structure dans un ensemble de données."
        },
        {
            "start": 705,
            "end": 711,
            "text": "Typiquement, ces techniques d'apprentissage non supervisé, c'est toutes les techniques qu'on appelle les techniques de clustering."
        },
        {
            "start": 711,
            "end": 721,
            "text": "Et puis, on a d'autres paradigmes, comme par exemple l'apprentissage semi-supervisé, où l'objectif, c'est toujours bien d'apprendre les relations entre des entrées et des sorties."
        },
        {
            "start": 721,
            "end": 730,
            "text": "Parmi les exemples à notre disposition, l'oracle nous fournit la sortie seulement pour un petit nombre de ces exemples."
        },
        {
            "start": 730,
            "end": 744,
            "text": "L'idée de l'apprentissage semi-supervisé, ça va être de tirer parti de ces exemples, et l'idée de l'apprentissage semi-supervisé, ça va être de tirer parti des autres données, c'est-à-dire des données sans étiquettes."
        },
        {
            "start": 744,
            "end": 764,
            "text": "C'est un mode d'apprentissage qui revient beaucoup au goût du jour, notamment à cause du succès des techniques d'apprentissage profond, qui nécessitent lors de la phase d'apprentissage d'énormément de données supervisées, donc de données annotées, qui sont coûteuses à obtenir à grande échelle."
        },
        {
            "start": 764,
            "end": 775,
            "text": "Les données sans annotation sont moins coûteuses à obtenir, et l'idée du semi-supervisé, c'est aussi de tirer parti de ces données qui sont plus faciles à obtenir."
        },
        {
            "start": 775,
            "end": 782,
            "text": "On peut aussi classer les techniques d'apprentissage selon le type de problème qu'on souhaite traiter."
        },
        {
            "start": 782,
            "end": 790,
            "text": "Typiquement, pour les algorithmes d'apprentissage supervisé, on a souvent deux grands types de problèmes, le problème qu'on appelle la régression et la classification."
        },
        {
            "start": 790,
            "end": 794,
            "text": "Ce qui différencie ces problèmes, c'est le type des valeurs de sortie."
        },
        {
            "start": 794,
            "end": 807,
            "text": "Typiquement, pour la régression, on va chercher à prédire une valeur continue, et pour la classification, on va chercher à prédire une valeur dans un ensemble discret, dans un ensemble de classes discrètes."
        },
        {
            "start": 807,
            "end": 832,
            "text": "On a aussi beaucoup d'autres approches, beaucoup d'autres familles d'apprentissage, notamment l'apprentissage par renforcement, qui est connu, parce que c'est notamment le type d'apprentissage qui a été mis en oeuvre en partie dans AlphaGo, qui a vaincu l'Isédol au jeu de Go, et qui consiste à apprendre un comportement face à diverses situations, en optimisant une récompense quantitative."
        },
        {
            "start": 832,
            "end": 850,
            "text": "On a aussi l'apprentissage actif, où on va demander à un utilisateur ou un pôle d'utilisateurs d'annoter un sous-ensemble de données de manière incrémentale."
        },
        {
            "start": 850,
            "end": 856,
            "text": "Et puis prendre en compte ce sous-ensemble de données à noter au fur et à mesure pour améliorer notre modèle."
        },
        {
            "start": 856,
            "end": 864,
            "text": "Et puis il y a d'autres modes d'apprentissage, comme l'apprentissage par analogie, le méta-apprentissage, etc."
        },
        {
            "start": 864,
            "end": 869,
            "text": "Dans ce cours, on va principalement se référer à l'apprentissage supervisé."
        },
        {
            "start": 869,
            "end": 874,
            "text": "Je vais déjà commencer par rappeler quelques principes de l'apprentissage supervisé."
        },
        {
            "start": 874,
            "end": 890,
            "text": "On va considérer un espace d'entrée X qui est inclus dans Rd, et un espace de sortie Y qui est inclus dans R. On peut par exemple vouloir prédire une valeur dans R, ou on va pouvoir aussi vouloir prédire des catégories."
        },
        {
            "start": 890,
            "end": 896,
            "text": "La régression prédit une valeur dans R, ou catégorie, donc ça va être des choses discrètes."
        },
        {
            "start": 896,
            "end": 944,
            "text": "L'hypothèse fondamentale de l'apprentissage supervisé, c'est cette hypothèse-là, qui dit que les paires d'exemples XY sont IID, c'est-à-dire qu'elles sont identiquement et indépendamment distribuées suivant une distribution de probabilité fixe, mais qui est inconnue, D. Ce qu'on a à disposition, c'est un ensemble d'échantillons, c'est-à-dire une séquence de n paires XY qui sont donc bien sûr générées suivant cette distribution de probabilité fixe, mais inconnue, D. Cet ensemble de couples, de paires XY, c'est ce qu'on appelle l'ensemble d'apprentissage."
        },
        {
            "start": 944,
            "end": 959,
            "text": "Le but de l'apprentissage supervisé, ça va être de construire une fonction F qui va de X dans Y et qui va prédire la sortie Y d'une nouvelle observation X avec une probabilité d'erreur minimale."
        },
        {
            "start": 959,
            "end": 996,
            "text": "La plupart des techniques d'apprentissage supervisé reposent sur des travaux théoriques, notamment qu'on doit à Vladimir Vapnik et ses collègues, et qui a montré qu'on pouvait borner la probabilité d'erreur, donc cette probabilité d'erreur qu'on veut minimale, RF, qui est le risque fonctionnel, je reviendrai sur cette notion juste un peu plus tard, par l'erreur empirique de F, l'erreur qu'on va pouvoir mesurer sur l'ensemble d'apprentissage, plus deux termes qui sont fonction de la complexité de la classe de fonctions, donc la classe de fonctions F qu'on va choisir."
        },
        {
            "start": 996,
            "end": 1007,
            "text": "Par exemple, on pourrait prendre la classe des fonctions linéaires ou d'autres classes de fonctions, plus un terme résiduel."
        },
        {
            "start": 1007,
            "end": 1015,
            "text": "Donc la question fondamentale de l'apprentissage supervisé, c'est comment choisir F ?"
        },
        {
            "start": 1015,
            "end": 1021,
            "text": "Juste quelques remarques importantes sur l'apprentissage supervisé, des choses à retenir."
        },
        {
            "start": 1021,
            "end": 1030,
            "text": "La seule observation dont on dispose, c'est l'ensemble des couples XY, c'est notre échantillon, notre ensemble d'apprentissage D est inconnu."
        },
        {
            "start": 1030,
            "end": 1038,
            "text": "Je viens de le dire, cet échantillon, cet ensemble C, c'est ce qu'on appelle l'ensemble d'apprentissage."
        },
        {
            "start": 1038,
            "end": 1047,
            "text": "Donc X, ça appartient à grand X, et en général, on prend une représentation vectoriale, donc X est inclus dans grand Rd."
        },
        {
            "start": 1047,
            "end": 1064,
            "text": "Dans notre cas, X, ça va consister en un document, et on va représenter ce document par un vecteur dans l'espace vectorial des termes, en utilisant la représentation sac de mots qu'on a introduit plus tôt dans le cours."
        },
        {
            "start": 1064,
            "end": 1074,
            "text": "Y, ça appartient à Y, et par exemple, si on a un problème de catégorisation binaire, on considère souvent que Y, c'est moins un ou plus un."
        },
        {
            "start": 1074,
            "end": 1078,
            "text": "Dans notre cas, c'est assez facile de se ramener à un problème de catégorisation binaire."
        },
        {
            "start": 1078,
            "end": 1084,
            "text": "Typiquement, on peut vouloir classer les documents en documents pertinents versus documents non pertinents."
        },
        {
            "start": 1084,
            "end": 1091,
            "text": "On classe la classe des documents pertinents versus la classe des documents non pertinents."
        },
        {
            "start": 1091,
            "end": 1094,
            "text": "Revenons à l'objectif de l'apprentissage supervisé."
        },
        {
            "start": 1094,
            "end": 1110,
            "text": "On l'a dit tout à l'heure, on cherche à construire une fonction F à partir des n données d'apprentissage, telle que F va prédire la sortie Y associée à une donnée X. Quelles sont les propriétés voulues de F ?"
        },
        {
            "start": 1110,
            "end": 1113,
            "text": "Quelles sont les propriétés de cette fonction F ?"
        },
        {
            "start": 1113,
            "end": 1123,
            "text": "La première propriété relativement intuitive, c'est bien sûr que F doit prédire les bonnes valeurs pour l'ensemble des données de notre ensemble d'apprentissage."
        },
        {
            "start": 1123,
            "end": 1144,
            "text": "Quelles que soient XI et Y dans C, F de XI doit être égal à Y. L'autre propriété fondamentale en apprentissage automatique, c'est que F doit aussi pouvoir prédire les bonnes sorties pour des exemples futurs XJ, c'est-à-dire pour des données X qui n'appartiennent pas à l'ensemble d'apprentissage."
        },
        {
            "start": 1144,
            "end": 1148,
            "text": "C'est ce qu'on connaît sous le problème de la génération de données."
        },
        {
            "start": 1148,
            "end": 1155,
            "text": "Juste quelques illustrations, et notamment selon l'axe type de problème à traiter."
        },
        {
            "start": 1155,
            "end": 1167,
            "text": "Si Y est à valeur réelle, c'est-à-dire que Y est égal à Rm, alors on est dans ce cas-là, on est dans un cas de régrégation de la valeur de la donnée."
        },
        {
            "start": 1167,
            "end": 1174,
            "text": "On a donc un X qui est égal à Rm, et on a un X qui est égal à Rm."
        },
        {
            "start": 1174,
            "end": 1178,
            "text": "On est dans un cas de régression."
        },
        {
            "start": 1178,
            "end": 1183,
            "text": "Ici, on a une illustration d'un problème de régression."
        },
        {
            "start": 1183,
            "end": 1198,
            "text": "On a les points noirs qui sont nos données d'apprentissage, on a la vraie fonction, et ce qu'on cherche à construire, c'est une fonction F de X qui va être la plus proche possible de la fonction en bleu."
        },
        {
            "start": 1198,
            "end": 1204,
            "text": "Qui va être une bonne estimation de cette fonction en bleu qui représente la vraie fonction."
        },
        {
            "start": 1204,
            "end": 1212,
            "text": "Quand on est sur un problème de classification, XI va être associé à une sortie catégoriale."
        },
        {
            "start": 1212,
            "end": 1216,
            "text": "On voit ici une illustration d'un problème où on a deux classes."
        },
        {
            "start": 1216,
            "end": 1220,
            "text": "Un problème de classification binaire, les points noirs et les points rouges."
        },
        {
            "start": 1220,
            "end": 1224,
            "text": "Ici, on est sur un problème de classification à trois classes."
        },
        {
            "start": 1224,
            "end": 1228,
            "text": "On voit bien les classes qui sont bien séparées."
        },
        {
            "start": 1228,
            "end": 1236,
            "text": "Dans ce cas-là, on va parler de classification."
        },
        {
            "start": 1236,
            "end": 1259,
            "text": "Supposons qu'on a notre fonction F On peut se poser des questions sur la qualité de cette fonction F Pour ça, on va s'équiper d'une fonction de coût, qu'on appelle la fonction de coût aussi la loss function et donc qui est un élément clé de la théorie de l'apprentissage, de comment fonctionne l'apprentissage supervisé."
        },
        {
            "start": 1259,
            "end": 1263,
            "text": "Et notamment cette fonction de coup, elle doit permettre de pénaliser les erreurs."
        },
        {
            "start": 1263,
            "end": 1284,
            "text": "Typiquement, cette fonction de coup, elle doit pénaliser le cas où on va avoir une prédiction Y, chapeau, donc Y chapeau qui est égale à f de X, qui est différente du vrai Y que l'on connaît, donc dans les données qu'on a dans notre ensemble d'apprentissage."
        },
        {
            "start": 1284,
            "end": 1306,
            "text": "Voilà donc une fonction de coup, c'est une fonction L qui va de Y dans R plus, telle que L de Y qui va être supérée à zéro pour toute Y qui est différente de Y. Donc ce qu'on veut au travers de cette fonction de coup, bien sûr, c'est que le coût d'une bonne prédiction soit plus faible que le coût d'une erreur."
        },
        {
            "start": 1306,
            "end": 1312,
            "text": "Alors il existe énormément de fonctions de coup possibles."
        },
        {
            "start": 1312,
            "end": 1334,
            "text": "Si par exemple on se rapporte à un problème de classification, on a un coût qui est très connu, qui est le coût 0,1, où on va avoir un coût de zéro si Y est égal à f de X, donc si Y est égal à f de X, c'est-à-dire si on a une bonne prédiction et un sinon."
        },
        {
            "start": 1334,
            "end": 1352,
            "text": "Typiquement, ce coût 0,1, il consiste à mesurer le nombre de points qui est mal classé par la fonction f. Donc là, ça devient intéressant et on rentre un petit peu plus dans la théorie de l'apprentissage supervisé, notamment en introduisant la minimisation du risque."
        },
        {
            "start": 1352,
            "end": 1368,
            "text": "Donc ce qu'on souhaite, c'est construire une fonction f à partir de n données, donc nos données d'apprentissage, et ce qu'on veut c'est que f donne des bonnes approximations sur ces n données et aussi sur les données futures."
        },
        {
            "start": 1368,
            "end": 1383,
            "text": "Donc en fait, ce qu'on cherche à faire, c'est minimiser le risque, ou risque fonctionnel ou erreur de généralisation, qui est finalement l'espérance de notre fonction de coup L, par rapport à XY bien sûr."
        },
        {
            "start": 1383,
            "end": 1397,
            "text": "Donc ce risque fonctionnel, c'est l'espérance, donc selon la distribution de probabilités jointes P du XY, de notre fonction de coup L. Ça, ça représente en moyenne le coût pour toutes les données possibles."
        },
        {
            "start": 1397,
            "end": 1401,
            "text": "Et donc c'est là que ça devient compliqué, parce qu'on n'a pas toutes les données."
        },
        {
            "start": 1401,
            "end": 1404,
            "text": "Il est impossible d'avoir toutes les données possibles."
        },
        {
            "start": 1404,
            "end": 1428,
            "text": "Par contre, ce qu'on a, c'est notre ensemble d'apprentissages C. C'est notre échantillon, et donc sur cet ensemble d'échantillons C, on peut bien sûr calculer et mesurer le risque empirique, qui est donc la moyenne pour l'ensemble des données d'apprentissage de ce que donne la fonction de coup sur ces données d'apprentissage."
        },
        {
            "start": 1428,
            "end": 1434,
            "text": "Et ce qu'on cherche à faire, c'est minimiser le risque."
        },
        {
            "start": 1434,
            "end": 1446,
            "text": "Donc est-ce qu'on peut se contenter de minimiser, de chercher F, parmi une classe d'hypothèses, parmi un ensemble de fonctions F ?"
        },
        {
            "start": 1446,
            "end": 1455,
            "text": "Ce qu'on va chercher à faire, c'est trouver la fonction F qui va minimiser le risque."
        },
        {
            "start": 1455,
            "end": 1468,
            "text": "Donc comme on n'a que le risque empirique, est-ce qu'on peut se contenter finalement de chercher la fonction F, parmi notre classe d'hypothèses, qui va minimiser le risque empirique ?"
        },
        {
            "start": 1468,
            "end": 1471,
            "text": "La réponse à cette question, c'est non."
        },
        {
            "start": 1471,
            "end": 1472,
            "text": "Pourquoi ?"
        },
        {
            "start": 1472,
            "end": 1484,
            "text": "Parce qu'en fait le risque empirique, il ne va pas permettre d'évaluer la pertinence du modèle, parce que typiquement on peut tomber dans des problèmes qu'on appelle des problèmes de surapprentissage."
        },
        {
            "start": 1484,
            "end": 1494,
            "text": "C'est-à-dire qu'on va pouvoir, en minimisant le risque empirique, choisir une fonction F telle que le risque empirique va être très bas, voire nul."
        },
        {
            "start": 1494,
            "end": 1505,
            "text": "Et notamment, plus on prend une fonction F qui va être complexe et qui va du coup fiter les données, plus on va être dans ce cas-là."
        },
        {
            "start": 1505,
            "end": 1517,
            "text": "Mais par contre, sur de nouvelles données, donc sur un ensemble de tests, ce risque, l'erreur de généralisation, elle va être très élevée."
        },
        {
            "start": 1517,
            "end": 1519,
            "text": "L'erreur de prédiction, elle va être élevée."
        },
        {
            "start": 1519,
            "end": 1528,
            "text": "Donc ça, c'est typiquement un cas très connu en apprentissage, qui s'appelle le cas du surapprentissage."
        },
        {
            "start": 1528,
            "end": 1549,
            "text": "Donc la solution, en fait, ça va être de minimiser le risque empirique, donc à partir de notre échantillon d'apprentissage, et on va rajouter à ce risque empirique, en fait, un terme qu'on va appeler un terme de régularisation, qui va donc permettre la généralisation du modèle d'apprentissage."
        },
        {
            "start": 1549,
            "end": 1565,
            "text": "Donc ça, c'est vraiment ce qu'a montré la théorie de Vapnik, que la construction d'une fonction d'apprentissage, on peut la formaliser comme un problème de minimisation."
        },
        {
            "start": 1565,
            "end": 1584,
            "text": "Donc parmi une famille de fonctions qu'on appelle les classes d'hypothèses, chercher F appartenant à F, qui va minimiser le risque empirique régularisé, donc avec un facteur de régularisation lambda."
        },
        {
            "start": 1584,
            "end": 1588,
            "text": "Voilà, donc, rapide bilan sur l'apprentissage supervisé."
        },
        {
            "start": 1588,
            "end": 1593,
            "text": "Un algorithme d'apprentissage a un ensemble de fonctions F, donc ça, c'est notre classe d'hypothèses."
        },
        {
            "start": 1593,
            "end": 1605,
            "text": "Par exemple, vous pouvez prendre l'ensemble des fonctions linéaires, l'ensemble des fonctions de type réseau de neurones, enfin voilà, on a ce qu'on appelle une classe d'hypothèses."
        },
        {
            "start": 1605,
            "end": 1631,
            "text": "Et ce que fait cet algorithme d'apprentissage, c'est qu'il va sélectionner parmi cet ensemble de fonctions, la fonction la plus appropriée, donc en utilisant l'ensemble d'apprentissage, donc la minimisation du risque empirique, et la fonction objective, donc notre fonction de coût, avec bien sûr ajouté à ce risque empirique une fonction de régularisation qui, elle, est définie par l'utilisateur."
        },
        {
            "start": 1631,
            "end": 1652,
            "text": "Ensuite, cet algorithme d'apprentissage, il va réaliser la sélection de F, donc avec des méthodes qui lui sont propres, qui sont souvent des techniques qui font appel à des techniques d'optimisation, type des centres de gradients, par exemple, pour les réseaux de neurones, passage au lagrangien pour les SVM, etc."
        },
        {
            "start": 1652,
            "end": 1662,
            "text": "Voilà, et un aspect important, en fait, de l'apprentissage dont je n'ai pas parlé, c'est la représentation des exemples, c'est ce qu'on va donner en entrée, finalement, de notre système d'apprentissage."
        },
        {
            "start": 1662,
            "end": 1679,
            "text": "Donc ça, c'est typiquement une problématique qu'on appelle la problématique du feature engineering et qu'on oppose aujourd'hui aux approches qu'on appelle de représentation learning, où, en fait, on va apprendre aussi une représentation de nos exemples, et c'est typiquement ce que permet de faire des approches de type apprentissage profond."
        },
        {
            "start": 1679,
            "end": 1684,
            "text": "Mais ça, c'est hors sujet, en fait, de type apprentissage profond."
        },
        {
            "start": 1684,
            "end": 1689,
            "text": "Mais ça, c'est hors sujet pour ce cours, aujourd'hui, en tout cas."
        },
        {
            "start": 1689,
            "end": 1701,
            "text": "Voilà, donc maintenant, on va revenir à notre problème de recherche d'informations et on va s'intéresser plus spécifiquement à des problèmes de catégorisation et le lien avec la recherche d'informations."
        },
        {
            "start": 1701,
            "end": 1706,
            "text": "Donc, on va prendre comme exemple le problème de la catégorisation de documents."
        },
        {
            "start": 1706,
            "end": 1711,
            "text": "Donc, on peut très facilement illustrer sous la forme de ce schéma-là."
        },
        {
            "start": 1711,
            "end": 1721,
            "text": "Donc, on a nos deux phases classiques dans les systèmes d'apprentissage, une phase d'entraînement du modèle et une phase de prédiction."
        },
        {
            "start": 1721,
            "end": 1726,
            "text": "Voilà, donc on a une collection de documents qui est labellisée, étiquetée."
        },
        {
            "start": 1726,
            "end": 1730,
            "text": "Donc, pour chaque document, on a un ensemble d'étiquettes."
        },
        {
            "start": 1730,
            "end": 1736,
            "text": "Les documents, donc, il y a toutes les tables de construction de feature engineering."
        },
        {
            "start": 1736,
            "end": 1743,
            "text": "Donc, typiquement, les documents, on va les représenter sous la forme de documents vectorisés."
        },
        {
            "start": 1743,
            "end": 1752,
            "text": "Donc, par exemple, avec des représentations TFIDF dans l'espace des termes du vocabulaire qu'on a construit sur la collection."
        },
        {
            "start": 1752,
            "end": 1766,
            "text": "Et puis, comme on a donc nos données labellisées, comme on a des étiquettes, on va donc apprendre un modèle de catégorisation sur ces données-là."
        },
        {
            "start": 1766,
            "end": 1775,
            "text": "Et puis, maintenant, on peut utiliser ce modèle dans une phase de prédiction pour un nouveau document test que je décris de la même manière, bien sûr."
        },
        {
            "start": 1775,
            "end": 1779,
            "text": "Donc, je construis aussi une représentation vectorisée de mon document."
        },
        {
            "start": 1779,
            "end": 1785,
            "text": "J'utilise mon classifieur et je prédis donc une étiquette pour des primes."
        },
        {
            "start": 1785,
            "end": 1796,
            "text": "Alors, si je définis ça de manière un peu plus formelle, je vais considérer un espace de représentation pour mes documents quantiques."
        },
        {
            "start": 1796,
            "end": 1805,
            "text": "J'ai un ensemble de classes fixées C, qui sont les différentes catégories possibles pour mon document, donc l'ensemble des classes qui sont les classes d'étiquettes."
        },
        {
            "start": 1805,
            "end": 1812,
            "text": "Et puis, j'ai donc mon ensemble d'apprentissages D qui est composé de paires D et C, les étiquettes associées."
        },
        {
            "start": 1812,
            "end": 1819,
            "text": "Et puis, il va suffire d'apprendre une fonction F, un classifieur qui va associer les documents à sa classe ou à leur classe."
        },
        {
            "start": 1819,
            "end": 1822,
            "text": "Alors, ça peut être un problème de classification multiclasse."
        },
        {
            "start": 1822,
            "end": 1823,
            "text": "Voilà."
        },
        {
            "start": 1823,
            "end": 1841,
            "text": "Alors, juste faites attention parce que ici j'ai changé mes notations et notamment C ici est mon ensemble de classes et non plus mon ensemble d'apprentissages et D n'est plus ma distribution de probabilités inconnues, mais c'est mon ensemble d'apprentissages."
        },
        {
            "start": 1841,
            "end": 1844,
            "text": "Je suis désolée pour ce petit changement, donc j'insiste bien là-dessus."
        },
        {
            "start": 1844,
            "end": 1848,
            "text": "Attention aux changements de notation par rapport aux slides précédentes."
        },
        {
            "start": 1848,
            "end": 1848,
            "text": "Voilà."
        },
        {
            "start": 1848,
            "end": 1856,
            "text": "Alors, il y a plein d'applications, en fait, de la catégorisation de documents pour la recherche d'informations."
        },
        {
            "start": 1856,
            "end": 1859,
            "text": "Il y a énormément d'applications possibles."
        },
        {
            "start": 1859,
            "end": 1873,
            "text": "Par exemple, on a vu que toutes les techniques d'indexation étaient dépendantes de la langue, ne serait-ce que l'étape de tokenisation, même si aujourd'hui il existe des tokenizers qui sont langages indépendants."
        },
        {
            "start": 1873,
            "end": 1884,
            "text": "Et du coup, il est souvent nécessaire, étant donné un document, d'identifier sa langue pour justement appliquer la bonne chaîne de traitement linguistique."
        },
        {
            "start": 1884,
            "end": 1886,
            "text": "Eh bien, ça c'est un problème de catégorisation."
        },
        {
            "start": 1886,
            "end": 1896,
            "text": "L'ensemble des classes, c'est l'ensemble des langages du corpus, et puis ce qu'il faut, c'est étant donné un document, prédire la langue du document."
        },
        {
            "start": 1896,
            "end": 1913,
            "text": "On peut aussi utiliser ce principe de catégorisation, par exemple dans le cas du web, pour détecter des pages qui sont des spams ou des pages qui sont des non-spams, et notamment pour éviter d'avoir à indexer des pages qui sont des pages de type spam."
        },
        {
            "start": 1913,
            "end": 1925,
            "text": "Voilà, alors d'autres applications assez connues, c'est par exemple tout ce qui est détection de sentiments dans des données qui sont des données de réseaux sociaux, voilà, type tweet, etc."
        },
        {
            "start": 1925,
            "end": 1934,
            "text": "Voilà, alors en recherche d'informations, une application aussi assez classique de la catégorisation de documents, c'est la détection de thématiques ou la recherche de verticaux."
        },
        {
            "start": 1934,
            "end": 1949,
            "text": "Typiquement, dans les moteurs de recherche grand public, ce qu'on appelle un vertical ou les verticaux, c'est typiquement par exemple de limiter une recherche par exemple à l'ensemble des actualités, ou à l'ensemble des images, ou à l'ensemble des vidéos."
        },
        {
            "start": 1949,
            "end": 1951,
            "text": "Ça c'est des verticaux."
        },
        {
            "start": 1951,
            "end": 1961,
            "text": "Et donc, associer un document au type de vertical recherché, ou quel il correspond, ça c'est un problème de classification."
        },
        {
            "start": 1961,
            "end": 1974,
            "text": "Voilà, alors on va du coup maintenant s'intéresser à quelques algorithmes de catégorisation qui sont un peu les algorithmes historiques qu'on utilise pour la recherche d'informations."
        },
        {
            "start": 1974,
            "end": 1985,
            "text": "Voilà, il y a deux grandes familles d'algorithmes de catégorisation selon le type finalement de modèles qu'on utilise."
        },
        {
            "start": 1985,
            "end": 1992,
            "text": "Il y a notamment des algorithmes qui sont des algorithmes qui font partie des modèles qu'on appelle les modèles génératifs."
        },
        {
            "start": 1992,
            "end": 1999,
            "text": "Ça c'est typiquement les premiers modèles d'apprentissage qui ont été développés pour la catégorisation de documents."
        },
        {
            "start": 1999,
            "end": 2030,
            "text": "Ces modèles génératifs, en fait, ils se basent sur l'hypothèse qui est écrite sur cette slide, qui consiste à dire que chaque vecteur représentatif d'un document D, on va le modéliser comme la réalisation d'une variable aléatoire multidimensionnelle, qui est générée par le mélange de cas densité de probabilité avec des proportions pica telles que la somme des pica pour l'ensemble des cas densité est égale à 1."
        },
        {
            "start": 2030,
            "end": 2035,
            "text": "Et puis bien sûr pica c'est supérieur à 0."
        },
        {
            "start": 2035,
            "end": 2043,
            "text": "Donc typiquement, k c'est typiquement les différentes classes possibles."
        },
        {
            "start": 2043,
            "end": 2060,
            "text": "Un exemple d'algorithme ou de méthode de catégorisation qui fait partie de ces modèles génératifs, c'est par exemple le classifère Bayesien qui utilise du coup la règle de Bayes, le classifère qu'on appelle le classifère Bayesien naïf."
        },
        {
            "start": 2060,
            "end": 2087,
            "text": "On peut aussi proposer des approches pour la catégorisation en utilisant des modèles qu'on appelle les modèles discriminants, qui eux vont directement trouver une fonction de classification F donc de grand Rd, qui est l'espace de représentation de nos documents, dans grand Y et qui va résoudre le problème de catégorisation sans faire d'hypothèses sur la manière dont sont générés les exemples."
        },
        {
            "start": 2087,
            "end": 2097,
            "text": "Donc une façon un peu d'illustrer la différence entre ces deux catégories de modèles."
        },
        {
            "start": 2097,
            "end": 2121,
            "text": "Ici le modèle génératif c'est vraiment le modèle du peintre qui va typiquement essayer de reproduire au mieux le processus de génération de données et ici c'est l'approche du caricaturiste qui va grossièrement tracer les traits discriminants des données."
        },
        {
            "start": 2121,
            "end": 2140,
            "text": "Alors un exemple d'approche de classification qui fait partie des modèles discriminants c'est par exemple les SVM qui sont les séparateurs à vaste marge ou d'autres approches comme les capes le proche voisin ou le perceptron, des approches de régression logistique etc."
        },
        {
            "start": 2140,
            "end": 2143,
            "text": "Ce sont des modèles discriminants."
        },
        {
            "start": 2143,
            "end": 2151,
            "text": "On va s'intéresser dans un premier temps à des modèles génératifs donc assez classiques en recherche d'informations."
        },
        {
            "start": 2151,
            "end": 2155,
            "text": "Notamment on va s'intéresser au classifieur Bayesian."
        },
        {
            "start": 2155,
            "end": 2178,
            "text": "Pour vous introduire ce classifieur Bayesian, je vais utiliser un exemple qui vient d'un très bon cours d'apprentissage de Gilles Gassot où on prend un problème de classification jouet qui consiste à classer un fruit comme en deux classes possibles comme poire donc ça c'est la classe C1 ou pêche c'est la classe C2."
        },
        {
            "start": 2178,
            "end": 2195,
            "text": "Alors on peut classer un fruit donné qui est donc une donnée d'entrée en utilisant une probabilité a priori qui reflèterait notre connaissance qu'un fruit soit une poire ou une pêche sans qu'on ait observé le dit fruit."
        },
        {
            "start": 2195,
            "end": 2220,
            "text": "Par exemple voilà je regarde mon contexte je sais que nous sommes au mois de mai et donc voilà ma connaissance me dit que la probabilité que le fruit soit une pêche elle est plus forte que le fruit soit une poire selon l'aspect saisonnalité."
        },
        {
            "start": 2220,
            "end": 2244,
            "text": "Donc on a bien sûr ces propriétés sur les probabilités a priori la probabilité a priori d'être une poire plus la probabilité a priori d'être une pêche elle est égale à 1 et puis du coup je peux utiliser ces probabilités a priori pour mon problème de classification."
        },
        {
            "start": 2244,
            "end": 2257,
            "text": "Typiquement je vais affecter le fruit à la classe 1 si la probabilité a priori d'être de la classe 1 donc d'être une poire elle est plus grande que la probabilité a priori d'être de la classe C donc d'être une pêche."
        },
        {
            "start": 2257,
            "end": 2267,
            "text": "On voit qu'en faisant ça donc sans prendre en compte les caractéristiques intrinsèques des données je risque d'avoir un risque d'erreur qui va être important."
        },
        {
            "start": 2267,
            "end": 2279,
            "text": "Et donc pour contrabalancer ça l'idée ça va être de prendre en compte les caractéristiques intrinsèques des données de notre fruit et donc de passer par cette étape de représentation."
        },
        {
            "start": 2279,
            "end": 2289,
            "text": "De définir un ensemble de caractéristiques X qui vont appartenir à RDR et qui vont représenter le fruit comme par exemple sa forme sa couleur son odeur etc."
        },
        {
            "start": 2289,
            "end": 2296,
            "text": "Des choses qui vont caractériser un ensemble d'observations sur l'objet qu'on cherche à classifier."
        },
        {
            "start": 2296,
            "end": 2302,
            "text": "Et puis du coup je vais définir des lois conditionnelles pour les différentes classes."
        },
        {
            "start": 2302,
            "end": 2313,
            "text": "Donc mes deux classes C1 poire C2 pêche donc P de X sachant C1 et P de X sachant C2."
        },
        {
            "start": 2313,
            "end": 2325,
            "text": "Typiquement une illustration possible de ces lois conditionnelles avec en rouge la classe C1 et en bleu la classe C2."
        },
        {
            "start": 2325,
            "end": 2347,
            "text": "Du coup je vais en utilisant le théorème de Bayes pouvoir calculer la probabilité a posteriori de ces cas sachant X. Cette probabilité a posteriori je l'obtiens avec le théorème de Bayes et il m'est fourni par cette équation."
        },
        {
            "start": 2347,
            "end": 2360,
            "text": "P de X sachant C4 fois la probabilité a priori de ces cas sur la somme entre P de X sachant C1 probabilité a priori de C1 plus P de X sachant C2 plus la probabilité a priori de C2."
        },
        {
            "start": 2360,
            "end": 2363,
            "text": "Ça c'est le théorème de Bayes."
        },
        {
            "start": 2363,
            "end": 2376,
            "text": "Et en utilisant du coup ces probabilités a posteriori je vais avoir une nouvelle règle de décision qui va consister à affecter X à la classe de plus forte probabilité a posteriori."
        },
        {
            "start": 2376,
            "end": 2392,
            "text": "Donc si la probabilité a posteriori de poire sachant X est plus grande à la probabilité a posteriori de pêche sachant X alors X est de la classe poire c'est une instance de poire."
        },
        {
            "start": 2392,
            "end": 2399,
            "text": "Donc je définis ainsi avec cette règle de décision une frontière de décision."
        },
        {
            "start": 2399,
            "end": 2401,
            "text": "On va l'appeler une frontière de décision."
        },
        {
            "start": 2401,
            "end": 2411,
            "text": "Puis typiquement je vais pouvoir qualifier cette frontière de décision justement en regardant comment ça se comporte sur sur des données de test."
        },
        {
            "start": 2411,
            "end": 2420,
            "text": "Typiquement en regardant le taux d'erreur c'est à dire le nombre de modèles de mauvaise décision sur le nombre total de décisions."
        },
        {
            "start": 2420,
            "end": 2428,
            "text": "Voilà donc la démarche qu'on va mettre en oeuvre pour des modèles génératifs de type classif eurbégien."
        },
        {
            "start": 2428,
            "end": 2432,
            "text": "C'est celle que je vais présenter juste maintenant."
        },
        {
            "start": 2432,
            "end": 2439,
            "text": "J'observe un ensemble de caractéristiques notées X qui décrivent une entité."
        },
        {
            "start": 2439,
            "end": 2448,
            "text": "Je suppose qu'une entité provient d'une classe donnée et je vais prendre une décision en fonction de l'observation de ces caractéristiques."
        },
        {
            "start": 2448,
            "end": 2458,
            "text": "Chaque décision, action, va donc avoir un certain coût en fonction de la classe à laquelle appartient X."
        },
        {
            "start": 2458,
            "end": 2470,
            "text": "Et puis l'objectif du classif eurbégien ça va être de trouver une règle de décision qui va minimiser un coût moyen définissant quelles décisions prendre en fonction de l'entité observée."
        },
        {
            "start": 2470,
            "end": 2476,
            "text": "On retrouve ici les objectifs de notre apprentissage au supervisé."
        },
        {
            "start": 2476,
            "end": 2479,
            "text": "Quelques notations qui vont être utiles pour la suite."
        },
        {
            "start": 2479,
            "end": 2492,
            "text": "On a un ensemble de classes C1, C4, de probabilité a priori PR de CK, c'est à dire la probabilité que C est égale à CK pour chaque classe."
        },
        {
            "start": 2492,
            "end": 2497,
            "text": "On a donc un espace de caractéristiques X. Typiquement X peut être égal à Rd."
        },
        {
            "start": 2497,
            "end": 2509,
            "text": "Et puis on a donc la probabilité à... a posteriori, la probabilité que C est égale à CK, sachant que X est égale à X."
        },
        {
            "start": 2509,
            "end": 2512,
            "text": "On va noter P de CK sachant X."
        },
        {
            "start": 2512,
            "end": 2528,
            "text": "La loi conditionnelle de X à la classe CK, c'est la probabilité de X sachant CK, c'est égal à la probabilité que la variable aléatoire X prenne la valeur X, sachant que la classe C est égale à CK."
        },
        {
            "start": 2528,
            "end": 2534,
            "text": "La loi marginale de X, on va la définir sur l'ensemble des classes possibles."
        },
        {
            "start": 2534,
            "end": 2551,
            "text": "C'est la somme pour l'ensemble des classes possibles de la loi conditionnelle de X à la classe CK fois la probabilité a priori de CK."
        },
        {
            "start": 2551,
            "end": 2560,
            "text": "Le problème, ça va être trouver la classe de X par une approche probabiliste en utilisant le maximum a posteriori."
        },
        {
            "start": 2560,
            "end": 2572,
            "text": "La classe pour X, ça va être la classe qui va permettre de maximiser cette quantité-là."
        },
        {
            "start": 2572,
            "end": 2578,
            "text": "La remax selon K de cette quantité-là."
        },
        {
            "start": 2578,
            "end": 2594,
            "text": "Ce qu'il va falloir faire pour mettre en œuvre le classifiant abézien, ça va être d'estimer les quantités de cette formule à partir de notre ensemble d'observation, donc à partir de notre ensemble d'apprentissage."
        },
        {
            "start": 2594,
            "end": 2615,
            "text": "Typiquement, ce qu'on va chercher à estimer, c'est les probabilités PR de CK, donc la probabilité a priori pour chaque classe, et la probabilité, la loi conditionnelle de X à la classe CK, donc P de X sachant CK."
        },
        {
            "start": 2615,
            "end": 2623,
            "text": "On a maintenant tout ce qu'il faut pour appliquer ces modèles génératifs à notre problème de catégorisation de documents."
        },
        {
            "start": 2623,
            "end": 2640,
            "text": "Je reviens sur l'hypothèse dont j'ai déjà parlé, qui va consister à considérer que chaque vecteur représentatif d'un document D, c'est la réalisation d'une variable aléatoire multidimensionnelle, qui va être générée par le mélange de K densité de probabilité, avec des proportions πK."
        },
        {
            "start": 2640,
            "end": 2643,
            "text": "K étant le nombre de classes possibles."
        },
        {
            "start": 2643,
            "end": 2657,
            "text": "Avec ces propriétés-là, la somme des πK pour l'ensemble des classes possibles, c'est 1, et πK, c'est supérieur ou égal à 0."
        },
        {
            "start": 2657,
            "end": 2686,
            "text": "Chaque fonction de densité, c'est une fonction paramétrique qui modélise la distribution de probabilité conditionnelle de classe, associée à une classe K qui appartient à Y. Cette distribution de probabilité conditionnelle de classe, on va l'exprimer comme une fonction de densité, donc une fonction paramétrique avec des paramètres θK."
        },
        {
            "start": 2686,
            "end": 2692,
            "text": "Pour la classe K. La densité de mélange, elle modélise quoi ?"
        },
        {
            "start": 2692,
            "end": 2698,
            "text": "Elle modélise finalement la génération de D par ses K densité de probabilité."
        },
        {
            "start": 2698,
            "end": 2716,
            "text": "Le modèle génératif de D étant donné l'ensemble des paramètres, c'est une loi de mélange, c'est la somme pour l'ensemble des classes possibles, de πK fois cette fonction de densité associée à chaque classe."
        },
        {
            "start": 2716,
            "end": 2721,
            "text": "Exactement comme tout à l'heure, la poire ou la pêche finalement."
        },
        {
            "start": 2721,
            "end": 2723,
            "text": "Ici, les classes sont différentes."
        },
        {
            "start": 2723,
            "end": 2731,
            "text": "Donc, Theta, c'est l'ensemble des proportions πK et tous les paramètres qui définissent les fonctions de densité fK."
        },
        {
            "start": 2731,
            "end": 2740,
            "text": "Donc, θ, c'est l'ensemble des πK pour chacune des classes possibles et puis les paramètres des lois de densité."
        },
        {
            "start": 2740,
            "end": 2751,
            "text": "Le but de l'apprentissage, ça va être d'estimer cet ensemble de paramètres θ pour qu'au sens du maximum de vraisemblance, le modèle de mélange explique au mieux les exemples de la base d'entraînement."
        },
        {
            "start": 2751,
            "end": 2765,
            "text": "Après cette estimation des paramètres, on va pouvoir classer un nouveau document des primes à une classe de l'ensemble Y en utilisant la règle de décision Bayesian que j'ai présentée tout à l'heure."
        },
        {
            "start": 2765,
            "end": 2779,
            "text": "Des primes va appartenir à la classe classe, 6K, c'est la remax pour l'ensemble des classes possibles, de P, de Y et de H, sachant des primes."
        },
        {
            "start": 2779,
            "end": 2792,
            "text": "Avec Bayes, toute cette équation, je peux l'écrire comme ça, en faisant intervenir les paramètres de ma loi de mélange, les paramètres de mon modèle génératif."
        },
        {
            "start": 2792,
            "end": 2797,
            "text": "La vraie question, c'est comment estimer ces paramètres."
        },
        {
            "start": 2797,
            "end": 2818,
            "text": "Il y a deux modèles qui vont faire des hypothèses sur notre représentation du document qui vont nous permettre d'arriver à une estimation possible de ces paramètres et donc à des modèles génératifs de catégorisation effectifs pour la catégorisation de documents."
        },
        {
            "start": 2818,
            "end": 2829,
            "text": "Un de ces premiers modèles, c'est le modèle multivarié de Bernoulli qui va considérer que les documents sont indépendants et le modèle multinomial."
        },
        {
            "start": 2829,
            "end": 2832,
            "text": "Commençons par le modèle multivarié de Bernoulli."
        },
        {
            "start": 2832,
            "end": 2842,
            "text": "Ce modèle, ce n'est rien d'autre qu'une généralisation du modèle probabiliste MIB que Myriam vous avait présenté lors du cours sur les modèles probabilistes."
        },
        {
            "start": 2842,
            "end": 2855,
            "text": "L'hypothèse de ce modèle multivarié de Bernoulli, c'est l'hypothèse Naïve Bayes qui dit que les termes qui apparaissent dans un document sont indépendants les uns des autres."
        },
        {
            "start": 2855,
            "end": 2879,
            "text": "Chaque document, on va le représenter comme un vecteur binaire défini sur l'espace des termes d'indexation, l'espace des termes de notre vocabulaire, construit sur notre collection, avec WID qui vaut 0 ou 1, selon que le terme est présent ou non dans notre document."
        },
        {
            "start": 2879,
            "end": 2963,
            "text": "Si j'introduis cette représentation vectorielle de D dans mes lois de densité, F de k de D, θ k, va être égal à la probabilité pour D qui est égale à sa représentation sachant Y est égale à k. Comme j'ai fait l'hypothèse que les termes étaient indépendants les uns des autres, ça va être égal au produit pour l'ensemble des termes de la probabilité de WID sachant que Y est égale à k. Si je pose quelques notations, et notamment je vais considérer que θ de TI sachant k, c'est la probabilité que le terme i soit présent dans le document D, donc WID est égal à 1 sachant Y est égal à k, c'est typiquement la probabilité de présence du terme TI du vocabulaire dans la classe K, alors ma loi de densité, je peux pour D, associer donc à D pour la classe K, avec les paramètres θ k, je vais pouvoir l'écrire de cette manière."
        },
        {
            "start": 2963,
            "end": 2973,
            "text": "Donc c'est le produit pour chacun des termes de cette quantité là."
        },
        {
            "start": 2973,
            "end": 2976,
            "text": "Voilà, ça c'est ce qu'on appelle une loi de Bernoulli."
        },
        {
            "start": 2976,
            "end": 2978,
            "text": "Alors pourquoi ça s'appelle une loi de Bernoulli ?"
        },
        {
            "start": 2978,
            "end": 2993,
            "text": "Parce que les événements qui modélisent l'absence ou la présence de termes du vocabulaire dans les différentes classes, elles suivent ce qu'on appelle une loi de Bernoulli dont les paramètres sont propres à chaque terme."
        },
        {
            "start": 2993,
            "end": 3003,
            "text": "Voilà, donc ici θ k, ça représente l'ensemble des probabilités de présence des termes du vocabulaire dans la KM classe ou dans la KM composante du mélange."
        },
        {
            "start": 3003,
            "end": 3062,
            "text": "Et puis ce qu'on va chercher à estimer, c'est ce grand θ, donc cet ensemble de paramètres θ de k, c'est-à-dire pour chaque classe K, πk, et puis θ de ti sachant k. Cette estimation, on va pouvoir la faire au sens du maximum de vraisemblance des paramètres sur une base d'apprentissage C de taille M. Et en particulier, pour l'ensemble des termes de notre vocabulaire et pour l'ensemble des classes, θ de ti sachant k, on va pouvoir l'estimer comme étant cette quantité-là, c'est-à-dire le df pour le terme i de la classe K sur nk de C. Et puis πk, on va pouvoir l'estimer comme étant n de K sur C sur M. Alors, à quoi correspondent ces différentes quantités ?"
        },
        {
            "start": 3062,
            "end": 3080,
            "text": "n de K de C, c'est égal au cardinal de SK, donc le cardinal de la classe SK, c'est l'ensemble des documents de la base d'apprentissage qui appartiennent à la classe K. M, c'est le nombre total de documents dans notre base d'apprentissage."
        },
        {
            "start": 3080,
            "end": 3099,
            "text": "Et df de T de K, c'est le nombre de documents de la classe K qui contiennent au moins une fois le terme T. Donc ça, c'est l'estimation des paramètres de notre modèle multivarié de Bernoulli au sens du maximum de vraisemblance."
        },
        {
            "start": 3099,
            "end": 3111,
            "text": "En pratique, on ajoute à ces estimations un lissage de la place et un passage au logarithme pour la règle de Bayes."
        },
        {
            "start": 3111,
            "end": 3123,
            "text": "Je vous ai mis sur les deux slides qui suivent les algorithmes qui correspondent à la phase d'apprentissage et à la phase de test, mais je vous laisserai regarder ces algorithmes à tête reposée."
        },
        {
            "start": 3123,
            "end": 3126,
            "text": "Je ne vais pas les détailler dans cette vidéo."
        },
        {
            "start": 3126,
            "end": 3128,
            "text": "Je vais accélérer un peu."
        },
        {
            "start": 3128,
            "end": 3146,
            "text": "L'autre modèle génératif qui est très utilisé en catégorisation pour la RI, c'est le modèle multinomial, dans lequel on va considérer qu'un document D est représenté comme une séquence ordonnée de termes D. L'ordre des termes est pris en compte."
        },
        {
            "start": 3146,
            "end": 3151,
            "text": "La représentation d'un document D, c'est une séquence ordonnée."
        },
        {
            "start": 3151,
            "end": 3156,
            "text": "Et cette séquence ordonnée est générée à partir d'un vocabulaire V donné."
        },
        {
            "start": 3156,
            "end": 3173,
            "text": "On a toujours l'hypothèse Naïve-Bayes qui dit cette fois-ci que la probabilité de génération d'un terme par une composante du mélange, par une classe, est indépendante du contexte et de la position de ce terme dans le document."
        },
        {
            "start": 3173,
            "end": 3186,
            "text": "Comme pour le modèle de Bernoulli, on va inclure cette représentation D sous la forme d'une séquence ordonnée de termes dans notre loi de densité."
        },
        {
            "start": 3186,
            "end": 3217,
            "text": "En utilisant l'hypothèse de Bayes, cette loi de densité associée à la classe K, va être égale au produit pour l'ensemble des termes qui appartiennent à un document de θ de TH, avec le θ de TH, qui est la probabilité de génération du terme TH par la Km composante du mélange, par la Km classe."
        },
        {
            "start": 3217,
            "end": 3231,
            "text": "Ce qu'introduit ce modèle multinomial par rapport au modèle de Bernoulli, au modèle précédent, c'est qu'il va capturer l'information de fréquence des termes dans les documents, et plus seulement l'information de présence-absence."
        },
        {
            "start": 3231,
            "end": 3246,
            "text": "On a vu plusieurs fois, notamment quand on a introduit le modèle vectorial, que prendre en compte cette fréquence des termes, ça avait un intérêt et ça a un impact sur les résultats."
        },
        {
            "start": 3246,
            "end": 3254,
            "text": "Comme pour le modèle précédent, il faut estimer les paramètres."
        },
        {
            "start": 3254,
            "end": 3261,
            "text": "Il y a une erreur d'ailleurs ici, c'est le modèle multinomial, je suis désolée, je viens de m'en rendre compte."
        },
        {
            "start": 3261,
            "end": 3272,
            "text": "On estime ces paramètres au sens du maximum de vraisemblance sur une base d'apprentissage C de taille M, en introduisant un lissage de la place."
        },
        {
            "start": 3272,
            "end": 3288,
            "text": "Au sens du maximum de vraisemblance, on peut estimer les différents paramètres de notre modèle génératif, de cette manière-là, où on voit qu'on a pris en compte la fréquence des termes dans les documents."
        },
        {
            "start": 3288,
            "end": 3322,
            "text": "On a toujours ici un NK2C1 qui est le cardinal de la classe K dans notre ensemble d'apprentissage, et puis ici un TF2TID, c'est le nombre d'occurrences du terme TI dans le document D. S2K, c'est l'ensemble des documents de notre ensemble d'apprentissage qui appartiennent à la classe K. Voilà, donc à nouveau, je vous ai mis le détail des algorithmes pour la phase d'apprentissage et pour la phase de test, mais que je ne détaillerai pas ici."
        },
        {
            "start": 3322,
            "end": 3339,
            "text": "On peut bien sûr aussi utiliser des modèles discriminants, qui eux vont consister à directement trouver une fonction F de classification, sans faire finalement d'hypothèse sur la manière dont sont générés les exemples."
        },
        {
            "start": 3339,
            "end": 3347,
            "text": "Là, on va retomber sur des choses que j'ai introduites tout à l'heure sur l'apprentissage supervisé."
        },
        {
            "start": 3347,
            "end": 3368,
            "text": "Le classifieur recherché est supposé appartenir à une classe de fonctions données F, donc ma classe d'hypothèse, et la forme analytique de cette fonction F, je vais la trouver en minimisant une fonction d'erreur, notre fonction de coût définie tout à l'heure."
        },
        {
            "start": 3368,
            "end": 3390,
            "text": "Très souvent, comme on est dans un problème de classification, ici on utilise le coût 0,1, où je vais compter le nombre de fausses prédictions, je vais pénaliser le nombre de fausses prédictions de ma fonction F. Un modèle discriminant très connu, ce sont les séparateurs à vaste marge linéaire."
        },
        {
            "start": 3390,
            "end": 3418,
            "text": "L'objectif, c'est étant donné nos données d'apprentissage, qui sont étiquetées de manière binaire selon deux classes, moins 1 ou plus 1, on va chercher à construire à partir de cet ensemble d'apprentissage, une fonction F de décision qui va permettre de prédire la classe moins 1 ou plus 1 d'un point quelconque X appartenant à notre ensemble d'entrées grand X."
        },
        {
            "start": 3418,
            "end": 3427,
            "text": "La fonction de décision, je veux que ce soit une fonction de décision linéaire."
        },
        {
            "start": 3427,
            "end": 3436,
            "text": "Voilà, donc ça c'est la forme analytique de cette fonction de décision linéaire."
        },
        {
            "start": 3436,
            "end": 3451,
            "text": "Et puis l'apprentissage, ça va consister à apprendre les paramètres W, J et B de cette fonction F, tel que je vais minimiser mon risque empirique."
        },
        {
            "start": 3451,
            "end": 3461,
            "text": "Je ne vais pas plus rentrer dans les détails de ces SVM, parce que je détaillerai ça un peu plus précisément lors de la prochaine séance."
        },
        {
            "start": 3461,
            "end": 3477,
            "text": "On va maintenant passer au dernier gros morceau du cours d'aujourd'hui, qui concerne l'apprentissage pour la RIE et l'ordonnancement."
        },
        {
            "start": 3477,
            "end": 3487,
            "text": "L'idée, ça va être de modéliser la recherche d'informations comme un problème de catégorisation, pour se ramener à un problème d'apprentissage."
        },
        {
            "start": 3487,
            "end": 3492,
            "text": "L'idée générale, ça va être de choisir une représentation des exemples."
        },
        {
            "start": 3492,
            "end": 3500,
            "text": "Encore faut-il dire quels sont les exemples qu'on va considérer dans ce cadre-là."
        },
        {
            "start": 3500,
            "end": 3509,
            "text": "Il va aussi falloir dire à quoi correspondent les classes de sortie et quels sont leurs nombres."
        },
        {
            "start": 3509,
            "end": 3518,
            "text": "Une fois qu'on a un peu défini ces données d'entrée, il faut choisir le principe d'apprentissage et l'algorithme associé."
        },
        {
            "start": 3518,
            "end": 3524,
            "text": "Ou faire en sorte d'en tester plusieurs et de choisir celui qui est le plus optimal."
        },
        {
            "start": 3524,
            "end": 3531,
            "text": "Revenons à notre problématique de recherche d'informations."
        },
        {
            "start": 3531,
            "end": 3541,
            "text": "J'ai des requêtes, et je vais considérer que j'ai des requêtes pour lesquelles je dispose de jugements de pertinence dans ces."
        },
        {
            "start": 3541,
            "end": 3550,
            "text": "Typiquement, j'ai une requête Q1 et un ensemble de documents avec leurs jugements de pertinence."
        },
        {
            "start": 3550,
            "end": 3555,
            "text": "En bleu, c'est les documents pertinents, en orange, c'est les documents non pertinents pour la requête Q1."
        },
        {
            "start": 3555,
            "end": 3561,
            "text": "Et puis j'ai la même chose pour une requête Q2 et j'ai la même chose pour une requête Q3."
        },
        {
            "start": 3561,
            "end": 3579,
            "text": "Ces requêtes pour lesquelles je dispose de jugements de pertinence, c'est ça qui va nous permettre de définir un ensemble d'apprentissages que je vais utiliser pour ensuite apprendre une fonction F, qui va être utilisée après pour faire de la recherche d'informations."
        },
        {
            "start": 3579,
            "end": 3589,
            "text": "Les principaux verrous de l'apprentissage par ordonnancement, c'est de déterminer quelles sont les données qu'on va utiliser pour mettre en place l'apprentissage."
        },
        {
            "start": 3589,
            "end": 3598,
            "text": "La problématique de la notation des données d'apprentissage, typiquement on voit bien qu'une sortie c'est mes jugements de pertinence, et donc quel jugement de pertinence je vais prendre en compte."
        },
        {
            "start": 3598,
            "end": 3600,
            "text": "Comment je décris mes données ?"
        },
        {
            "start": 3600,
            "end": 3610,
            "text": "À partir du moment où j'ai défini mes données, qui sont des couples requêtes documents, comment je les décris, donc quelles sont les caractéristiques que je vais utiliser pour décrire mes données."
        },
        {
            "start": 3610,
            "end": 3619,
            "text": "Et puis bien sûr, après, quel modèle d'apprentissage j'utilise, quelle fonction de coup, quel algorithme, etc."
        },
        {
            "start": 3619,
            "end": 3625,
            "text": "Et puis après, se pose aussi la question de comment j'évalue cette fonction F que j'ai apprise à partir des données."
        },
        {
            "start": 3625,
            "end": 3628,
            "text": "Quelles sont les mesures que je vais pouvoir utiliser pour mon évaluation ?"
        },
        {
            "start": 3628,
            "end": 3634,
            "text": "La première question, la question de comment je représente mes données, elle est fondamentale."
        },
        {
            "start": 3634,
            "end": 3639,
            "text": "C'est un problème crucial, qui est l'étape qu'on appelle l'étape de Feature Engineering."
        },
        {
            "start": 3639,
            "end": 3650,
            "text": "On a vu que les données que je dois considérer pour faire de l'ordonnancement, ce ne sont pas les documents seuls, mais ça va être des couples documents requêtes."
        },
        {
            "start": 3650,
            "end": 3657,
            "text": "Et donc à ce couple documents requêtes, je vais pouvoir utiliser les données que je vais utiliser pour faire de l'ordonnancement."
        },
        {
            "start": 3657,
            "end": 3665,
            "text": "Pour ce couple documents requêtes, je vais devoir associer une représentation standard X qui va être définie dans RM, avec un M dimension."
        },
        {
            "start": 3665,
            "end": 3671,
            "text": "Les coordonnées de X, je vais vouloir qu'elles soient très générales."
        },
        {
            "start": 3671,
            "end": 3682,
            "text": "On va essayer de se reposer sur un maximum d'informations, et notamment, pourquoi pas, réutiliser tout ce qu'on a introduit jusqu'à maintenant dans le cours."
        },
        {
            "start": 3682,
            "end": 3700,
            "text": "Par exemple, je peux prendre comme première dimension de mon vecteur X, la somme pour l'ensemble des termes qui appartiennent à la fois au document et à la requête, du log de la fréquence du terme dans le document."
        },
        {
            "start": 3700,
            "end": 3717,
            "text": "Comme deuxième composante, je peux par exemple prendre cette quantité là, qui est pour l'ensemble des termes de la requête, le log de 1 plus la fréquence du terme dans le document sur le nombre de documents dans ma collection."
        },
        {
            "start": 3717,
            "end": 3739,
            "text": "Et puis voilà, je peux comme ça construire une représentation X en prenant du coup un ensemble de mesures statistiques, de statistiques que je peux construire à partir de ma requête et de mon document."
        },
        {
            "start": 3739,
            "end": 3749,
            "text": "Je peux aussi par exemple prendre les scores qui me sont donnés par d'autres modèles, comme par exemple le modèle vectoriel, le modèle booléen, le modèle probabiliste, etc."
        },
        {
            "start": 3749,
            "end": 3762,
            "text": "Là, il n'y a rien qui est interdit il faut juste que j'associe à ce couple QD un vecteur qui le caractérise au mieux dans cette problématique de recherche d'informations."
        },
        {
            "start": 3762,
            "end": 3771,
            "text": "Voilà, donc ça c'est l'étape fondamentale qui est l'étape de Feature Engineering."
        },
        {
            "start": 3771,
            "end": 3796,
            "text": "Et donc à une requête et à un ensemble de documents, donc je vais construire ce vecteur de caractéristiques avec des choses, un ensemble de caractéristiques qui sont dépendantes du couple requête-documents, mais aussi éventuellement des caractéristiques qui sont purement dépendantes du document, par exemple on peut mettre le page rank, voire des caractéristiques qui peuvent être purement dépendantes de la requête, etc."
        },
        {
            "start": 3796,
            "end": 3804,
            "text": "Voilà, l'autre problème c'est finalement les valeurs de sortie, donc le choix du nombre de classes."
        },
        {
            "start": 3804,
            "end": 3810,
            "text": "Ce choix du nombre de classes, il dépend a priori des valeurs de pertinence qu'on a à notre disposition."
        },
        {
            "start": 3810,
            "end": 3816,
            "text": "Est-ce que j'ai des valeurs de pertinence binaires, est-ce que j'ai des valeurs de pertinence multivaluées ou des scores de pertinence ?"
        },
        {
            "start": 3816,
            "end": 3823,
            "text": "Donc ça, on voit bien qu'il est assez facile d'avoir des valeurs de pertinence binaires."
        },
        {
            "start": 3823,
            "end": 3834,
            "text": "Si je veux des valeurs de pertinence multivaluées ou des scores de pertinence, ça peut nécessiter un travail d'annotation de longue haleine."
        },
        {
            "start": 3834,
            "end": 3841,
            "text": "Et puis bien sûr, c'est aussi très dépendant du système en question et des préférences des concepteurs."
        },
        {
            "start": 3841,
            "end": 3851,
            "text": "Voilà, dans le cas le plus simple, j'ai deux classes, la classe des documents pertinents et la classe des documents non pertinents, et du coup je peux me ramener très facilement à un problème de catégorisation binaire."
        },
        {
            "start": 3851,
            "end": 3856,
            "text": "Voilà, alors j'ai d'autres possibilités."
        },
        {
            "start": 3856,
            "end": 3868,
            "text": "Si je dispose d'annotations du rang, donc avec des jugements binaires, donc documents pertinents ou non pertinents, je me ramène à un problème de catégorisation binaire."
        },
        {
            "start": 3868,
            "end": 3883,
            "text": "Si j'ai des jugements multivalués, donc avec par exemple ce type de jugement, parfait, excellent, bon, meilleur, etc., des échelles de graduation, je peux me ramener à un problème de catégorisation multiclasse."
        },
        {
            "start": 3883,
            "end": 3889,
            "text": "Je peux aussi vouloir annoter des paires ordonnées, et notamment, je peux avoir des paires de préférence."
        },
        {
            "start": 3889,
            "end": 3899,
            "text": "Donc typiquement, et ça c'est des choses qui sont assez faciles à avoir dans le cadre du web, ces paires de préférence, en utilisant par exemple l'analyse des clics."
        },
        {
            "start": 3899,
            "end": 3909,
            "text": "Donc j'ai plutôt à voir comme donnée de sortie, en fait, le fait qu'un document D va être plus pertinent qu'un autre document pour une requête de données."
        },
        {
            "start": 3909,
            "end": 3918,
            "text": "Voilà, donc ça c'est des choses qu'on peut très facilement obtenir à partir des informations de clics, à partir du comportement utilisateur."
        },
        {
            "start": 3918,
            "end": 3928,
            "text": "Et puis, je peux avoir aussi des listes, avec donc des annotations de listes qui sont meilleures pour une requête qu'une autre liste de documents."
        },
        {
            "start": 3928,
            "end": 3932,
            "text": "Ça c'est des choses qui sont un peu plus difficiles à mettre en œuvre."
        },
        {
            "start": 3932,
            "end": 3952,
            "text": "Voilà, donc le choix du nombre de classes, vos valeurs de sortie, elles sont bien sûr très dépendantes du type d'annotation que vous pouvez associer à vos données, et notamment à ces couples documents requêtes."
        },
        {
            "start": 3952,
            "end": 3963,
            "text": "Voilà, alors après la question du choix du principe d'apprentissage et de l'algorithme, typiquement elle est plus compliquée à partir du moment où on a traité les deux précédentes questions."
        },
        {
            "start": 3963,
            "end": 3968,
            "text": "Donc après la représentation des données, en fait, toutes les techniques de catégorisation peuvent à priori être utilisées."
        },
        {
            "start": 3968,
            "end": 3973,
            "text": "Elles seront plus ou moins efficaces, mais elles peuvent à priori toutes être utilisées."
        },
        {
            "start": 3973,
            "end": 3980,
            "text": "Voilà, donc on utilise beaucoup, ou on a beaucoup utilisé les SVM parce qu'il y a une application assez directe."
        },
        {
            "start": 3980,
            "end": 3992,
            "text": "Typiquement, chaque couple QD contenant un document pertinent pour Q, elle va être associée à la classe plus 1, et les exemples avec les documents non pertinents à la classe moins 1."
        },
        {
            "start": 3992,
            "end": 3999,
            "text": "On va donc apprendre un hyperplan séparateur à partir de cet ensemble d'apprentissage."
        },
        {
            "start": 3999,
            "end": 4007,
            "text": "Voilà, donc je vais chercher les paramètres avec la théorie des SVM."
        },
        {
            "start": 4007,
            "end": 4016,
            "text": "Et puis, la valeur de sortie, elle me donnera directement une mesure pour définir un ordre sur les documents."
        },
        {
            "start": 4016,
            "end": 4026,
            "text": "Voilà, et donc le score d'un nouveau document pour une nouvelle requête, il va être directement fondé sur les valeurs des fonctions de catégorisation associées."
        },
        {
            "start": 4026,
            "end": 4035,
            "text": "Voilà, alors après, il y a trois grandes familles d'approches d'apprentissage pour l'ordonnancement."
        },
        {
            "start": 4035,
            "end": 4041,
            "text": "La première famille d'approches, c'est l'approche qu'on appelle l'approche par points."
        },
        {
            "start": 4041,
            "end": 4045,
            "text": "En fait, les documents vont être traités de manière indépendante dans cette approche."
        },
        {
            "start": 4045,
            "end": 4050,
            "text": "On ne va pas prendre en compte des pertes de pertinence, comme je l'ai expliqué tout à l'heure."
        },
        {
            "start": 4050,
            "end": 4059,
            "text": "On va avoir donc des approches par paire, où là on va prendre en compte des pertes de pertinence, c'est l'approche perouaise, et on peut aussi avoir des approches par liste."
        },
        {
            "start": 4059,
            "end": 4069,
            "text": "Je vais me contenter pour la fin de ce cours de parler de l'approche par points et je reviendrai sur les approches par paire et par liste lors du prochain cours."
        },
        {
            "start": 4069,
            "end": 4081,
            "text": "Le principe de l'approche par points, c'est ce qu'on vient de voir, c'est-à-dire qu'on va formaliser le problème d'ordonnancement comme un problème de catégorisation ou de régression."
        },
        {
            "start": 4081,
            "end": 4086,
            "text": "Les documents, je les considère de manière indépendante en entrée du système d'apprentissage."
        },
        {
            "start": 4086,
            "end": 4105,
            "text": "Et puis, mon jugement de pertinence, ça peut être soit un score réel, auquel cas je vais me rapporter un problème de régression linéaire, soit une classe de pertinence ordonnée, auquel cas je peux me rapporter un problème de régression ordinal, soit j'ai une classe de pertinence non ordonnée, et là je peux utiliser des techniques de classification."
        },
        {
            "start": 4105,
            "end": 4114,
            "text": "L'approche par points, on appelle ça une approche par points parce que mes documents sont considérés de manière indépendante en entrée du système d'apprentissage."
        },
        {
            "start": 4114,
            "end": 4132,
            "text": "Si j'ai un score de pertinence réel, je me ramène à un problème de régression linéaire et je vais résoudre ce problème de régression en minimisant pour chaque document une fonction de perte, qui est par exemple la somme des différences au carré."
        },
        {
            "start": 4132,
            "end": 4142,
            "text": "Avec Y qui est le score de pertinence de référence pour un document DI et Y qui est le score de pertinence prédit."
        },
        {
            "start": 4142,
            "end": 4151,
            "text": "La fonction de perte, c'est la différence au carré, et puis du coup, mon risque empirique, ça va être la somme des différences au carré."
        },
        {
            "start": 4151,
            "end": 4176,
            "text": "Si j'ai des classes de pertinence ordonnée, et puis si j'ai des classes de pertinence ordonnée, je vais avoir un problème de régression ordinale, qui va prendre en compte l'ordre relatif entre les classes, et du coup il va s'agir de déterminer F qui est une fonction d'ordonnancement qui va retourner un score réel de pertinence et N moins un seuil qui détermine la régression ordinaire."
        },
        {
            "start": 4176,
            "end": 4192,
            "text": "Et puis, si j'ai des classes de pertinence ordonnée, qui va retourner un score réel de pertinence et N moins un seuil qui déterminent finalement les limites des N catégories de pertinence."
        },
        {
            "start": 4192,
            "end": 4199,
            "text": "Voilà, concernant ce premier cours sur l'apprentissage pour l'ARI."
        },
        {
            "start": 4199,
            "end": 4213,
            "text": "En conclusion, ce que je vous ai présenté aujourd'hui, il y a une grosse partie qui était quand même une partie de rappel sur l'apprentissage, mais sinon je vous ai présenté un nouveau paradigme pour l'ARI."
        },
        {
            "start": 4213,
            "end": 4222,
            "text": "J'ai détaillé à la fin de ce cours l'approche par points, où le problème d'ordonnancement, on le transforme en un problème de catégorisation ou de régression."
        },
        {
            "start": 4222,
            "end": 4229,
            "text": "Ces approches d'apprentissage, il faut retenir que ce sont des approches qui vont tenter d'exploiter toutes les informations à disposition."
        },
        {
            "start": 4229,
            "end": 4236,
            "text": "On a des résultats qui vont être comparables à ceux des modèles probabilistes quand on a des collections qui sont classiques."
        },
        {
            "start": 4236,
            "end": 4246,
            "text": "Quand on a des grosses collections, et notamment par exemple dans le cas du web, pour lequel on peut disposer d'un espace d'attributs qui est très riche, on va avoir des meilleurs résultats."
        },
        {
            "start": 4246,
            "end": 4261,
            "text": "Après, il peut se poser des problèmes de malédiction de la dimension, et typiquement si notre description de notre couple requête document est très grand, on peut avoir après des problèmes de malédiction de la dimension."
        },
        {
            "start": 4261,
            "end": 4266,
            "text": "On peut se poser des questions de réduction de cette dimension pour éviter ces problèmes."
        },
        {
            "start": 4266,
            "end": 4272,
            "text": "Il y a un problème qui est non négligeable, qui est la disponibilité des annotations."
        },
        {
            "start": 4272,
            "end": 4283,
            "text": "Comment je peux obtenir des jugements de pertinence, pour constituer un jeu de données d'apprentissage, pour après mettre en oeuvre toutes ces techniques d'apprentissage ?"
        },
        {
            "start": 4283,
            "end": 4290,
            "text": "Voilà quelques petites lectures conseillées pour compléter cette première partie du cours."
        },
        {
            "start": 4290,
            "end": 4295,
            "text": "Je vous souhaite de bien mettre tout cela en application lors du Lab d'aujourd'hui."
        }
    ],
    "text": "Bonjour, nous entamons aujourd'hui la dernière thématique qui sera traitée dans ce cours spécifique de la ST4 et qui traite de l'apprentissage pour la recherche d'informations. Ce sera un cours en deux parties, il y aura donc la suite de ce cours qui sera le sujet de la prochaine séance. Rapidement, pour introduire ce nouveau paradigme pour la recherche d'informations, je vais d'abord revenir sur les systèmes de recherche d'informations classiques que nous avons vus jusqu'alors. Ce que nous avons vu jusqu'alors, c'est que pour une requête de NéQ qui traduit un besoin d'information, une collection de documents qui est indexée, on a vu un certain nombre de modèles de recherche qui permettent de retourner une liste ordonnée de documents. Ces modèles de recherche peuvent être divers, nous en avons vu plusieurs lors de ce cours. Par exemple, ici, ce modèle de recherche pourrait être la probabilité de pertinence sachant Q et D et qui pourrait être estimée en utilisant par exemple le modèle BM25 qui est fonction de l'IDF et puis d'une fonction de pondération portant sur la fréquence des termes dans un document et puis une normalisation par la longueur du document. Tout au long du cours, on a vu plusieurs types de modèles, des modèles basés similarités comme le modèle booléen ou le modèle vectoriel. On a aussi présenté plusieurs modèles probabilistes, notamment le modèle d'indépendance binaire et le modèle BM25. Et puis, plus dernièrement, on a présenté des modèles qui prennent en compte la structure de la collection et notamment tous les modèles qui sont basés sur une analyse des liens de la collection, comme par exemple le modèle du page rank ou le modèle head. Quelques discussions sur ces modèles de classement. Pour un modèle particulier, on a vu que le paramétrage est souvent difficile, surtout quand il y a beaucoup de paramètres. Typiquement, pour le modèle vectoriel, quelle est la bonne mesure de pondération à utiliser pour le document pour la requête, quelle est la bonne distance à utiliser, etc. Pour comparer deux modèles, on a vu aussi que c'était compliqué. Ça, c'est notamment tout le cours qui a trait à l'évaluation. La comparaison rigoureuse, c'est quelque chose qui est assez difficile et notamment en recherche d'informations, on met plutôt en œuvre des évaluations par benchmark, donc une évaluation empirique. On peut souvent être dans des problématiques où on est dans des cas de surparamétrage. Et puis, si cette fois-ci on prend une collection de modèles, par exemple l'ensemble des modèles probabilistes versus l'ensemble des modèles par similarité, ça se complexifie. On a notamment beaucoup de modèles qui existent. Dans la littérature, on en dénombre plus d'une centaine, voire maintenant même des milliers. Et il y a plusieurs questions qui peuvent se poser, notamment quel est le meilleur des modèles ? Comment je peux comparer ces modèles et éventuellement comment je peux les combiner ? Les systèmes actuels, notamment les systèmes de recherche web que vous utilisez quotidiennement, pour une requête donnée, ils calculent souvent plusieurs centaines de fonctions de score de base. Entre cette requête et chaque document de la collection, et ils combinent ces scores. Donc une question clé, c'est comment combiner ces scores ? Et notamment, ça c'est toute la science qu'on appelle la science des CEO. Avec typiquement, vous pourrez trouver un ensemble d'articles assez généralistes qui justement parlent des 200 facteurs de classement de Google et qui donnent des recommandations, notamment si vous voulez que votre site web soit bien référencé. Il y a un paquet d'illustrations assez rigolotes d'ailleurs sur ces facteurs et paramètres. Alors voilà, notamment une illustration sous la forme d'une table périodique, justement des facteurs de succès des SEO, notamment pour tout ce qui est référencement de site web. Avec donc des facteurs qui sont propres à la page, des facteurs qui sont extérieurs, contextuels, etc. Il y a toute une littérature sur ce sujet là. Voilà, et c'est là qu'intervient l'apprentissage pour la recherche d'informations, parce qu'en fait les techniques d'apprentissage automatique, c'est des bons outils pour le paramétrage automatique, pour combiner plusieurs évidences, donc la question de la combinaison et de la fusion des scores dont on parlait juste avant, et puis ils permettent aussi d'éviter le surparamétrage. Donc toutes ces approches d'apprentissage pour la RI, elles ont un nom, c'est ce qu'on appelle le Learning to Rank, et ça rassemble l'ensemble des méthodes qui vont utiliser des approches d'apprentissage pour le problème de l'ordonnancement. C'est la science qu'on appelle la science d'apprendre à ordonner, et qui a explosé dans le domaine de la recherche d'informations à partir de 2005. Tous les moteurs de recherche actuels utilisent des approches à base d'apprentissage, et même aujourd'hui à base d'apprentissage profond. Notamment, ce dont on va parler aujourd'hui, c'est l'optimisation automatique à l'aide d'algorithmes d'apprentissage de la fonction d'ordonnancement. Et donc on va introduire un nouveau modèle pour la recherche d'informations qui va suivre ce schéma-là. C'est-à-dire qu'on va considérer un ensemble de données, qui vont être nos données d'apprentissage, qui sont composées de requêtes et d'un ensemble de documents qui sont associés à ces requêtes, et bien sûr de jugements de pertinence entre cette requête et ces documents. Donc ça on va le faire, on va prendre en compte des données pour plusieurs requêtes. Et puis sur cet ensemble de données, qu'on va appeler l'ensemble d'apprentissage, on va utiliser un système d'apprentissage qui va apprendre une fonction de classement F de QD. Et puis pour une nouvelle requête, Q de M plus 1, et notre ensemble de documents, notre collection qui reste indexée, avec l'ensemble des principes d'indexation qu'on a vus jusqu'alors, et bien on va appliquer ce modèle appris, ce système d'ordonnancement appris, pour classer les documents pertinents pour la requête QI de M1, avec ce modèle d'apprentissage. Donc on aura toujours en sortie une liste ordonnée de documents. Ça, ça ne change pas. Ce qui change, c'est vraiment ce système d'apprentissage qui va utiliser des données d'apprentissage pour apprendre cette fonction d'ordonnancement, qui elle ensuite est utilisée de manière classique dans un système d'ordonnancement. Donc l'apprentissage pour l'AERI, en fait, il va reposer sur deux concepts principaux, qui sont la notation des données et la représentation des couples requêtes documents dans un espace de caractéristiques qu'il faudra déterminer. Ça, c'est une étape très importante, qu'on appelle l'étape de description ou feature engineering. Et puis, il y a la phase d'apprentissage en tant que telle, avec l'utilisation d'une structure d'apprentissage en deux étapes assez classique, avec une étape d'apprentissage de la fonction d'ordonnancement F de QD, et puis une étape de test, d'utilisation du modèle appris sur de nouvelles requêtes. Voilà, donc au final, on a vraiment ce schéma-là pour la recherche d'informations avec apprentissage, donc pour le learning to rank, un ensemble de jeux de données d'apprentissage qui sont composés de couples requêtes documents qu'on va décrire. Voilà, donc notamment, en fait, une grosse partie du travail, ça va être de constituer ce vecteur X, qui est un vecteur caractéristique de ce couple requêtes documents. Ces données, elles sont labellisées, c'est-à-dire qu'on a une vérité terrain, et cette vérité terrain, en fait, elle est fonction de la pertinence du document D1 pour la requête Q1. Et puis, donc, on a un système d'apprentissage qui va reposer sur l'optimisation d'une fonction et d'un critère. On va donc, en sortie, avoir un modèle F qui est appris à partir de ces données d'apprentissage. Et puis, donc, on a nos nouvelles données qui sont nos données de test ou nos données de production où, cette fois-ci, on n'a pas la vérité terrain, donc on n'a pas les valeurs de pertinence, et l'objectif, ça va être justement de prédire ces valeurs avec le modèle appris. Donc, on va décrire de la même manière le couple Q1 D1, et puis, en fait, ce que va retourner le système d'ordonnancement, c'est une liste ordonnée des documents, donc selon cette fonction d'ordonnancement. On va donc détailler tous ces concepts lors de ce cours, et je vais d'abord vous rappeler quelques généralités sur l'apprentissage, et notamment l'apprentissage supervisé. Puis, on parlera du cas spécifique de la catégorisation de documents appliqués à la recherche d'informations. On parlera donc de la recherche d'informations et de l'ordonnancement. Et puis, la semaine prochaine, on parlera plus spécifiquement, donc on continuera à la partie arrière d'ordonnancement, et on parlera aussi plus spécifiquement des données d'apprentissage à utiliser ou à constituer, et des différents jeux de tests qui sont à disposition de la communauté. Donc, pour commencer, quelques généralités sur l'apprentissage. On va considérer un processus d'inférence en trois étapes, où la première étape va être d'observer un phénomène, puis à partir de cette observation du phénomène, à partir de données d'observation de ce phénomène, on va construire un modèle associé à ce phénomène. Et puis, l'idée, c'est ensuite d'utiliser ce modèle pour faire des prédictions relatives justement à ce phénomène. L'apprentissage automatique, c'est l'automatisation de ce processus d'inférence. Avec une hypothèse forte qui dit qu'il existe des relations entre les données et que les algorithmes d'apprentissage vont nous permettre de les trouver. Il existe différentes familles d'algorithmes d'apprentissage, et classiquement, on les catégorise selon deux grands axes. Le premier axe, c'est le mode d'apprentissage, avec différents modes d'apprentissage assez connus. Notamment l'apprentissage supervisé, pour lequel on va vouloir apprendre des relations entre des entrées et des sorties, avec un oracle qui nous donne des exemples qui vont exprimer ces relations. On va avoir à disposition ce qu'on va appeler un ensemble d'apprentissage, avec des données d'entrée qui vont être labellisées. L'autre mode d'apprentissage, c'est l'apprentissage non supervisé. Cette fois-ci, on n'a pas d'oracle, donc on n'a pas d'exemple qui exprime des relations entre des entrées et des sorties. Ce qu'on va chercher à faire, c'est apprendre une structure dans un ensemble de données. Typiquement, ces techniques d'apprentissage non supervisé, c'est toutes les techniques qu'on appelle les techniques de clustering. Et puis, on a d'autres paradigmes, comme par exemple l'apprentissage semi-supervisé, où l'objectif, c'est toujours bien d'apprendre les relations entre des entrées et des sorties. Parmi les exemples à notre disposition, l'oracle nous fournit la sortie seulement pour un petit nombre de ces exemples. L'idée de l'apprentissage semi-supervisé, ça va être de tirer parti de ces exemples, et l'idée de l'apprentissage semi-supervisé, ça va être de tirer parti des autres données, c'est-à-dire des données sans étiquettes. C'est un mode d'apprentissage qui revient beaucoup au goût du jour, notamment à cause du succès des techniques d'apprentissage profond, qui nécessitent lors de la phase d'apprentissage d'énormément de données supervisées, donc de données annotées, qui sont coûteuses à obtenir à grande échelle. Les données sans annotation sont moins coûteuses à obtenir, et l'idée du semi-supervisé, c'est aussi de tirer parti de ces données qui sont plus faciles à obtenir. On peut aussi classer les techniques d'apprentissage selon le type de problème qu'on souhaite traiter. Typiquement, pour les algorithmes d'apprentissage supervisé, on a souvent deux grands types de problèmes, le problème qu'on appelle la régression et la classification. Ce qui différencie ces problèmes, c'est le type des valeurs de sortie. Typiquement, pour la régression, on va chercher à prédire une valeur continue, et pour la classification, on va chercher à prédire une valeur dans un ensemble discret, dans un ensemble de classes discrètes. On a aussi beaucoup d'autres approches, beaucoup d'autres familles d'apprentissage, notamment l'apprentissage par renforcement, qui est connu, parce que c'est notamment le type d'apprentissage qui a été mis en oeuvre en partie dans AlphaGo, qui a vaincu l'Isédol au jeu de Go, et qui consiste à apprendre un comportement face à diverses situations, en optimisant une récompense quantitative. On a aussi l'apprentissage actif, où on va demander à un utilisateur ou un pôle d'utilisateurs d'annoter un sous-ensemble de données de manière incrémentale. Et puis prendre en compte ce sous-ensemble de données à noter au fur et à mesure pour améliorer notre modèle. Et puis il y a d'autres modes d'apprentissage, comme l'apprentissage par analogie, le méta-apprentissage, etc. Dans ce cours, on va principalement se référer à l'apprentissage supervisé. Je vais déjà commencer par rappeler quelques principes de l'apprentissage supervisé. On va considérer un espace d'entrée X qui est inclus dans Rd, et un espace de sortie Y qui est inclus dans R. On peut par exemple vouloir prédire une valeur dans R, ou on va pouvoir aussi vouloir prédire des catégories. La régression prédit une valeur dans R, ou catégorie, donc ça va être des choses discrètes. L'hypothèse fondamentale de l'apprentissage supervisé, c'est cette hypothèse-là, qui dit que les paires d'exemples XY sont IID, c'est-à-dire qu'elles sont identiquement et indépendamment distribuées suivant une distribution de probabilité fixe, mais qui est inconnue, D. Ce qu'on a à disposition, c'est un ensemble d'échantillons, c'est-à-dire une séquence de n paires XY qui sont donc bien sûr générées suivant cette distribution de probabilité fixe, mais inconnue, D. Cet ensemble de couples, de paires XY, c'est ce qu'on appelle l'ensemble d'apprentissage. Le but de l'apprentissage supervisé, ça va être de construire une fonction F qui va de X dans Y et qui va prédire la sortie Y d'une nouvelle observation X avec une probabilité d'erreur minimale. La plupart des techniques d'apprentissage supervisé reposent sur des travaux théoriques, notamment qu'on doit à Vladimir Vapnik et ses collègues, et qui a montré qu'on pouvait borner la probabilité d'erreur, donc cette probabilité d'erreur qu'on veut minimale, RF, qui est le risque fonctionnel, je reviendrai sur cette notion juste un peu plus tard, par l'erreur empirique de F, l'erreur qu'on va pouvoir mesurer sur l'ensemble d'apprentissage, plus deux termes qui sont fonction de la complexité de la classe de fonctions, donc la classe de fonctions F qu'on va choisir. Par exemple, on pourrait prendre la classe des fonctions linéaires ou d'autres classes de fonctions, plus un terme résiduel. Donc la question fondamentale de l'apprentissage supervisé, c'est comment choisir F ? Juste quelques remarques importantes sur l'apprentissage supervisé, des choses à retenir. La seule observation dont on dispose, c'est l'ensemble des couples XY, c'est notre échantillon, notre ensemble d'apprentissage D est inconnu. Je viens de le dire, cet échantillon, cet ensemble C, c'est ce qu'on appelle l'ensemble d'apprentissage. Donc X, ça appartient à grand X, et en général, on prend une représentation vectoriale, donc X est inclus dans grand Rd. Dans notre cas, X, ça va consister en un document, et on va représenter ce document par un vecteur dans l'espace vectorial des termes, en utilisant la représentation sac de mots qu'on a introduit plus tôt dans le cours. Y, ça appartient à Y, et par exemple, si on a un problème de catégorisation binaire, on considère souvent que Y, c'est moins un ou plus un. Dans notre cas, c'est assez facile de se ramener à un problème de catégorisation binaire. Typiquement, on peut vouloir classer les documents en documents pertinents versus documents non pertinents. On classe la classe des documents pertinents versus la classe des documents non pertinents. Revenons à l'objectif de l'apprentissage supervisé. On l'a dit tout à l'heure, on cherche à construire une fonction F à partir des n données d'apprentissage, telle que F va prédire la sortie Y associée à une donnée X. Quelles sont les propriétés voulues de F ? Quelles sont les propriétés de cette fonction F ? La première propriété relativement intuitive, c'est bien sûr que F doit prédire les bonnes valeurs pour l'ensemble des données de notre ensemble d'apprentissage. Quelles que soient XI et Y dans C, F de XI doit être égal à Y. L'autre propriété fondamentale en apprentissage automatique, c'est que F doit aussi pouvoir prédire les bonnes sorties pour des exemples futurs XJ, c'est-à-dire pour des données X qui n'appartiennent pas à l'ensemble d'apprentissage. C'est ce qu'on connaît sous le problème de la génération de données. Juste quelques illustrations, et notamment selon l'axe type de problème à traiter. Si Y est à valeur réelle, c'est-à-dire que Y est égal à Rm, alors on est dans ce cas-là, on est dans un cas de régrégation de la valeur de la donnée. On a donc un X qui est égal à Rm, et on a un X qui est égal à Rm. On est dans un cas de régression. Ici, on a une illustration d'un problème de régression. On a les points noirs qui sont nos données d'apprentissage, on a la vraie fonction, et ce qu'on cherche à construire, c'est une fonction F de X qui va être la plus proche possible de la fonction en bleu. Qui va être une bonne estimation de cette fonction en bleu qui représente la vraie fonction. Quand on est sur un problème de classification, XI va être associé à une sortie catégoriale. On voit ici une illustration d'un problème où on a deux classes. Un problème de classification binaire, les points noirs et les points rouges. Ici, on est sur un problème de classification à trois classes. On voit bien les classes qui sont bien séparées. Dans ce cas-là, on va parler de classification. Supposons qu'on a notre fonction F On peut se poser des questions sur la qualité de cette fonction F Pour ça, on va s'équiper d'une fonction de coût, qu'on appelle la fonction de coût aussi la loss function et donc qui est un élément clé de la théorie de l'apprentissage, de comment fonctionne l'apprentissage supervisé. Et notamment cette fonction de coup, elle doit permettre de pénaliser les erreurs. Typiquement, cette fonction de coup, elle doit pénaliser le cas où on va avoir une prédiction Y, chapeau, donc Y chapeau qui est égale à f de X, qui est différente du vrai Y que l'on connaît, donc dans les données qu'on a dans notre ensemble d'apprentissage. Voilà donc une fonction de coup, c'est une fonction L qui va de Y dans R plus, telle que L de Y qui va être supérée à zéro pour toute Y qui est différente de Y. Donc ce qu'on veut au travers de cette fonction de coup, bien sûr, c'est que le coût d'une bonne prédiction soit plus faible que le coût d'une erreur. Alors il existe énormément de fonctions de coup possibles. Si par exemple on se rapporte à un problème de classification, on a un coût qui est très connu, qui est le coût 0,1, où on va avoir un coût de zéro si Y est égal à f de X, donc si Y est égal à f de X, c'est-à-dire si on a une bonne prédiction et un sinon. Typiquement, ce coût 0,1, il consiste à mesurer le nombre de points qui est mal classé par la fonction f. Donc là, ça devient intéressant et on rentre un petit peu plus dans la théorie de l'apprentissage supervisé, notamment en introduisant la minimisation du risque. Donc ce qu'on souhaite, c'est construire une fonction f à partir de n données, donc nos données d'apprentissage, et ce qu'on veut c'est que f donne des bonnes approximations sur ces n données et aussi sur les données futures. Donc en fait, ce qu'on cherche à faire, c'est minimiser le risque, ou risque fonctionnel ou erreur de généralisation, qui est finalement l'espérance de notre fonction de coup L, par rapport à XY bien sûr. Donc ce risque fonctionnel, c'est l'espérance, donc selon la distribution de probabilités jointes P du XY, de notre fonction de coup L. Ça, ça représente en moyenne le coût pour toutes les données possibles. Et donc c'est là que ça devient compliqué, parce qu'on n'a pas toutes les données. Il est impossible d'avoir toutes les données possibles. Par contre, ce qu'on a, c'est notre ensemble d'apprentissages C. C'est notre échantillon, et donc sur cet ensemble d'échantillons C, on peut bien sûr calculer et mesurer le risque empirique, qui est donc la moyenne pour l'ensemble des données d'apprentissage de ce que donne la fonction de coup sur ces données d'apprentissage. Et ce qu'on cherche à faire, c'est minimiser le risque. Donc est-ce qu'on peut se contenter de minimiser, de chercher F, parmi une classe d'hypothèses, parmi un ensemble de fonctions F ? Ce qu'on va chercher à faire, c'est trouver la fonction F qui va minimiser le risque. Donc comme on n'a que le risque empirique, est-ce qu'on peut se contenter finalement de chercher la fonction F, parmi notre classe d'hypothèses, qui va minimiser le risque empirique ? La réponse à cette question, c'est non. Pourquoi ? Parce qu'en fait le risque empirique, il ne va pas permettre d'évaluer la pertinence du modèle, parce que typiquement on peut tomber dans des problèmes qu'on appelle des problèmes de surapprentissage. C'est-à-dire qu'on va pouvoir, en minimisant le risque empirique, choisir une fonction F telle que le risque empirique va être très bas, voire nul. Et notamment, plus on prend une fonction F qui va être complexe et qui va du coup fiter les données, plus on va être dans ce cas-là. Mais par contre, sur de nouvelles données, donc sur un ensemble de tests, ce risque, l'erreur de généralisation, elle va être très élevée. L'erreur de prédiction, elle va être élevée. Donc ça, c'est typiquement un cas très connu en apprentissage, qui s'appelle le cas du surapprentissage. Donc la solution, en fait, ça va être de minimiser le risque empirique, donc à partir de notre échantillon d'apprentissage, et on va rajouter à ce risque empirique, en fait, un terme qu'on va appeler un terme de régularisation, qui va donc permettre la généralisation du modèle d'apprentissage. Donc ça, c'est vraiment ce qu'a montré la théorie de Vapnik, que la construction d'une fonction d'apprentissage, on peut la formaliser comme un problème de minimisation. Donc parmi une famille de fonctions qu'on appelle les classes d'hypothèses, chercher F appartenant à F, qui va minimiser le risque empirique régularisé, donc avec un facteur de régularisation lambda. Voilà, donc, rapide bilan sur l'apprentissage supervisé. Un algorithme d'apprentissage a un ensemble de fonctions F, donc ça, c'est notre classe d'hypothèses. Par exemple, vous pouvez prendre l'ensemble des fonctions linéaires, l'ensemble des fonctions de type réseau de neurones, enfin voilà, on a ce qu'on appelle une classe d'hypothèses. Et ce que fait cet algorithme d'apprentissage, c'est qu'il va sélectionner parmi cet ensemble de fonctions, la fonction la plus appropriée, donc en utilisant l'ensemble d'apprentissage, donc la minimisation du risque empirique, et la fonction objective, donc notre fonction de coût, avec bien sûr ajouté à ce risque empirique une fonction de régularisation qui, elle, est définie par l'utilisateur. Ensuite, cet algorithme d'apprentissage, il va réaliser la sélection de F, donc avec des méthodes qui lui sont propres, qui sont souvent des techniques qui font appel à des techniques d'optimisation, type des centres de gradients, par exemple, pour les réseaux de neurones, passage au lagrangien pour les SVM, etc. Voilà, et un aspect important, en fait, de l'apprentissage dont je n'ai pas parlé, c'est la représentation des exemples, c'est ce qu'on va donner en entrée, finalement, de notre système d'apprentissage. Donc ça, c'est typiquement une problématique qu'on appelle la problématique du feature engineering et qu'on oppose aujourd'hui aux approches qu'on appelle de représentation learning, où, en fait, on va apprendre aussi une représentation de nos exemples, et c'est typiquement ce que permet de faire des approches de type apprentissage profond. Mais ça, c'est hors sujet, en fait, de type apprentissage profond. Mais ça, c'est hors sujet pour ce cours, aujourd'hui, en tout cas. Voilà, donc maintenant, on va revenir à notre problème de recherche d'informations et on va s'intéresser plus spécifiquement à des problèmes de catégorisation et le lien avec la recherche d'informations. Donc, on va prendre comme exemple le problème de la catégorisation de documents. Donc, on peut très facilement illustrer sous la forme de ce schéma-là. Donc, on a nos deux phases classiques dans les systèmes d'apprentissage, une phase d'entraînement du modèle et une phase de prédiction. Voilà, donc on a une collection de documents qui est labellisée, étiquetée. Donc, pour chaque document, on a un ensemble d'étiquettes. Les documents, donc, il y a toutes les tables de construction de feature engineering. Donc, typiquement, les documents, on va les représenter sous la forme de documents vectorisés. Donc, par exemple, avec des représentations TFIDF dans l'espace des termes du vocabulaire qu'on a construit sur la collection. Et puis, comme on a donc nos données labellisées, comme on a des étiquettes, on va donc apprendre un modèle de catégorisation sur ces données-là. Et puis, maintenant, on peut utiliser ce modèle dans une phase de prédiction pour un nouveau document test que je décris de la même manière, bien sûr. Donc, je construis aussi une représentation vectorisée de mon document. J'utilise mon classifieur et je prédis donc une étiquette pour des primes. Alors, si je définis ça de manière un peu plus formelle, je vais considérer un espace de représentation pour mes documents quantiques. J'ai un ensemble de classes fixées C, qui sont les différentes catégories possibles pour mon document, donc l'ensemble des classes qui sont les classes d'étiquettes. Et puis, j'ai donc mon ensemble d'apprentissages D qui est composé de paires D et C, les étiquettes associées. Et puis, il va suffire d'apprendre une fonction F, un classifieur qui va associer les documents à sa classe ou à leur classe. Alors, ça peut être un problème de classification multiclasse. Voilà. Alors, juste faites attention parce que ici j'ai changé mes notations et notamment C ici est mon ensemble de classes et non plus mon ensemble d'apprentissages et D n'est plus ma distribution de probabilités inconnues, mais c'est mon ensemble d'apprentissages. Je suis désolée pour ce petit changement, donc j'insiste bien là-dessus. Attention aux changements de notation par rapport aux slides précédentes. Voilà. Alors, il y a plein d'applications, en fait, de la catégorisation de documents pour la recherche d'informations. Il y a énormément d'applications possibles. Par exemple, on a vu que toutes les techniques d'indexation étaient dépendantes de la langue, ne serait-ce que l'étape de tokenisation, même si aujourd'hui il existe des tokenizers qui sont langages indépendants. Et du coup, il est souvent nécessaire, étant donné un document, d'identifier sa langue pour justement appliquer la bonne chaîne de traitement linguistique. Eh bien, ça c'est un problème de catégorisation. L'ensemble des classes, c'est l'ensemble des langages du corpus, et puis ce qu'il faut, c'est étant donné un document, prédire la langue du document. On peut aussi utiliser ce principe de catégorisation, par exemple dans le cas du web, pour détecter des pages qui sont des spams ou des pages qui sont des non-spams, et notamment pour éviter d'avoir à indexer des pages qui sont des pages de type spam. Voilà, alors d'autres applications assez connues, c'est par exemple tout ce qui est détection de sentiments dans des données qui sont des données de réseaux sociaux, voilà, type tweet, etc. Voilà, alors en recherche d'informations, une application aussi assez classique de la catégorisation de documents, c'est la détection de thématiques ou la recherche de verticaux. Typiquement, dans les moteurs de recherche grand public, ce qu'on appelle un vertical ou les verticaux, c'est typiquement par exemple de limiter une recherche par exemple à l'ensemble des actualités, ou à l'ensemble des images, ou à l'ensemble des vidéos. Ça c'est des verticaux. Et donc, associer un document au type de vertical recherché, ou quel il correspond, ça c'est un problème de classification. Voilà, alors on va du coup maintenant s'intéresser à quelques algorithmes de catégorisation qui sont un peu les algorithmes historiques qu'on utilise pour la recherche d'informations. Voilà, il y a deux grandes familles d'algorithmes de catégorisation selon le type finalement de modèles qu'on utilise. Il y a notamment des algorithmes qui sont des algorithmes qui font partie des modèles qu'on appelle les modèles génératifs. Ça c'est typiquement les premiers modèles d'apprentissage qui ont été développés pour la catégorisation de documents. Ces modèles génératifs, en fait, ils se basent sur l'hypothèse qui est écrite sur cette slide, qui consiste à dire que chaque vecteur représentatif d'un document D, on va le modéliser comme la réalisation d'une variable aléatoire multidimensionnelle, qui est générée par le mélange de cas densité de probabilité avec des proportions pica telles que la somme des pica pour l'ensemble des cas densité est égale à 1. Et puis bien sûr pica c'est supérieur à 0. Donc typiquement, k c'est typiquement les différentes classes possibles. Un exemple d'algorithme ou de méthode de catégorisation qui fait partie de ces modèles génératifs, c'est par exemple le classifère Bayesien qui utilise du coup la règle de Bayes, le classifère qu'on appelle le classifère Bayesien naïf. On peut aussi proposer des approches pour la catégorisation en utilisant des modèles qu'on appelle les modèles discriminants, qui eux vont directement trouver une fonction de classification F donc de grand Rd, qui est l'espace de représentation de nos documents, dans grand Y et qui va résoudre le problème de catégorisation sans faire d'hypothèses sur la manière dont sont générés les exemples. Donc une façon un peu d'illustrer la différence entre ces deux catégories de modèles. Ici le modèle génératif c'est vraiment le modèle du peintre qui va typiquement essayer de reproduire au mieux le processus de génération de données et ici c'est l'approche du caricaturiste qui va grossièrement tracer les traits discriminants des données. Alors un exemple d'approche de classification qui fait partie des modèles discriminants c'est par exemple les SVM qui sont les séparateurs à vaste marge ou d'autres approches comme les capes le proche voisin ou le perceptron, des approches de régression logistique etc. Ce sont des modèles discriminants. On va s'intéresser dans un premier temps à des modèles génératifs donc assez classiques en recherche d'informations. Notamment on va s'intéresser au classifieur Bayesian. Pour vous introduire ce classifieur Bayesian, je vais utiliser un exemple qui vient d'un très bon cours d'apprentissage de Gilles Gassot où on prend un problème de classification jouet qui consiste à classer un fruit comme en deux classes possibles comme poire donc ça c'est la classe C1 ou pêche c'est la classe C2. Alors on peut classer un fruit donné qui est donc une donnée d'entrée en utilisant une probabilité a priori qui reflèterait notre connaissance qu'un fruit soit une poire ou une pêche sans qu'on ait observé le dit fruit. Par exemple voilà je regarde mon contexte je sais que nous sommes au mois de mai et donc voilà ma connaissance me dit que la probabilité que le fruit soit une pêche elle est plus forte que le fruit soit une poire selon l'aspect saisonnalité. Donc on a bien sûr ces propriétés sur les probabilités a priori la probabilité a priori d'être une poire plus la probabilité a priori d'être une pêche elle est égale à 1 et puis du coup je peux utiliser ces probabilités a priori pour mon problème de classification. Typiquement je vais affecter le fruit à la classe 1 si la probabilité a priori d'être de la classe 1 donc d'être une poire elle est plus grande que la probabilité a priori d'être de la classe C donc d'être une pêche. On voit qu'en faisant ça donc sans prendre en compte les caractéristiques intrinsèques des données je risque d'avoir un risque d'erreur qui va être important. Et donc pour contrabalancer ça l'idée ça va être de prendre en compte les caractéristiques intrinsèques des données de notre fruit et donc de passer par cette étape de représentation. De définir un ensemble de caractéristiques X qui vont appartenir à RDR et qui vont représenter le fruit comme par exemple sa forme sa couleur son odeur etc. Des choses qui vont caractériser un ensemble d'observations sur l'objet qu'on cherche à classifier. Et puis du coup je vais définir des lois conditionnelles pour les différentes classes. Donc mes deux classes C1 poire C2 pêche donc P de X sachant C1 et P de X sachant C2. Typiquement une illustration possible de ces lois conditionnelles avec en rouge la classe C1 et en bleu la classe C2. Du coup je vais en utilisant le théorème de Bayes pouvoir calculer la probabilité a posteriori de ces cas sachant X. Cette probabilité a posteriori je l'obtiens avec le théorème de Bayes et il m'est fourni par cette équation. P de X sachant C4 fois la probabilité a priori de ces cas sur la somme entre P de X sachant C1 probabilité a priori de C1 plus P de X sachant C2 plus la probabilité a priori de C2. Ça c'est le théorème de Bayes. Et en utilisant du coup ces probabilités a posteriori je vais avoir une nouvelle règle de décision qui va consister à affecter X à la classe de plus forte probabilité a posteriori. Donc si la probabilité a posteriori de poire sachant X est plus grande à la probabilité a posteriori de pêche sachant X alors X est de la classe poire c'est une instance de poire. Donc je définis ainsi avec cette règle de décision une frontière de décision. On va l'appeler une frontière de décision. Puis typiquement je vais pouvoir qualifier cette frontière de décision justement en regardant comment ça se comporte sur sur des données de test. Typiquement en regardant le taux d'erreur c'est à dire le nombre de modèles de mauvaise décision sur le nombre total de décisions. Voilà donc la démarche qu'on va mettre en oeuvre pour des modèles génératifs de type classif eurbégien. C'est celle que je vais présenter juste maintenant. J'observe un ensemble de caractéristiques notées X qui décrivent une entité. Je suppose qu'une entité provient d'une classe donnée et je vais prendre une décision en fonction de l'observation de ces caractéristiques. Chaque décision, action, va donc avoir un certain coût en fonction de la classe à laquelle appartient X. Et puis l'objectif du classif eurbégien ça va être de trouver une règle de décision qui va minimiser un coût moyen définissant quelles décisions prendre en fonction de l'entité observée. On retrouve ici les objectifs de notre apprentissage au supervisé. Quelques notations qui vont être utiles pour la suite. On a un ensemble de classes C1, C4, de probabilité a priori PR de CK, c'est à dire la probabilité que C est égale à CK pour chaque classe. On a donc un espace de caractéristiques X. Typiquement X peut être égal à Rd. Et puis on a donc la probabilité à... a posteriori, la probabilité que C est égale à CK, sachant que X est égale à X. On va noter P de CK sachant X. La loi conditionnelle de X à la classe CK, c'est la probabilité de X sachant CK, c'est égal à la probabilité que la variable aléatoire X prenne la valeur X, sachant que la classe C est égale à CK. La loi marginale de X, on va la définir sur l'ensemble des classes possibles. C'est la somme pour l'ensemble des classes possibles de la loi conditionnelle de X à la classe CK fois la probabilité a priori de CK. Le problème, ça va être trouver la classe de X par une approche probabiliste en utilisant le maximum a posteriori. La classe pour X, ça va être la classe qui va permettre de maximiser cette quantité-là. La remax selon K de cette quantité-là. Ce qu'il va falloir faire pour mettre en œuvre le classifiant abézien, ça va être d'estimer les quantités de cette formule à partir de notre ensemble d'observation, donc à partir de notre ensemble d'apprentissage. Typiquement, ce qu'on va chercher à estimer, c'est les probabilités PR de CK, donc la probabilité a priori pour chaque classe, et la probabilité, la loi conditionnelle de X à la classe CK, donc P de X sachant CK. On a maintenant tout ce qu'il faut pour appliquer ces modèles génératifs à notre problème de catégorisation de documents. Je reviens sur l'hypothèse dont j'ai déjà parlé, qui va consister à considérer que chaque vecteur représentatif d'un document D, c'est la réalisation d'une variable aléatoire multidimensionnelle, qui va être générée par le mélange de K densité de probabilité, avec des proportions πK. K étant le nombre de classes possibles. Avec ces propriétés-là, la somme des πK pour l'ensemble des classes possibles, c'est 1, et πK, c'est supérieur ou égal à 0. Chaque fonction de densité, c'est une fonction paramétrique qui modélise la distribution de probabilité conditionnelle de classe, associée à une classe K qui appartient à Y. Cette distribution de probabilité conditionnelle de classe, on va l'exprimer comme une fonction de densité, donc une fonction paramétrique avec des paramètres θK. Pour la classe K. La densité de mélange, elle modélise quoi ? Elle modélise finalement la génération de D par ses K densité de probabilité. Le modèle génératif de D étant donné l'ensemble des paramètres, c'est une loi de mélange, c'est la somme pour l'ensemble des classes possibles, de πK fois cette fonction de densité associée à chaque classe. Exactement comme tout à l'heure, la poire ou la pêche finalement. Ici, les classes sont différentes. Donc, Theta, c'est l'ensemble des proportions πK et tous les paramètres qui définissent les fonctions de densité fK. Donc, θ, c'est l'ensemble des πK pour chacune des classes possibles et puis les paramètres des lois de densité. Le but de l'apprentissage, ça va être d'estimer cet ensemble de paramètres θ pour qu'au sens du maximum de vraisemblance, le modèle de mélange explique au mieux les exemples de la base d'entraînement. Après cette estimation des paramètres, on va pouvoir classer un nouveau document des primes à une classe de l'ensemble Y en utilisant la règle de décision Bayesian que j'ai présentée tout à l'heure. Des primes va appartenir à la classe classe, 6K, c'est la remax pour l'ensemble des classes possibles, de P, de Y et de H, sachant des primes. Avec Bayes, toute cette équation, je peux l'écrire comme ça, en faisant intervenir les paramètres de ma loi de mélange, les paramètres de mon modèle génératif. La vraie question, c'est comment estimer ces paramètres. Il y a deux modèles qui vont faire des hypothèses sur notre représentation du document qui vont nous permettre d'arriver à une estimation possible de ces paramètres et donc à des modèles génératifs de catégorisation effectifs pour la catégorisation de documents. Un de ces premiers modèles, c'est le modèle multivarié de Bernoulli qui va considérer que les documents sont indépendants et le modèle multinomial. Commençons par le modèle multivarié de Bernoulli. Ce modèle, ce n'est rien d'autre qu'une généralisation du modèle probabiliste MIB que Myriam vous avait présenté lors du cours sur les modèles probabilistes. L'hypothèse de ce modèle multivarié de Bernoulli, c'est l'hypothèse Naïve Bayes qui dit que les termes qui apparaissent dans un document sont indépendants les uns des autres. Chaque document, on va le représenter comme un vecteur binaire défini sur l'espace des termes d'indexation, l'espace des termes de notre vocabulaire, construit sur notre collection, avec WID qui vaut 0 ou 1, selon que le terme est présent ou non dans notre document. Si j'introduis cette représentation vectorielle de D dans mes lois de densité, F de k de D, θ k, va être égal à la probabilité pour D qui est égale à sa représentation sachant Y est égale à k. Comme j'ai fait l'hypothèse que les termes étaient indépendants les uns des autres, ça va être égal au produit pour l'ensemble des termes de la probabilité de WID sachant que Y est égale à k. Si je pose quelques notations, et notamment je vais considérer que θ de TI sachant k, c'est la probabilité que le terme i soit présent dans le document D, donc WID est égal à 1 sachant Y est égal à k, c'est typiquement la probabilité de présence du terme TI du vocabulaire dans la classe K, alors ma loi de densité, je peux pour D, associer donc à D pour la classe K, avec les paramètres θ k, je vais pouvoir l'écrire de cette manière. Donc c'est le produit pour chacun des termes de cette quantité là. Voilà, ça c'est ce qu'on appelle une loi de Bernoulli. Alors pourquoi ça s'appelle une loi de Bernoulli ? Parce que les événements qui modélisent l'absence ou la présence de termes du vocabulaire dans les différentes classes, elles suivent ce qu'on appelle une loi de Bernoulli dont les paramètres sont propres à chaque terme. Voilà, donc ici θ k, ça représente l'ensemble des probabilités de présence des termes du vocabulaire dans la KM classe ou dans la KM composante du mélange. Et puis ce qu'on va chercher à estimer, c'est ce grand θ, donc cet ensemble de paramètres θ de k, c'est-à-dire pour chaque classe K, πk, et puis θ de ti sachant k. Cette estimation, on va pouvoir la faire au sens du maximum de vraisemblance des paramètres sur une base d'apprentissage C de taille M. Et en particulier, pour l'ensemble des termes de notre vocabulaire et pour l'ensemble des classes, θ de ti sachant k, on va pouvoir l'estimer comme étant cette quantité-là, c'est-à-dire le df pour le terme i de la classe K sur nk de C. Et puis πk, on va pouvoir l'estimer comme étant n de K sur C sur M. Alors, à quoi correspondent ces différentes quantités ? n de K de C, c'est égal au cardinal de SK, donc le cardinal de la classe SK, c'est l'ensemble des documents de la base d'apprentissage qui appartiennent à la classe K. M, c'est le nombre total de documents dans notre base d'apprentissage. Et df de T de K, c'est le nombre de documents de la classe K qui contiennent au moins une fois le terme T. Donc ça, c'est l'estimation des paramètres de notre modèle multivarié de Bernoulli au sens du maximum de vraisemblance. En pratique, on ajoute à ces estimations un lissage de la place et un passage au logarithme pour la règle de Bayes. Je vous ai mis sur les deux slides qui suivent les algorithmes qui correspondent à la phase d'apprentissage et à la phase de test, mais je vous laisserai regarder ces algorithmes à tête reposée. Je ne vais pas les détailler dans cette vidéo. Je vais accélérer un peu. L'autre modèle génératif qui est très utilisé en catégorisation pour la RI, c'est le modèle multinomial, dans lequel on va considérer qu'un document D est représenté comme une séquence ordonnée de termes D. L'ordre des termes est pris en compte. La représentation d'un document D, c'est une séquence ordonnée. Et cette séquence ordonnée est générée à partir d'un vocabulaire V donné. On a toujours l'hypothèse Naïve-Bayes qui dit cette fois-ci que la probabilité de génération d'un terme par une composante du mélange, par une classe, est indépendante du contexte et de la position de ce terme dans le document. Comme pour le modèle de Bernoulli, on va inclure cette représentation D sous la forme d'une séquence ordonnée de termes dans notre loi de densité. En utilisant l'hypothèse de Bayes, cette loi de densité associée à la classe K, va être égale au produit pour l'ensemble des termes qui appartiennent à un document de θ de TH, avec le θ de TH, qui est la probabilité de génération du terme TH par la Km composante du mélange, par la Km classe. Ce qu'introduit ce modèle multinomial par rapport au modèle de Bernoulli, au modèle précédent, c'est qu'il va capturer l'information de fréquence des termes dans les documents, et plus seulement l'information de présence-absence. On a vu plusieurs fois, notamment quand on a introduit le modèle vectorial, que prendre en compte cette fréquence des termes, ça avait un intérêt et ça a un impact sur les résultats. Comme pour le modèle précédent, il faut estimer les paramètres. Il y a une erreur d'ailleurs ici, c'est le modèle multinomial, je suis désolée, je viens de m'en rendre compte. On estime ces paramètres au sens du maximum de vraisemblance sur une base d'apprentissage C de taille M, en introduisant un lissage de la place. Au sens du maximum de vraisemblance, on peut estimer les différents paramètres de notre modèle génératif, de cette manière-là, où on voit qu'on a pris en compte la fréquence des termes dans les documents. On a toujours ici un NK2C1 qui est le cardinal de la classe K dans notre ensemble d'apprentissage, et puis ici un TF2TID, c'est le nombre d'occurrences du terme TI dans le document D. S2K, c'est l'ensemble des documents de notre ensemble d'apprentissage qui appartiennent à la classe K. Voilà, donc à nouveau, je vous ai mis le détail des algorithmes pour la phase d'apprentissage et pour la phase de test, mais que je ne détaillerai pas ici. On peut bien sûr aussi utiliser des modèles discriminants, qui eux vont consister à directement trouver une fonction F de classification, sans faire finalement d'hypothèse sur la manière dont sont générés les exemples. Là, on va retomber sur des choses que j'ai introduites tout à l'heure sur l'apprentissage supervisé. Le classifieur recherché est supposé appartenir à une classe de fonctions données F, donc ma classe d'hypothèse, et la forme analytique de cette fonction F, je vais la trouver en minimisant une fonction d'erreur, notre fonction de coût définie tout à l'heure. Très souvent, comme on est dans un problème de classification, ici on utilise le coût 0,1, où je vais compter le nombre de fausses prédictions, je vais pénaliser le nombre de fausses prédictions de ma fonction F. Un modèle discriminant très connu, ce sont les séparateurs à vaste marge linéaire. L'objectif, c'est étant donné nos données d'apprentissage, qui sont étiquetées de manière binaire selon deux classes, moins 1 ou plus 1, on va chercher à construire à partir de cet ensemble d'apprentissage, une fonction F de décision qui va permettre de prédire la classe moins 1 ou plus 1 d'un point quelconque X appartenant à notre ensemble d'entrées grand X. La fonction de décision, je veux que ce soit une fonction de décision linéaire. Voilà, donc ça c'est la forme analytique de cette fonction de décision linéaire. Et puis l'apprentissage, ça va consister à apprendre les paramètres W, J et B de cette fonction F, tel que je vais minimiser mon risque empirique. Je ne vais pas plus rentrer dans les détails de ces SVM, parce que je détaillerai ça un peu plus précisément lors de la prochaine séance. On va maintenant passer au dernier gros morceau du cours d'aujourd'hui, qui concerne l'apprentissage pour la RIE et l'ordonnancement. L'idée, ça va être de modéliser la recherche d'informations comme un problème de catégorisation, pour se ramener à un problème d'apprentissage. L'idée générale, ça va être de choisir une représentation des exemples. Encore faut-il dire quels sont les exemples qu'on va considérer dans ce cadre-là. Il va aussi falloir dire à quoi correspondent les classes de sortie et quels sont leurs nombres. Une fois qu'on a un peu défini ces données d'entrée, il faut choisir le principe d'apprentissage et l'algorithme associé. Ou faire en sorte d'en tester plusieurs et de choisir celui qui est le plus optimal. Revenons à notre problématique de recherche d'informations. J'ai des requêtes, et je vais considérer que j'ai des requêtes pour lesquelles je dispose de jugements de pertinence dans ces. Typiquement, j'ai une requête Q1 et un ensemble de documents avec leurs jugements de pertinence. En bleu, c'est les documents pertinents, en orange, c'est les documents non pertinents pour la requête Q1. Et puis j'ai la même chose pour une requête Q2 et j'ai la même chose pour une requête Q3. Ces requêtes pour lesquelles je dispose de jugements de pertinence, c'est ça qui va nous permettre de définir un ensemble d'apprentissages que je vais utiliser pour ensuite apprendre une fonction F, qui va être utilisée après pour faire de la recherche d'informations. Les principaux verrous de l'apprentissage par ordonnancement, c'est de déterminer quelles sont les données qu'on va utiliser pour mettre en place l'apprentissage. La problématique de la notation des données d'apprentissage, typiquement on voit bien qu'une sortie c'est mes jugements de pertinence, et donc quel jugement de pertinence je vais prendre en compte. Comment je décris mes données ? À partir du moment où j'ai défini mes données, qui sont des couples requêtes documents, comment je les décris, donc quelles sont les caractéristiques que je vais utiliser pour décrire mes données. Et puis bien sûr, après, quel modèle d'apprentissage j'utilise, quelle fonction de coup, quel algorithme, etc. Et puis après, se pose aussi la question de comment j'évalue cette fonction F que j'ai apprise à partir des données. Quelles sont les mesures que je vais pouvoir utiliser pour mon évaluation ? La première question, la question de comment je représente mes données, elle est fondamentale. C'est un problème crucial, qui est l'étape qu'on appelle l'étape de Feature Engineering. On a vu que les données que je dois considérer pour faire de l'ordonnancement, ce ne sont pas les documents seuls, mais ça va être des couples documents requêtes. Et donc à ce couple documents requêtes, je vais pouvoir utiliser les données que je vais utiliser pour faire de l'ordonnancement. Pour ce couple documents requêtes, je vais devoir associer une représentation standard X qui va être définie dans RM, avec un M dimension. Les coordonnées de X, je vais vouloir qu'elles soient très générales. On va essayer de se reposer sur un maximum d'informations, et notamment, pourquoi pas, réutiliser tout ce qu'on a introduit jusqu'à maintenant dans le cours. Par exemple, je peux prendre comme première dimension de mon vecteur X, la somme pour l'ensemble des termes qui appartiennent à la fois au document et à la requête, du log de la fréquence du terme dans le document. Comme deuxième composante, je peux par exemple prendre cette quantité là, qui est pour l'ensemble des termes de la requête, le log de 1 plus la fréquence du terme dans le document sur le nombre de documents dans ma collection. Et puis voilà, je peux comme ça construire une représentation X en prenant du coup un ensemble de mesures statistiques, de statistiques que je peux construire à partir de ma requête et de mon document. Je peux aussi par exemple prendre les scores qui me sont donnés par d'autres modèles, comme par exemple le modèle vectoriel, le modèle booléen, le modèle probabiliste, etc. Là, il n'y a rien qui est interdit il faut juste que j'associe à ce couple QD un vecteur qui le caractérise au mieux dans cette problématique de recherche d'informations. Voilà, donc ça c'est l'étape fondamentale qui est l'étape de Feature Engineering. Et donc à une requête et à un ensemble de documents, donc je vais construire ce vecteur de caractéristiques avec des choses, un ensemble de caractéristiques qui sont dépendantes du couple requête-documents, mais aussi éventuellement des caractéristiques qui sont purement dépendantes du document, par exemple on peut mettre le page rank, voire des caractéristiques qui peuvent être purement dépendantes de la requête, etc. Voilà, l'autre problème c'est finalement les valeurs de sortie, donc le choix du nombre de classes. Ce choix du nombre de classes, il dépend a priori des valeurs de pertinence qu'on a à notre disposition. Est-ce que j'ai des valeurs de pertinence binaires, est-ce que j'ai des valeurs de pertinence multivaluées ou des scores de pertinence ? Donc ça, on voit bien qu'il est assez facile d'avoir des valeurs de pertinence binaires. Si je veux des valeurs de pertinence multivaluées ou des scores de pertinence, ça peut nécessiter un travail d'annotation de longue haleine. Et puis bien sûr, c'est aussi très dépendant du système en question et des préférences des concepteurs. Voilà, dans le cas le plus simple, j'ai deux classes, la classe des documents pertinents et la classe des documents non pertinents, et du coup je peux me ramener très facilement à un problème de catégorisation binaire. Voilà, alors j'ai d'autres possibilités. Si je dispose d'annotations du rang, donc avec des jugements binaires, donc documents pertinents ou non pertinents, je me ramène à un problème de catégorisation binaire. Si j'ai des jugements multivalués, donc avec par exemple ce type de jugement, parfait, excellent, bon, meilleur, etc., des échelles de graduation, je peux me ramener à un problème de catégorisation multiclasse. Je peux aussi vouloir annoter des paires ordonnées, et notamment, je peux avoir des paires de préférence. Donc typiquement, et ça c'est des choses qui sont assez faciles à avoir dans le cadre du web, ces paires de préférence, en utilisant par exemple l'analyse des clics. Donc j'ai plutôt à voir comme donnée de sortie, en fait, le fait qu'un document D va être plus pertinent qu'un autre document pour une requête de données. Voilà, donc ça c'est des choses qu'on peut très facilement obtenir à partir des informations de clics, à partir du comportement utilisateur. Et puis, je peux avoir aussi des listes, avec donc des annotations de listes qui sont meilleures pour une requête qu'une autre liste de documents. Ça c'est des choses qui sont un peu plus difficiles à mettre en œuvre. Voilà, donc le choix du nombre de classes, vos valeurs de sortie, elles sont bien sûr très dépendantes du type d'annotation que vous pouvez associer à vos données, et notamment à ces couples documents requêtes. Voilà, alors après la question du choix du principe d'apprentissage et de l'algorithme, typiquement elle est plus compliquée à partir du moment où on a traité les deux précédentes questions. Donc après la représentation des données, en fait, toutes les techniques de catégorisation peuvent à priori être utilisées. Elles seront plus ou moins efficaces, mais elles peuvent à priori toutes être utilisées. Voilà, donc on utilise beaucoup, ou on a beaucoup utilisé les SVM parce qu'il y a une application assez directe. Typiquement, chaque couple QD contenant un document pertinent pour Q, elle va être associée à la classe plus 1, et les exemples avec les documents non pertinents à la classe moins 1. On va donc apprendre un hyperplan séparateur à partir de cet ensemble d'apprentissage. Voilà, donc je vais chercher les paramètres avec la théorie des SVM. Et puis, la valeur de sortie, elle me donnera directement une mesure pour définir un ordre sur les documents. Voilà, et donc le score d'un nouveau document pour une nouvelle requête, il va être directement fondé sur les valeurs des fonctions de catégorisation associées. Voilà, alors après, il y a trois grandes familles d'approches d'apprentissage pour l'ordonnancement. La première famille d'approches, c'est l'approche qu'on appelle l'approche par points. En fait, les documents vont être traités de manière indépendante dans cette approche. On ne va pas prendre en compte des pertes de pertinence, comme je l'ai expliqué tout à l'heure. On va avoir donc des approches par paire, où là on va prendre en compte des pertes de pertinence, c'est l'approche perouaise, et on peut aussi avoir des approches par liste. Je vais me contenter pour la fin de ce cours de parler de l'approche par points et je reviendrai sur les approches par paire et par liste lors du prochain cours. Le principe de l'approche par points, c'est ce qu'on vient de voir, c'est-à-dire qu'on va formaliser le problème d'ordonnancement comme un problème de catégorisation ou de régression. Les documents, je les considère de manière indépendante en entrée du système d'apprentissage. Et puis, mon jugement de pertinence, ça peut être soit un score réel, auquel cas je vais me rapporter un problème de régression linéaire, soit une classe de pertinence ordonnée, auquel cas je peux me rapporter un problème de régression ordinal, soit j'ai une classe de pertinence non ordonnée, et là je peux utiliser des techniques de classification. L'approche par points, on appelle ça une approche par points parce que mes documents sont considérés de manière indépendante en entrée du système d'apprentissage. Si j'ai un score de pertinence réel, je me ramène à un problème de régression linéaire et je vais résoudre ce problème de régression en minimisant pour chaque document une fonction de perte, qui est par exemple la somme des différences au carré. Avec Y qui est le score de pertinence de référence pour un document DI et Y qui est le score de pertinence prédit. La fonction de perte, c'est la différence au carré, et puis du coup, mon risque empirique, ça va être la somme des différences au carré. Si j'ai des classes de pertinence ordonnée, et puis si j'ai des classes de pertinence ordonnée, je vais avoir un problème de régression ordinale, qui va prendre en compte l'ordre relatif entre les classes, et du coup il va s'agir de déterminer F qui est une fonction d'ordonnancement qui va retourner un score réel de pertinence et N moins un seuil qui détermine la régression ordinaire. Et puis, si j'ai des classes de pertinence ordonnée, qui va retourner un score réel de pertinence et N moins un seuil qui déterminent finalement les limites des N catégories de pertinence. Voilà, concernant ce premier cours sur l'apprentissage pour l'ARI. En conclusion, ce que je vous ai présenté aujourd'hui, il y a une grosse partie qui était quand même une partie de rappel sur l'apprentissage, mais sinon je vous ai présenté un nouveau paradigme pour l'ARI. J'ai détaillé à la fin de ce cours l'approche par points, où le problème d'ordonnancement, on le transforme en un problème de catégorisation ou de régression. Ces approches d'apprentissage, il faut retenir que ce sont des approches qui vont tenter d'exploiter toutes les informations à disposition. On a des résultats qui vont être comparables à ceux des modèles probabilistes quand on a des collections qui sont classiques. Quand on a des grosses collections, et notamment par exemple dans le cas du web, pour lequel on peut disposer d'un espace d'attributs qui est très riche, on va avoir des meilleurs résultats. Après, il peut se poser des problèmes de malédiction de la dimension, et typiquement si notre description de notre couple requête document est très grand, on peut avoir après des problèmes de malédiction de la dimension. On peut se poser des questions de réduction de cette dimension pour éviter ces problèmes. Il y a un problème qui est non négligeable, qui est la disponibilité des annotations. Comment je peux obtenir des jugements de pertinence, pour constituer un jeu de données d'apprentissage, pour après mettre en oeuvre toutes ces techniques d'apprentissage ? Voilà quelques petites lectures conseillées pour compléter cette première partie du cours. Je vous souhaite de bien mettre tout cela en application lors du Lab d'aujourd'hui."
}