{
    "original_file_name": "RI2.mp4",
    "language": "fr",
    "sentences": [
        {
            "start": 0,
            "end": 7,
            "text": "Bonjour, on attaque aujourd'hui la deuxième partie du cours d'apprentissage pour la recherche d'information."
        },
        {
            "start": 7,
            "end": 14,
            "text": "Je vais rapidement commencer par un rêve récapitulatif des notions introduites la dernière fois."
        },
        {
            "start": 14,
            "end": 49,
            "text": "La dernière fois, j'ai présenté un nouveau paradigme pour la recherche d'information qui est un paradigme basé sur de l'apprentissage qui s'appelle « Learning to Rank » où on a un jeu de données d'apprentissage qui est composé principalement de paires requêtes, documents, décrits caractérisés avec un vecteur caractéristique qu'il faut construire et puis des données de sortie, des labels qui sont des valeurs de pertinence."
        },
        {
            "start": 49,
            "end": 70,
            "text": "A partir de ces données d'apprentissage, on apprend une fonction qui va être une fonction d'ordonnancement ou un critère et puis cette fonction d'ordonnancement apprise, on l'utilise ensuite sur des données de test ou des données de production qui consistent uniquement en des données non labellisées."
        },
        {
            "start": 70,
            "end": 73,
            "text": "Bien sûr, on n'a pas la vérité de terrain pour ces données."
        },
        {
            "start": 73,
            "end": 83,
            "text": "Et puis sur ces données de test, on utilise la fonction F apprise pour prédire la pertinence et classer les résultats."
        },
        {
            "start": 83,
            "end": 86,
            "text": "En sortie, on obtient bien toujours une liste ordonnée de documents."
        },
        {
            "start": 86,
            "end": 100,
            "text": "Ce principe d'apprentissage pour l'AERI repose sur deux concepts principaux qui sont la notation des données et la représentation des couples requêtes-documents dans l'espace des caractéristiques."
        },
        {
            "start": 100,
            "end": 105,
            "text": "C'est vraiment une étape très importante qu'on appelle l'étape de description."
        },
        {
            "start": 105,
            "end": 112,
            "text": "Et puis la partie apprentissage en tant que telle avec une structure d'apprentissage classique en deux étapes."
        },
        {
            "start": 112,
            "end": 118,
            "text": "Une étape d'apprentissage de la fonction d'ordonnancement F, puis l'étape de test de production sur de nouvelles requêtes."
        },
        {
            "start": 118,
            "end": 131,
            "text": "On peut bien sûr aussi rajouter à ça une étape de validation qui, par exemple, pourrait consister à choisir les hyperparamètres du modèle."
        },
        {
            "start": 131,
            "end": 141,
            "text": "La dernière fois, il avait été aussi introduit le fait qu'il existait trois grandes familles d'approches dans ce paradigm learning to rank."
        },
        {
            "start": 141,
            "end": 148,
            "text": "L'approche par points, dont on a parlé la dernière fois, où les documents sont considérés de manière indépendante."
        },
        {
            "start": 148,
            "end": 153,
            "text": "L'approche par paire, dont on va parler aujourd'hui."
        },
        {
            "start": 153,
            "end": 158,
            "text": "Et l'approche par liste, qui va être aussi rapidement évoquée aujourd'hui."
        },
        {
            "start": 158,
            "end": 169,
            "text": "L'approche par points, c'est une approche qui consiste à transformer le problème de classement en un problème soit de classification, soit de régression, soit de régression ordinale."
        },
        {
            "start": 169,
            "end": 175,
            "text": "Selon le type des valeurs de pertinence qu'on a à disposition."
        },
        {
            "start": 175,
            "end": 183,
            "text": "Typiquement, si on a des valeurs de pertinence qui sont des nombres réels, on va se ramener à un problème de régression."
        },
        {
            "start": 183,
            "end": 187,
            "text": "Si on a des valeurs de pertinence qui sont des catégories, on va se ramener à un problème de classification."
        },
        {
            "start": 187,
            "end": 192,
            "text": "Et enfin, si on a des catégories ordonnées, on va se ramener à un problème de régression ordinaire."
        },
        {
            "start": 192,
            "end": 199,
            "text": "Donc voilà, on a notre vecteur caractéristique."
        },
        {
            "start": 199,
            "end": 203,
            "text": "Trois types de problèmes selon le type de valeur de sortie."
        },
        {
            "start": 203,
            "end": 210,
            "text": "On en déduit la fonction f2x, on apprend la fonction f2x, qui va être une fonction de classement."
        },
        {
            "start": 210,
            "end": 212,
            "text": "Ça c'est la phase d'apprentissage."
        },
        {
            "start": 212,
            "end": 220,
            "text": "Et pour la phase de classement en tant que telle, on a nos données qui sont décrites selon le même schéma de description."
        },
        {
            "start": 220,
            "end": 253,
            "text": "Et puis on va ordonner les vecteurs, les données, selon le score de cette fonction f. On va aujourd'hui introduire l'approche par paire, qui est une approche très développée, très utilisée dans le paradigme learning to rank, notamment parce qu'on va pouvoir facilement créer des jeux de données d'apprentissage, notamment pour les collections de type web."
        },
        {
            "start": 253,
            "end": 261,
            "text": "L'idée principale de l'approche par paire, c'est de travailler sur des paires de préférences."
        },
        {
            "start": 261,
            "end": 268,
            "text": "Cette idée, elle se base sur le fait que la notion de pertinence n'est pas une notion absolue."
        },
        {
            "start": 268,
            "end": 282,
            "text": "Plusieurs fois, tout au long du cours, on a évoqué cette difficulté à caractériser correctement, à définir correctement cette notion de pertinence, avec notamment d'ailleurs des définitions qui sont très dépendantes des modèles de recherche."
        },
        {
            "start": 282,
            "end": 291,
            "text": "Binaires pour le modèle booléen, probabilistes pour le modèle probabiliste, etc."
        },
        {
            "start": 291,
            "end": 313,
            "text": "Quand on a parlé de la partie évaluation des modèles de recherche, on a aussi évoqué le fait qu'il était difficile de juger de la pertinence d'un document, mais par contre qu'il était plus facile de juger de la pertinence relative de deux documents."
        },
        {
            "start": 313,
            "end": 336,
            "text": "Étant donné le résultat d'une recherche, la réponse d'un moteur de recherche à un besoin d'information, pour moi utilisateur, il va être plus facile de dire si le document N qui m'a été retourné est plus pertinent que le document N plus 1, que de juger de la pertinence de chacun des documents."
        },
        {
            "start": 336,
            "end": 342,
            "text": "C'est vraiment cette idée-là qui va être mise en œuvre dans l'approche par paire."
        },
        {
            "start": 342,
            "end": 349,
            "text": "On va travailler avec ce qu'on va appeler des jugements par préférence, et donc avec la notion de paire de préférence."
        },
        {
            "start": 349,
            "end": 358,
            "text": "Typiquement, ces paires de préférence vont exprimer le fait qu'un document va être préféré à un autre pour une requête donnée, pour un besoin d'information donnée."
        },
        {
            "start": 358,
            "end": 369,
            "text": "Ces jugements de préférence vont toujours être conditionnés par un contexte qui est la requête qu'on a soumise au moteur de recherche."
        },
        {
            "start": 369,
            "end": 382,
            "text": "Le principe, c'est de partir sur cette idée que les jugements par paire sont des jugements qui sont plus généraux, et donc d'exprimer ce jugement comme une préférence d'un document par rapport à un autre."
        },
        {
            "start": 382,
            "end": 393,
            "text": "Étant donné une requête Q, à chaque paire de documents DI, DJ, on va associer une valeur de préférence YIJ qui va être à valeur dans le moins 1."
        },
        {
            "start": 393,
            "end": 419,
            "text": "Et typiquement, on va dire que YIJ va être égal à 1 si XI est préféré à XJ pour la requête Q. Cette relation de préférence, on va la noter de cette manière-là, et donc typiquement, il faut lire cette équation comme XI est préféré à XJ pour la requête Q, toujours étant donné un contexte donné qui est ici notre requête Q. Voilà."
        },
        {
            "start": 419,
            "end": 428,
            "text": "Et donc, dans l'approche par paire, on va chercher à déterminer non plus le score de pertinence, mais quel document est plus pertinent qu'un autre."
        },
        {
            "start": 428,
            "end": 433,
            "text": "On va essayer de déterminer la préférence d'un document par rapport à un autre."
        },
        {
            "start": 433,
            "end": 439,
            "text": "Regardons de manière un peu plus détaillée comment on va pouvoir mettre ce principe en œuvre."
        },
        {
            "start": 439,
            "end": 457,
            "text": "L'élément fondamental, ça reste toujours ce couple, ou cette paire document-requête qu'on appelle XI, et donc on considère qu'on a N couples, N échantillons de paire document-requête."
        },
        {
            "start": 457,
            "end": 460,
            "text": "Ça, c'est notre ensemble d'apprentissage."
        },
        {
            "start": 460,
            "end": 481,
            "text": "Et ce qu'on souhaite trouver, c'est une fonction d'ordonnancement, c'est-à-dire qu'on souhaite trouver une fonction f qui va respecter l'ordre des X. Donc si XJ est préféré à XI, alors f de XJ doit être supérieur à f de XI."
        },
        {
            "start": 481,
            "end": 490,
            "text": "Donc, pour simplifier le développement, je vais considérer ici f qui est une fonction de classement linéaire, et donc que je vais pouvoir écrire comme ça."
        },
        {
            "start": 490,
            "end": 492,
            "text": "Ça, c'est le produit Scalar."
        },
        {
            "start": 492,
            "end": 502,
            "text": "En pratique, f, ça peut être tout type de fonction, mais vraiment pour plus facilement vous expliquer ce développement-là, on va considérer que f, c'est une fonction de classement linéaire."
        },
        {
            "start": 502,
            "end": 512,
            "text": "Pour f linéaire, j'ai donc, si f de XI est supérieur à f de XJ, alors j'ai bien cette relation d'équivalence."
        },
        {
            "start": 512,
            "end": 521,
            "text": "Donc ma fonction de classement linéaire, elle est positive dans ce cas-là pour la différence XI moins XJ."
        },
        {
            "start": 521,
            "end": 526,
            "text": "Donc pour f linéaire, j'ai bien cette relation d'équivalence."
        },
        {
            "start": 526,
            "end": 534,
            "text": "Je peux donc transformer mon problème de classement en un problème de classification binaire sur la différence des XI moins XJ."
        },
        {
            "start": 534,
            "end": 540,
            "text": "Et c'est comme ça, en fait, que va fonctionner l'approche par paire."
        },
        {
            "start": 540,
            "end": 543,
            "text": "Et ça, c'est ce qu'on appelle la transformation par paire."
        },
        {
            "start": 543,
            "end": 557,
            "text": "C'est-à-dire qu'on va former, à partir de nos données, des exemples d'apprentissage sous la forme de paires étiquetées en utilisant la différence entre deux couples, donc XI moins XJ."
        },
        {
            "start": 557,
            "end": 581,
            "text": "Et les étiquettes que je vais donner, typiquement, elles vont être binaires et je vais donner à une différence XI moins XJ la valeur de 1 si XI est préféré à XJ pour la requête Q."
        },
        {
            "start": 581,
            "end": 584,
            "text": "Et puis sinon, je lui donne la valeur moins 1."
        },
        {
            "start": 584,
            "end": 595,
            "text": "Voilà, donc j'ai bien ces relations d'équivalence, c'est-à-dire que si XI est préféré à XJ, alors YIJ est égal à plus 1."
        },
        {
            "start": 595,
            "end": 601,
            "text": "Et donc, j'ai bien ramené comme ça mon problème de classement en un problème de classification binaire."
        },
        {
            "start": 601,
            "end": 609,
            "text": "Donc, on va rapidement illustrer le principe de cette transformation par paire sur un petit exemple."
        },
        {
            "start": 609,
            "end": 614,
            "text": "Donc, on considère ici qu'on a deux requêtes."
        },
        {
            "start": 614,
            "end": 621,
            "text": "Donc ça, c'est les données qui correspondent à la requête 1 et ça, c'est les données qui correspondent à la requête 2."
        },
        {
            "start": 621,
            "end": 630,
            "text": "On a donc des données qui sont classées et qui sont classées selon une fonction de classement qu'on voit être linéaire."
        },
        {
            "start": 630,
            "end": 645,
            "text": "Voilà, typiquement, si on projette les données sur cette droite linéaire, sur cet hyperplan linéaire, on voit qu'on peut effectivement l'utiliser comme une fonction de classement."
        },
        {
            "start": 645,
            "end": 662,
            "text": "A partir de ces données, je vais donc appliquer ma transformée par paire en prenant donc l'ensemble des données associées à un contexte donné, donc à une requête donnée, et qui ont des rangs différents et en effectuant les différences par paire."
        },
        {
            "start": 662,
            "end": 678,
            "text": "Et donc là, typiquement, si je prends la paire X1, X2, alors je vais labelliser X1, X2 en plus 1 parce que X1 est préféré à X2 pour cette requête avec cette fonction de classement."
        },
        {
            "start": 678,
            "end": 690,
            "text": "Et de même, X2 va être préféré à X3 pour cette requête avec cette fonction de classement et donc je vais étiqueter X2 moins X3 à plus 1."
        },
        {
            "start": 690,
            "end": 703,
            "text": "Si maintenant je prends la paire X3, X1, je lui donnerai le label moins 1 parce que X3 n'est pas préféré à X1 pour cette requête avec cette fonction de classement."
        },
        {
            "start": 703,
            "end": 722,
            "text": "Et donc en appliquant cette fonction de transformation par paire à l'ensemble des données qui appartiennent à des rangs différents et à un même contexte, alors je transforme effectivement mon problème en un problème de classification binaire."
        },
        {
            "start": 722,
            "end": 731,
            "text": "Donc on voit ici, pour les mêmes données, le résultat de l'application de cette transformation."
        },
        {
            "start": 731,
            "end": 751,
            "text": "Donc on a bien ici nos instances positives et on a bien ici nos instances négatives et on voit sur cet exemple qu'on doit très certainement pouvoir trouver une solution à ce problème de classification en utilisant une technique de classification et notamment par exemple en utilisant des séparateurs linéaires."
        },
        {
            "start": 751,
            "end": 769,
            "text": "Voilà, donc juste des petites remarques, dans la constitution du jeu de données, on ne considère que les données d'un même groupe qui sont prises en compte pour les paires de différence et bien sûr, seules les données de rang différent dans ce même groupe sont prises en compte."
        },
        {
            "start": 769,
            "end": 779,
            "text": "Je ne fais pas, je ne construis pas de paire de différence en prenant des données qui sont de groupe différent, ça n'aurait pas de sens, c'est des données qui sont non comparables."
        },
        {
            "start": 779,
            "end": 798,
            "text": "Voilà, donc je vais juste terminer pour cette présentation de l'approche par paire en présentant une approche qui s'appelle Ranking SVM et qui se base sur les séparateurs à vaste marge pour proposer une solution à ce problème d'ordonnancement à l'aide de cette transformée par paire."
        },
        {
            "start": 798,
            "end": 806,
            "text": "Rapidement avant cela, je vais vous présenter ce que sont les séparateurs à vaste marge linéaires."
        },
        {
            "start": 806,
            "end": 818,
            "text": "J'avais rapidement commencé à présenter les SVM dans le cours précédent, notamment en présentant ces méthodes comme des méthodes de classification dites discriminantes."
        },
        {
            "start": 818,
            "end": 832,
            "text": "Donc on a des données d'apprentissage labellisées, donc X, Y et on va se placer dans un cadre de classification binaire, donc avec des labels qui peuvent prendre les valeurs moins 1 et plus 1."
        },
        {
            "start": 832,
            "end": 866,
            "text": "Et je cherche à construire à partir de cet ensemble d'apprentissage, donc une fonction de décision qui va donc de l'espace de représentation de mes données à moins 1 plus 1 et qui va permettre de prédire la classe moins 1 ou plus 1 d'un point X qui appartient à X, n'importe quel point X qui appartient à X. Voilà, ma fonction de décision, elle va de Rd dans R, Rd étant l'espace de description de mes données d'entrée."
        },
        {
            "start": 866,
            "end": 874,
            "text": "Et puis je peux utiliser le signe de cette fonction pour classer mes données."
        },
        {
            "start": 874,
            "end": 891,
            "text": "Donc typiquement, je vais affecter X à la classe moins 1 si f2x est inférieur à 0 et à la classe plus 1 si le signe de ma fonction de décision est supérieur à 0, appliqué à X bien sûr."
        },
        {
            "start": 891,
            "end": 910,
            "text": "Si on fait un bref rappel à la manière dont je vous ai présenté la théorie de l'apprentissage supervisé, j'avais évoqué le fait qu'on avait une classe d'hypothèses pour notre fonction f. Ici, cette classe d'hypothèses, c'est qu'on a des fonctions de décision qui sont linéaires et donc qui vont prendre cette forme analytique."
        },
        {
            "start": 910,
            "end": 929,
            "text": "Et ce que je vais chercher à déterminer, ce sont les paramètres de cette fonction, c'est-à-dire le vecteur W et B. Voilà, prenons un exemple simple, plaçons-nous dans R2 et prenons donc un problème de classification linéaire."
        },
        {
            "start": 929,
            "end": 951,
            "text": "Donc on a effectivement deux classes qui sont caractérisées ici par les croix rouges et les ronds bleus et je cherche effectivement une fonction de séparation dans cet espace R2 qui soit linéaire."
        },
        {
            "start": 951,
            "end": 994,
            "text": "On voit ici que les données, que le plan, je peux le séparer en deux par un hyperplan dont l'équation est WTX plus B. Si je prends le signe de cet hyperplan, ça me permet d'avoir une fonction qui va me permettre de classer mes différents points selon le signe que prend cette fonction quand je l'applique à mes données X. Ce qu'il est intéressant de voir, c'est que la distance d'un point à cet hyperplan, on peut l'exprimer avec cette équation."
        },
        {
            "start": 994,
            "end": 999,
            "text": "Notamment, on verra l'importance de cette notion-là un peu plus tard."
        },
        {
            "start": 999,
            "end": 1022,
            "text": "Et puis la distance de l'hyperplan à l'origine, c'est la valeur absolue de B sur la norme de W. Si je reprends mon problème de séparation binaire dans un espace à deux dimensions, on voit qu'en fait j'ai plusieurs hyperplans qui sont possibles, plusieurs séparateurs qui peuvent être possibles."
        },
        {
            "start": 1022,
            "end": 1029,
            "text": "C'est-à-dire que cette droite-là va effectivement me permettre de séparer correctement mes données, celle-ci aussi et celle-ci aussi."
        },
        {
            "start": 1029,
            "end": 1035,
            "text": "Donc la question qu'il faut se poser ici, c'est quel est le séparateur qui va être optimal ?"
        },
        {
            "start": 1035,
            "end": 1046,
            "text": "Le séparateur optimal, l'hyperplan optimal, ça va être celui qui va classifier correctement les données et qui se trouve le plus loin possible de tous les exemples."
        },
        {
            "start": 1046,
            "end": 1048,
            "text": "Et ça, c'est à des fins de généralisation."
        },
        {
            "start": 1048,
            "end": 1054,
            "text": "Cet hyperplan optimal, c'est l'hyperplan de marge maximale."
        },
        {
            "start": 1054,
            "end": 1061,
            "text": "La marge étant la distance minimale entre un exemple et l'hyperplan, et donc la surface de séparation."
        },
        {
            "start": 1061,
            "end": 1065,
            "text": "C'est donc cet hyperplan optimal que je vais chercher à déterminer."
        },
        {
            "start": 1065,
            "end": 1070,
            "text": "Voilà, juste quelques définitions."
        },
        {
            "start": 1070,
            "end": 1077,
            "text": "On parle de séparateur linéaire, donc il est nécessaire de définir ce que sont les données qui sont séparables linéairement."
        },
        {
            "start": 1077,
            "end": 1089,
            "text": "Et typiquement, on va dire que les couples XYI vont être linéairement séparables s'il existe un hyperplan qui permet de discriminer correctement cet ensemble de données."
        },
        {
            "start": 1089,
            "end": 1093,
            "text": "Dans le cas contraire, on va parler d'exemples qui ne sont pas séparables."
        },
        {
            "start": 1093,
            "end": 1109,
            "text": "Pour limiter l'espace des possibilités, on va considérer que les points les plus proches de l'hyperplan séparateur sont situés sur des hyperplans qu'on va appeler canoniques et qui sont définis par cette équation."
        },
        {
            "start": 1109,
            "end": 1117,
            "text": "L'équation WTX plus B est égale à 1 et WTX plus B est égale à moins 1."
        },
        {
            "start": 1117,
            "end": 1140,
            "text": "Dans ce cas, la marge, on peut la définir comme étant 2 sur la norme de W. Et d'autre part, les points vont être bien classés si, quels que soient I, donc pour tous les points de mon ensemble d'apprentissage, j'ai Y fois F de XI qui est supérieur à 1."
        },
        {
            "start": 1140,
            "end": 1159,
            "text": "Ça, c'est des contraintes, des conditions qui m'expriment que chaque point est bien classé par ma fonction F. Et en utilisant cette simplification, je peux cette fois-ci définir de manière beaucoup plus formelle ce que c'est que mon séparateur à vaste marge."
        },
        {
            "start": 1159,
            "end": 1183,
            "text": "Donc, étant donné un ensemble de points linéairement séparables et tiquetés, donc mon ensemble d'apprentissage qui contient N échantillons, l'objectif va être de trouver un hyperplan qui maximise la marge et qui discrimine correctement les points de D. Donc, la formulation mathématique du SVM, c'est celle-ci."
        },
        {
            "start": 1183,
            "end": 1191,
            "text": "Je cherche à minimiser selon WB 1 demi de la norme de W²."
        },
        {
            "start": 1191,
            "end": 1203,
            "text": "Donc ça, c'est typiquement ce qui exprime le fait que je cherche à maximiser ma marge sous contrainte que l'ensemble de mes points de mon ensemble d'apprentissage soit bien classé."
        },
        {
            "start": 1203,
            "end": 1206,
            "text": "C'est ce qu'on exprime avec cette équation-là."
        },
        {
            "start": 1206,
            "end": 1212,
            "text": "Ça, c'est la formulation classique des séparateurs à vaste marge."
        },
        {
            "start": 1212,
            "end": 1224,
            "text": "Voilà, on a donc ici un problème de minimisation sous contrainte qu'on peut résoudre par des approches numériques comme de la programmation quadratique, par exemple en minimisant le carré de la norme."
        },
        {
            "start": 1224,
            "end": 1231,
            "text": "Je ne vais pas rentrer dans les détails de résolution de ce type de problème d'optimisation."
        },
        {
            "start": 1231,
            "end": 1243,
            "text": "Ce que je peux vous dire, c'est qu'en fait pour les SVM, on va faire un passage au lacrangé, c'est-à-dire qu'on va utiliser la forme duale de ce problème d'optimisation précédent."
        },
        {
            "start": 1243,
            "end": 1254,
            "text": "On sait qu'un problème d'optimisation, il possède une forme duale si la fonction objectif et les contraintes sont strictement convexes et alors dans ce cas là la solution du problème dual est la solution du problème original."
        },
        {
            "start": 1254,
            "end": 1259,
            "text": "Donc on utilise cette propriété là pour la résolution des séparateurs à vaste marge."
        },
        {
            "start": 1259,
            "end": 1276,
            "text": "Et notamment on va donc passer au lagrangien, en introduisant dans le problème d'optimisation des multiplicateurs de Lagrange αi qui sont donc associés aux différentes contraintes d'inégalité qui expriment que l'ensemble des points de mon ensemble d'apprentissage doivent être bien classés."
        },
        {
            "start": 1276,
            "end": 1283,
            "text": "Donc du coup j'introduis dans mon problème, dans la formulation de mon problème, n paramètres αi."
        },
        {
            "start": 1283,
            "end": 1288,
            "text": "Et donc la formulation de mon problème en passant au lagrangien ça devient celle-ci."
        },
        {
            "start": 1288,
            "end": 1310,
            "text": "Donc j'ai cette fonction objectif qui devient celle-ci avec donc les paramètres, le paramètre W, B, α et donc cette fonction objectif ici qui est donc je cherche à maximiser ma marge avec donc les contraintes que l'ensemble des données de mon ensemble d'apprentissage doivent être bien classées."
        },
        {
            "start": 1310,
            "end": 1312,
            "text": "J'exprime exactement la même chose."
        },
        {
            "start": 1312,
            "end": 1321,
            "text": "Donc j'ai une nouvelle formulation du problème en fait où la contrainte elle est directement intégrée dans la fonction objectif et donc ça devient intéressant."
        },
        {
            "start": 1321,
            "end": 1331,
            "text": "Voilà, pour la résolution des SVM il est important d'introduire des vecteurs particuliers qui sont ce qu'on appelle des vecteurs supports."
        },
        {
            "start": 1331,
            "end": 1339,
            "text": "Donc W1 je peux le définir comme étant la somme sur l'ensemble de mes données d'apprentissage de αi, yi, xi."
        },
        {
            "start": 1339,
            "end": 1348,
            "text": "Je sais que αi est nulle si yi fois Wtxi plus B est supérieur à 1."
        },
        {
            "start": 1348,
            "end": 1356,
            "text": "Donc W il n'est défini que par les points tels que j'ai cette équation là qui est égale à 1."
        },
        {
            "start": 1356,
            "end": 1360,
            "text": "Et ces points là c'est mes vecteurs supports, ce sont ces points là."
        },
        {
            "start": 1360,
            "end": 1369,
            "text": "Ces points qui finalement appartiennent au plan canonique qu'on a introduit plus en avant."
        },
        {
            "start": 1369,
            "end": 1384,
            "text": "Voilà, donc en pratique les SVM on calcule W, on cherche finalement les valeurs, on estime W en utilisant les données d'apprentissage pour résoudre le dual, donc le Lagrangien."
        },
        {
            "start": 1384,
            "end": 1387,
            "text": "Et en faisant ça on obtient les paramètres αi."
        },
        {
            "start": 1387,
            "end": 1393,
            "text": "A partir des αi j'en déduis donc l'estimation de mon vecteur W avec cette équation là."
        },
        {
            "start": 1393,
            "end": 1398,
            "text": "La somme pour l'ensemble de mes données d'apprentissage de αi, xi, yi, xi."
        },
        {
            "start": 1398,
            "end": 1408,
            "text": "Puis je peux du coup calculer B en prenant en compte le fait que les αi qui sont supérieurs à 0 correspondent aux points supports qui vérifient donc cette relation."
        },
        {
            "start": 1408,
            "end": 1411,
            "text": "Et donc je peux en déduire comme ça la valeur de B."
        },
        {
            "start": 1411,
            "end": 1420,
            "text": "En pratique je fais la moyenne de ces termes pour l'ensemble des vecteurs supports SV pour obtenir une valeur numérique qui est stable."
        },
        {
            "start": 1420,
            "end": 1451,
            "text": "Et donc j'obtiens ma fonction de décision que je peux exprimer comme ça, qui est donc la somme pour l'ensemble des vecteurs supports de αi, xi, xi, t, x. J'ai ici un produit scalaire en fait, je pourrais aussi l'exprimer avec l'autre notation des produits scalaires, plus B. Donc tout ce qu'on a vu c'est assez joli, mais ça ne marche que si on a des données qui sont séparables linéairement."
        },
        {
            "start": 1451,
            "end": 1456,
            "text": "Or dans la vraie vie les données elles sont rarement séparables linéairement."
        },
        {
            "start": 1456,
            "end": 1463,
            "text": "Il n'y a pas de raison qui fait que les données sont séparables linéairement pour énormément de problèmes."
        },
        {
            "start": 1463,
            "end": 1472,
            "text": "Et donc on va voir comment on peut étendre les séparateurs à basse de marge au cas non séparable."
        },
        {
            "start": 1472,
            "end": 1483,
            "text": "Donc typiquement comment on va pouvoir modifier la formulation quand justement l'hypothèse de séparabilité linéaire des points n'est pas vérifiée ?"
        },
        {
            "start": 1483,
            "end": 1497,
            "text": "Voilà, typiquement dans ce genre de cas là, les points blancs qui sont ici et les carrés verts qui sont ici font qu'on n'a pas des données qui sont séparables linéairement."
        },
        {
            "start": 1497,
            "end": 1506,
            "text": "Dans ce cas là, on va relâcher les contraintes qui expriment le fait que les points sont bien classés."
        },
        {
            "start": 1506,
            "end": 1515,
            "text": "Donc ces contraintes là, et on va rajouter dans ces contraintes des variables de relâchement εi."
        },
        {
            "start": 1515,
            "end": 1520,
            "text": "Et puis bien sûr on va pénaliser ces relâchements dans la fonction objectif."
        },
        {
            "start": 1520,
            "end": 1526,
            "text": "Et donc on obtient une nouvelle formulation des SVM dans le cas non séparable qui est celle-ci."
        },
        {
            "start": 1526,
            "end": 1542,
            "text": "Donc on cherche toujours à maximiser notre marge, à trouver les valeurs des paramètres W et B qui maximisent notre marge, sous contrainte relâchée que les points sont bien classés."
        },
        {
            "start": 1542,
            "end": 1550,
            "text": "Donc là on introduit nos variables de relâchement qu'on pénalise dans la fonction objectif, ici."
        },
        {
            "start": 1550,
            "end": 1565,
            "text": "Et donc ce C là, c'est une contrainte de régularisation justement liée à cette pénalisation des variables de relâchement, qui est un hyperparamètre des SVM."
        },
        {
            "start": 1565,
            "end": 1574,
            "text": "Et puis on a encore un cas qui est un peu plus compliqué, qui est le cas où la séparation n'est pas linéaire."
        },
        {
            "start": 1574,
            "end": 1589,
            "text": "Et donc on voit bien qu'ici la droite qui sépare, la fonction qui sépare nos points, qui sont séparables, mais cette fonction là n'est clairement pas linéaire."
        },
        {
            "start": 1589,
            "end": 1592,
            "text": "Comment on peut traiter ce cas ?"
        },
        {
            "start": 1592,
            "end": 1597,
            "text": "Donc on va prendre un exemple aussi joué, un exemple synthétique qui est celui-là."
        },
        {
            "start": 1597,
            "end": 1604,
            "text": "On voit qu'effectivement on a des données qui sont dans un espace en deux dimensions, qui ne sont pas séparables linéairement."
        },
        {
            "start": 1604,
            "end": 1613,
            "text": "Et pour traiter ce problème-là, avec les SVM, on va utiliser une astuce qu'on appelle l'astuce des noyaux."
        },
        {
            "start": 1613,
            "end": 1622,
            "text": "Typiquement, on va étendre notre problème à un cas où les données vont être séparables linéairement."
        },
        {
            "start": 1622,
            "end": 1626,
            "text": "Ça c'est une extension justement des SVM à des séparateurs non linéaires."
        },
        {
            "start": 1626,
            "end": 1635,
            "text": "Et pour ça, on va transposer les données dans un autre espace, dans lequel les données vont être cette fois-ci linéairement séparables."
        },
        {
            "start": 1635,
            "end": 1642,
            "text": "Donc on va appliquer à nos données une transformation qui va de Rd dans H, un espace de Hilbert."
        },
        {
            "start": 1642,
            "end": 1655,
            "text": "Cette transformation, c'est le phi ici, qui est telle qu'on part d'un espace de départ dans lequel les données ne sont pas séparables linéairement, vers un espace d'arrivée où elles le sont."
        },
        {
            "start": 1655,
            "end": 1666,
            "text": "Voilà, si on revient à notre exemple, on a bien un espace initial à deux dimensions dans lequel il n'est pas possible de séparer linéairement nos données."
        },
        {
            "start": 1666,
            "end": 1686,
            "text": "Et donc je dois choisir une transformation phi qui doit permettre une séparation linéaire dans un nouvel espace H. Ici, je peux par exemple prendre cette transformation phi, qui dépend donc de X1 et X2, et qui transforme mes données dans un espace à trois dimensions, avec X1, X2 et X1² plus X2²."
        },
        {
            "start": 1686,
            "end": 1703,
            "text": "Si je trace mes données dans ce nouvel espace, qui est un espace à trois dimensions, qui est un espace de plus grande dimension que l'espace original, on voit qu'ici j'ai effectivement une possibilité de séparer mes données par un séparateur linéaire."
        },
        {
            "start": 1703,
            "end": 1705,
            "text": "On voit qu'on a effectivement un hyper-séparateur."
        },
        {
            "start": 1705,
            "end": 1715,
            "text": "C'est vraiment cette idée-là qu'on veut mettre en place pour utiliser les séparateurs à vaste marge quand on a des cas de séparation non linéaire."
        },
        {
            "start": 1715,
            "end": 1724,
            "text": "Ce qui est compliqué, c'est finalement le choix de cette transformation, le changement de représentation, comment je peux faire."
        },
        {
            "start": 1724,
            "end": 1732,
            "text": "On souhaite avoir un changement de représentation qui va permettre une séparation linéaire entre nos deux classes, tout en respectant bien sûr la vraie similarité entre les données."
        },
        {
            "start": 1732,
            "end": 1740,
            "text": "En général, ça veut dire que je dois trouver ce qu'on appelle un espace de redescription de plus grande dimension."
        },
        {
            "start": 1740,
            "end": 1743,
            "text": "Les questions, c'est comment je peux faire ça ?"
        },
        {
            "start": 1743,
            "end": 1752,
            "text": "Je peux faire ça par exemple par un séparateur linéaire, je dois trouver ce qu'on appelle un espace de redescription de plus grande dimension."
        },
        {
            "start": 1752,
            "end": 1760,
            "text": "Les questions, c'est comment je peux trouver cet espace de redescription et comment je peux garantir la réalisation des calculs ?"
        },
        {
            "start": 1760,
            "end": 1775,
            "text": "Pour ça, c'est là qu'il y a vraiment l'astuce des fonctions noyaux, qui fait qu'on va éviter de calculer explicitement la transformation Φ, et on va plutôt s'appuyer sur des fonctions particulières qui sont des fonctions noyaux."
        },
        {
            "start": 1775,
            "end": 1793,
            "text": "Plutôt qu'appliquer la transformation de changement de représentation, on va définir une fonction noyau K, telle que K de XI, XJ, c'est égal au produit scalaire de la transformée de XI et de la transformée de XJ."
        },
        {
            "start": 1793,
            "end": 1797,
            "text": "Ce produit scalaire dans l'espace de redescription."
        },
        {
            "start": 1797,
            "end": 1804,
            "text": "Je cherche une fonction K qui correspond au produit scalaire dans mon espace H, qui est mon espace de redescription."
        },
        {
            "start": 1804,
            "end": 1810,
            "text": "Il y a des travaux théoriques qui prouvent que de telles fonctions existent."
        },
        {
            "start": 1810,
            "end": 1820,
            "text": "C'est notamment le théorème de Mercer qui dit qu'une fonction noyau K continue symétrique et semi-définie positive peut s'exprimer comme un produit scalaire dans un espace de plus grande dimension."
        },
        {
            "start": 1820,
            "end": 1827,
            "text": "En utilisant cette fonction noyau, la fonction de décision dans l'espace d'origine devient celle-ci."
        },
        {
            "start": 1827,
            "end": 1856,
            "text": "La somme pour Y qui appartient au vecteur support de αI, YI, la fonction noyau appliquée à XI, X, plus P. On appelle la fonction noyau toute fonction K, qui va de mon espace originelle dans R, et qui peut être interprétée comme un produit scalaire dans un plongement Φ."
        },
        {
            "start": 1856,
            "end": 1878,
            "text": "Le gros avantage, c'est qu'on peut maintenant appliquer tous les algorithmes qu'on a vus précédemment de séparation optimale avec marge souple ou dure, donc avec les contraintes de relâchement, en remplaçant le produit scalaire entre XI et XJ par la fonction noyau K de XI, XJ."
        },
        {
            "start": 1878,
            "end": 1886,
            "text": "J'obtiens ainsi un classifieur exprimé comme ça, et qui est lui linéaire dans l'espace de plongement."
        },
        {
            "start": 1886,
            "end": 1896,
            "text": "Il existe énormément de travaux sur des fonctions noyaux, il existe énormément de fonctions noyaux, par exemple les noyaux polynomials, le noyau gaussien, le noyau sigmoïde, etc."
        },
        {
            "start": 1896,
            "end": 1907,
            "text": "Le choix du noyau est très important dans la mise en œuvre des SVM, parce qu'il doit maximiser les chances d'être dans le bon espace."
        },
        {
            "start": 1907,
            "end": 1914,
            "text": "Ça fait aussi partie des hyper paramètres des SVM, le choix du noyau."
        },
        {
            "start": 1914,
            "end": 1922,
            "text": "Enfin, si je veux en finir avec les SVM, je dois parler du cas où on a plusieurs classes."
        },
        {
            "start": 1922,
            "end": 1928,
            "text": "On n'a parlé ici que des SVM dans le cadre binaire, c'est un problème de classification binaire."
        },
        {
            "start": 1928,
            "end": 1937,
            "text": "Comment transformer tout ce qu'on a vu précédemment, ou comment l'adapter à un cas où j'ai plusieurs classes ?"
        },
        {
            "start": 1937,
            "end": 1944,
            "text": "Ici, je n'ai plus deux classes, mais j'ai ces classes CI, et donc typiquement, telle que c'est, et plus grande que 2."
        },
        {
            "start": 1944,
            "end": 1949,
            "text": "Il y a plusieurs stratégies pour appliquer les SVM au cadre multiclasse."
        },
        {
            "start": 1949,
            "end": 1952,
            "text": "Il y a une stratégie qui s'appelle le one versus all."
        },
        {
            "start": 1952,
            "end": 1977,
            "text": "Ça consiste à prendre pour une classe CI ses exemples positifs, et de ramener un problème de classification binaire en prenant tous les exemples des autres classes CI différents de I qui valent moins 1."
        },
        {
            "start": 1977,
            "end": 1980,
            "text": "Je me ramène ainsi un problème de classification binaire."
        },
        {
            "start": 1980,
            "end": 1983,
            "text": "Je vais apprendre ces classifiers binaires."
        },
        {
            "start": 1983,
            "end": 1993,
            "text": "Pour faire mon classement, je vais retenir la classe qui a le plus fort score comme classe pour mes données."
        },
        {
            "start": 1993,
            "end": 1997,
            "text": "Une autre stratégie s'appelle le one versus one."
        },
        {
            "start": 1997,
            "end": 2006,
            "text": "Cette fois-ci, je vais prendre les exemples positifs d'une classe I1 et les exemples négatifs d'une classe I2."
        },
        {
            "start": 2006,
            "end": 2011,
            "text": "Je vais apprendre de cette manière ces fois-ci moins 1 sur 2 classifiers binaires."
        },
        {
            "start": 2011,
            "end": 2016,
            "text": "Il faut bien sûr que je fasse s'affronter mes différents classifiers."
        },
        {
            "start": 2016,
            "end": 2022,
            "text": "Je vais mettre en place un processus de tournoi et je vais voter pour chaque classifier."
        },
        {
            "start": 2022,
            "end": 2024,
            "text": "Une classe va gagner à chaque fois."
        },
        {
            "start": 2024,
            "end": 2034,
            "text": "En agrégeant mes votes, je vais obtenir le vainqueur et la classe que je vais pouvoir affecter à mes données."
        },
        {
            "start": 2034,
            "end": 2037,
            "text": "Un petit bilan sur les SVM."
        },
        {
            "start": 2037,
            "end": 2042,
            "text": "C'est une approche d'apprentissage qui est relativement puissante et qui est capable de trouver des motifs non linéaires."
        },
        {
            "start": 2042,
            "end": 2045,
            "text": "C'est intéressant avec deux idées principales."
        },
        {
            "start": 2045,
            "end": 2051,
            "text": "Cette maximisation de la marge entre la frontière de décision et les exemples les plus proches, qui sont les vecteurs supports."
        },
        {
            "start": 2051,
            "end": 2063,
            "text": "Et puis l'astuce des noyaux avec une redescription des observations dans un nouvel espace où une séparation linéaire sera possible dans le cas où elle ne l'est pas dans l'espace originel."
        },
        {
            "start": 2063,
            "end": 2067,
            "text": "Et puis pour finir, une extension facile au cas multiclasse."
        },
        {
            "start": 2067,
            "end": 2077,
            "text": "Après cette grosse parenthèse sur les SVM, je peux revenir à mon problème d'ordonnancement avec l'approche de transformer par paire."
        },
        {
            "start": 2077,
            "end": 2080,
            "text": "Et donc vous présenter la méthode ranking SVM."
        },
        {
            "start": 2080,
            "end": 2093,
            "text": "Typiquement, je peux directement utiliser cette méthode des SVM pour trouver un hyperplan séparateur de mes données générées en appliquant la transformée par paire."
        },
        {
            "start": 2093,
            "end": 2102,
            "text": "Mes données d'apprentissage, c'est ppaire x1, x2, labellisées comme présentées précédemment."
        },
        {
            "start": 2102,
            "end": 2110,
            "text": "La formulation de ce problème en utilisant les SVM devient celle-là."
        },
        {
            "start": 2110,
            "end": 2114,
            "text": "Je cherche à maximiser ma marge."
        },
        {
            "start": 2114,
            "end": 2121,
            "text": "Ici, c'est la formulation avec des marges souples, avec mes contraintes de relâchement."
        },
        {
            "start": 2121,
            "end": 2141,
            "text": "Sous contrainte que mes ppaires d'apprentissage, exprimées comme la différence de mes paires originelles, soient bien classées, avec mes contraintes de relâchement, etc."
        },
        {
            "start": 2141,
            "end": 2149,
            "text": "Je sais résoudre ce type de problème avec des techniques d'optimisation."
        },
        {
            "start": 2149,
            "end": 2162,
            "text": "La solution du problème me donne une solution optimale, qui est finalement l'estimation de W. Comment je peux classer ?"
        },
        {
            "start": 2162,
            "end": 2175,
            "text": "Je sais que x' est préféré à x si et seulement si le signe du classifiaire est négatif."
        },
        {
            "start": 2175,
            "end": 2182,
            "text": "Si le signe de W étoile x-x' est négatif."
        },
        {
            "start": 2182,
            "end": 2190,
            "text": "Je pourrais classer en utilisant cette équation et ce mécanisme."
        },
        {
            "start": 2190,
            "end": 2196,
            "text": "On va directement utiliser le score du modèle qu'on vient d'apprendre."
        },
        {
            "start": 2196,
            "end": 2201,
            "text": "Cela répond aussi à la deuxième question, qui est comment trier les documents pour de nouvelles requêtes."
        },
        {
            "start": 2201,
            "end": 2217,
            "text": "Pour chaque requête, je vais considérer mon x' qui vaut le vecteur nul, et je vais trier le document sur le score obtenu directement par la fonction W étoile x-x'."
        },
        {
            "start": 2217,
            "end": 2225,
            "text": "Ce score obtenu est celui-là, avec x qui est toujours une paire document requête."
        },
        {
            "start": 2225,
            "end": 2231,
            "text": "Cela ne change pas, c'est toujours l'élément principal de ces approches Learning to Rank."
        },
        {
            "start": 2231,
            "end": 2244,
            "text": "Il y a bien sûr plein d'autres approches pour faire des stratégies Learning to Rank à partir de l'approche par paire, que je ne présenterai pas ici, mais juste pour résumer l'approche par paire."
        },
        {
            "start": 2244,
            "end": 2253,
            "text": "On a des données d'entrée qui sont des données ordonnées, mais de paire de vecteurs."
        },
        {
            "start": 2253,
            "end": 2260,
            "text": "On considère les documents par paire et pas les documents indépendamment comme dans l'approche par point."
        },
        {
            "start": 2260,
            "end": 2268,
            "text": "Je me ramène à un problème de classification binaire avec l'approche de transformer par paire."
        },
        {
            "start": 2268,
            "end": 2277,
            "text": "J'apprends ce classifieur qui, en utilisant son score, va me permettre de faire le classement."
        },
        {
            "start": 2277,
            "end": 2286,
            "text": "J'ai ici une fonction de coût paireoise de classification."
        },
        {
            "start": 2286,
            "end": 2293,
            "text": "Pour le classement, j'ai juste à trier les valeurs de sortie de mon classifieur."
        },
        {
            "start": 2293,
            "end": 2305,
            "text": "Je peux donc proposer à l'utilisateur une liste ordonnée de documents, que j'évalue avec les mesures d'évaluation classique d'ordonnancement."
        },
        {
            "start": 2305,
            "end": 2314,
            "text": "La dernière approche possible pour l'apprentissage par ordonnancement, c'est l'approche par liste."
        },
        {
            "start": 2314,
            "end": 2320,
            "text": "Le principe est simple, c'est de traiter directement les listes triées comme des exemples d'apprentissage."
        },
        {
            "start": 2320,
            "end": 2323,
            "text": "Directement d'apprendre à partir de listes triées."
        },
        {
            "start": 2323,
            "end": 2326,
            "text": "Pour ça, il y a deux types d'approches."
        },
        {
            "start": 2326,
            "end": 2333,
            "text": "Il y a des approches qui ont dans leur fonction objectif des éléments liés aux mesures d'évaluation."
        },
        {
            "start": 2333,
            "end": 2340,
            "text": "Par exemple, il y a une approche qui s'appelle SVM Map, qui utilise des vecteurs SVM."
        },
        {
            "start": 2340,
            "end": 2354,
            "text": "La fonction objectif est la borne supérieure de la mesure d'évaluation Map, le mean average precision, dont on a parlé pendant le cours d'évaluation."
        },
        {
            "start": 2354,
            "end": 2359,
            "text": "Il y a aussi des fonctions objectives qui sont directement définies sur des listes de documents."
        },
        {
            "start": 2359,
            "end": 2365,
            "text": "C'est compliqué ces mesures-là, parce qu'en général, on est sur des mesures d'évaluation non continues."
        },
        {
            "start": 2365,
            "end": 2371,
            "text": "On rentre dans des problématiques de différenciabilité et ça devient un peu compliqué."
        },
        {
            "start": 2371,
            "end": 2383,
            "text": "Je ne présenterai pas d'approche très détaillée sur cette approche par liste, parce que chaque approche nécessiterait de gros développements."
        },
        {
            "start": 2383,
            "end": 2390,
            "text": "Le petit bilan sur les approches par liste, avec un même mécanisme pour l'apprentissage et le classement."
        },
        {
            "start": 2390,
            "end": 2405,
            "text": "On fait une permutation sur cette fonction F, et on a donc une fonction de coût qui est la même pour l'apprentissage et le classement."
        },
        {
            "start": 2405,
            "end": 2412,
            "text": "Parce que typiquement, on s'appuie sur les mesures d'évaluation de classement pour construire cette fonction de coût."
        },
        {
            "start": 2412,
            "end": 2420,
            "text": "On a vu que quand on est dans des approches à base d'apprentissage, il est nécessaire d'avoir des données d'apprentissage."
        },
        {
            "start": 2420,
            "end": 2426,
            "text": "La question c'est, quelles sont les données d'apprentissage à disposition pour mettre en œuvre ce type d'approche ?"
        },
        {
            "start": 2426,
            "end": 2432,
            "text": "Il existe un certain nombre de données de benchmark qui sont disponibles."
        },
        {
            "start": 2432,
            "end": 2444,
            "text": "Il y a des données qui sont annotées pour plusieurs collections, notamment les collections TREC, qui sont les challenges classiques en évaluation dans la recherche d'informations, clé pour tout ce qui est multilinguisme."
        },
        {
            "start": 2444,
            "end": 2447,
            "text": "NTCIR, c'est plutôt des données médicales."
        },
        {
            "start": 2447,
            "end": 2453,
            "text": "Les TOR, qui sont vraiment des données qui ont été mises à disposition pour les paradigmes Learning to Rank."
        },
        {
            "start": 2453,
            "end": 2458,
            "text": "Et puis, il y a Yahoo qui a aussi mis à disposition beaucoup de données."
        },
        {
            "start": 2458,
            "end": 2466,
            "text": "Pour les entreprises, c'est un peu plus compliqué parce qu'on n'a pas de telles données en général, et il faut pouvoir les constituer."
        },
        {
            "start": 2466,
            "end": 2476,
            "text": "Dans le cas du web, c'est un petit peu différent parce qu'on a une information très riche qui provient du clic des utilisateurs."
        },
        {
            "start": 2476,
            "end": 2485,
            "text": "Et à partir de cette information de clic, on peut inférer des préférences entre documents, et donc on peut inférer très facilement des paires de préférences."
        },
        {
            "start": 2485,
            "end": 2496,
            "text": "C'est pour ça que l'approche par paire est très développée dans les approches d'apprentissage pour l'ARI, et notamment dans le contexte du web."
        },
        {
            "start": 2496,
            "end": 2505,
            "text": "Alors, il faut faire attention bien sûr parce que les clics, ils ne fournissent pas de jugement de pertinence absolue mais relatif, et donc c'est ce qu'on veut pour l'approche par paire."
        },
        {
            "start": 2505,
            "end": 2515,
            "text": "Et donc typiquement, il y a énormément de stratégies qui peuvent être mises en place pour constituer ces données d'apprentissage."
        },
        {
            "start": 2515,
            "end": 2522,
            "text": "Donc considérons un ordre D1, Dn par exemple, et c'est un ensemble de documents cliqués."
        },
        {
            "start": 2522,
            "end": 2530,
            "text": "Alors, on pourrait par exemple utiliser cette stratégie pour construire un ordre de pertinence entre documents."
        },
        {
            "start": 2530,
            "end": 2539,
            "text": "Donc si un document Di appartient à C et que Di n'appartient pas à C, forcément Di est préféré pour la requête Q à Di."
        },
        {
            "start": 2539,
            "end": 2552,
            "text": "Voilà, si Di c'est le dernier document cliqué, et quel que soit J qui est inférieur à I, alors Di n'appartient pas à C, alors Di est préféré à Dj pour la requête Q."
        },
        {
            "start": 2552,
            "end": 2554,
            "text": "Et puis, etc etc."
        },
        {
            "start": 2554,
            "end": 2560,
            "text": "On peut mettre en place énormément de stratégies comme ça pour construire des ordres de pertinence entre documents."
        },
        {
            "start": 2560,
            "end": 2573,
            "text": "Voilà, alors il faut être quand même vigilant avec ça, et avec l'exploitation des clics comme substitut de pertinence, parce que c'est fortement biaisé."
        },
        {
            "start": 2573,
            "end": 2586,
            "text": "Voilà, typiquement prenons un exemple, avec la requête à Implicit Feedback in Information Retrieval, l'utilisateur clique sur le premier document."
        },
        {
            "start": 2586,
            "end": 2594,
            "text": "Est-ce que pour autant on peut dire que le premier document est plus pertinent que le deuxième pour ce besoin d'information ?"
        },
        {
            "start": 2594,
            "end": 2596,
            "text": "C'est très discutable."
        },
        {
            "start": 2596,
            "end": 2606,
            "text": "Voilà, de même, un utilisateur ne clique pas sur un des premiers documents."
        },
        {
            "start": 2606,
            "end": 2610,
            "text": "Est-ce qu'on peut pour autant dire que le deuxième est beaucoup plus pertinent que le premier ?"
        },
        {
            "start": 2610,
            "end": 2612,
            "text": "C'est pareil, c'est très discutable."
        },
        {
            "start": 2612,
            "end": 2622,
            "text": "Et c'est des choix d'interprétation des clics, qui sont des choix de conception."
        },
        {
            "start": 2622,
            "end": 2629,
            "text": "Le clic, ça peut être aussi un élément de pertinence très bruté."
        },
        {
            "start": 2629,
            "end": 2647,
            "text": "Par exemple, ici, j'ai toujours la même requête, Implicit Feedback in Information Retrieval, mais parce que mon moteur de recherche n'est pas très bon, il me renvoie cette liste d'images, je me demande pourquoi, ça m'interroge, ça attire ma curiosité, je clique."
        },
        {
            "start": 2647,
            "end": 2657,
            "text": "Prenons aussi un autre cas qui est difficile à interpréter, où cette fois-ci, ma requête, c'est la capitale de Londres."
        },
        {
            "start": 2657,
            "end": 2676,
            "text": "Donc, je vais me demander pourquoi, je vais me demander si je peux me faire un lien avec ce document, je vais me demander si je peux me faire un lien avec ce document, je vais me demander si je peux me faire un lien avec ce document, je vais me demander si je peux me faire un lien avec ce document, où cette fois-ci, ma requête, c'est la capitale de Londres."
        },
        {
            "start": 2676,
            "end": 2681,
            "text": "L'utilisateur, fois ces résultats-là, il quitte son aviateur."
        },
        {
            "start": 2681,
            "end": 2689,
            "text": "On pourrait interpréter ça comme, il n'est pas satisfait des résultats du moteur de recherche."
        },
        {
            "start": 2689,
            "end": 2700,
            "text": "Le problème, c'est qu'il va exactement avoir le même comportement pour cette requête-là et ces résultats-là."
        },
        {
            "start": 2700,
            "end": 2700,
            "text": "Pourquoi ?"
        },
        {
            "start": 2700,
            "end": 2703,
            "text": "Parce qu'il a directement la réponse à sa question."
        },
        {
            "start": 2703,
            "end": 2717,
            "text": "Et donc, on voit bien toute la difficulté, finalement, qui est liée à l'analyse des clics et notamment à l'analyse des clics comme substitut de cette notion de pertinence."
        },
        {
            "start": 2717,
            "end": 2736,
            "text": "C'est juste des petits exemples pour vous montrer à quel point tout cela est forcément bruité et à quel point ça peut introduire des biais et même des erreurs dans l'exploitation des clics, justement pour l'amélioration des moteurs de recherche."
        },
        {
            "start": 2736,
            "end": 2748,
            "text": "Voilà, juste pour en finir sur les jeux de données, une rapide présentation du jeu de données Lettor, qui est un petit peu le jeu de données qui est devenu très standard pour l'évaluation des algorithmes d'ordonnancement."
        },
        {
            "start": 2748,
            "end": 2757,
            "text": "C'est un jeu de données qui a été proposé par Microsoft Research avec un certain nombre de collections proposées dans le jeu de données."
        },
        {
            "start": 2757,
            "end": 2772,
            "text": "Et puis, il y a eu énormément d'autres initiatives, notamment Yahoo qui a proposé un challenge autour de l'apprentissage pour l'ordonnancement, et puis ensuite Microsoft, avec des jeux de données à chaque fois de plus en plus gros."
        },
        {
            "start": 2772,
            "end": 2796,
            "text": "Voilà, donc juste des ordres de grandeur, donc Lettor, on a une dizaine de jeux de données avec à chaque fois un certain nombre de requêtes et pour chaque requête, un certain nombre de documents associés, soit exprimés sous paires, soit donnés comme une liste de documents pertinents ordonnés."
        },
        {
            "start": 2796,
            "end": 2801,
            "text": "Et puis aussi un certain nombre de variables descriptives des données."
        },
        {
            "start": 2801,
            "end": 2828,
            "text": "Voilà, typiquement dans Lettor, on a chaque paire de données requêtes documents et définies selon un certain nombre de variables, dont ces 37 là, donc qui sont typiquement les caractéristiques qu'on utilise, que vous avez essayé d'utiliser dans le Lab 1 pour caractériser aussi vos données d'apprentissage."
        },
        {
            "start": 2828,
            "end": 2856,
            "text": "Alors, il y a un problème dont on n'a pas vraiment trop parlé jusqu'à maintenant, qui est un problème de réduction de la dimension et qui est nettement lié au fait que l'ensemble de nos vecteurs caractéristiques sont décrits dans un espace de très grande dimension, un espace qui est engendré par le vocabulaire de termes, donc avec autant de termes dans le vocabulaire en fait que de dimensions dans l'espace de représentation."
        },
        {
            "start": 2856,
            "end": 2865,
            "text": "Et donc, il peut se poser un certain nombre de questions pour essayer de réduire cet espace de représentation."
        },
        {
            "start": 2865,
            "end": 2870,
            "text": "Et notamment, on peut faire ça en utilisant énormément de techniques de sélection de variables."
        },
        {
            "start": 2870,
            "end": 2876,
            "text": "Donc l'objectif, c'est de réduire la grande dimensionnalité de l'espace de représentation des documents."
        },
        {
            "start": 2876,
            "end": 2891,
            "text": "Avec plusieurs approches, il y a des approches qui consistent à faire du seuil sur la mesure des f, où typiquement on va supprimer les termes qui ont une faible fréquence dont on peut penser qu'ils ne sont pas informatifs pour une classe de données."
        },
        {
            "start": 2891,
            "end": 2896,
            "text": "Donc ça, c'est des choses qu'on va beaucoup utiliser quand on est dans un cadre, par exemple, de catégorisation de documents."
        },
        {
            "start": 2896,
            "end": 2914,
            "text": "Et puis, il y a d'autres mesures qui se basent plutôt sur des mesures d'estimation de l'information, avec notamment la mesure d'information mutuelle ponctuelle, qui consiste à estimer l'information que la présence d'un terme apporte à la classe C et apporte à la catégorisation de cette classe."
        },
        {
            "start": 2914,
            "end": 2923,
            "text": "Et puis, l'information mutuelle qui s'intéresse à la présence et l'absence de termes et ce qu'ils apportent sur la catégorisation de la classe."
        },
        {
            "start": 2923,
            "end": 2934,
            "text": "Donc, je ne détaillerai pas ces approches ici, mais vous avez une version détaillée des slides sur Edunao."
        },
        {
            "start": 2934,
            "end": 2946,
            "text": "Voilà, et j'aimerais juste terminer ce cours par une petite ouverture et justement, qui traite de cet aspect relatif à la représentation de l'information."
        },
        {
            "start": 2946,
            "end": 2959,
            "text": "Donc, on a utilisé jusqu'à maintenant des représentations vectorielles et donc sur un espace qui est engendré par le vocabulaire de termes, avec comme dimension la cardinalité du vocabulaire de termes."
        },
        {
            "start": 2959,
            "end": 2969,
            "text": "Donc, voilà, on peut représenter le document de manière binaire en termes de présence ou absence des termes de ce vocabulaire."
        },
        {
            "start": 2969,
            "end": 2979,
            "text": "On peut aussi représenter un terme de cette manière-là, c'est-à-dire que le terme sur l'espace engendré par le vocabulaire de termes, il a une représentation de l'espace."
        },
        {
            "start": 2979,
            "end": 2987,
            "text": "Il a une représentation one-hot, donc il y a 1 pour la dimension qui correspond au terme et 0 pour les autres dimensions."
        },
        {
            "start": 2987,
            "end": 2998,
            "text": "Et puis, bien sûr, tout ça, on peut le représenter avec de la pondération, en avis à quel point la pondération était importante en recherche d'informations."
        },
        {
            "start": 2998,
            "end": 3013,
            "text": "Voilà, alors il y a des grosses limitations à ce type de représentation et notamment, en fait, très liées à la compréhension, l'étude fine de la langue et ce qu'on pourrait en faire en recherche d'informations."
        },
        {
            "start": 3013,
            "end": 3023,
            "text": "Et notamment, il est très difficile de traiter des problèmes de polysémie et de synonymie avec ce type de représentation."
        },
        {
            "start": 3023,
            "end": 3031,
            "text": "Ce type de représentation, elles font toujours l'hypothèse que les mots sont indépendants, alors on sait bien que les mots ne sont pas indépendants."
        },
        {
            "start": 3031,
            "end": 3040,
            "text": "Et puis, finalement, ce ne sont pas des représentations qui arrivent à capter réellement la sémantique d'un mot."
        },
        {
            "start": 3040,
            "end": 3055,
            "text": "Voilà, et donc, on pourrait vouloir essayer d'améliorer ces représentations des mots et donc des documents en essayant de trouver des représentations qui portent un peu plus la sémantique des mots."
        },
        {
            "start": 3055,
            "end": 3059,
            "text": "Par exemple, pour faire de l'expansion de requêtes en prenant en compte cette sémantique."
        },
        {
            "start": 3059,
            "end": 3067,
            "text": "Supposons que vous cherchiez à faire une requête jaguar, est-ce qu'on parle de jaguar la voiture, est-ce qu'on parle de jaguar animal ?"
        },
        {
            "start": 3067,
            "end": 3076,
            "text": "Voilà, c'est typiquement ce type de sémantique qu'on aimerait capter et associer aux mots."
        },
        {
            "start": 3076,
            "end": 3087,
            "text": "Donc, l'expansion de requêtes, c'est une technique de recherche d'informations qui a principalement comme objectif d'augmenter le rappel des systèmes de recherche."
        },
        {
            "start": 3087,
            "end": 3094,
            "text": "On va typiquement étendre la requête en utilisant un certain nombre de ressources globales qui sont non-dépendantes de la requête."
        },
        {
            "start": 3094,
            "end": 3118,
            "text": "Alors, il y a trois approches principales, des techniques d'expansion de requêtes avec des thésaurus existants, donc par exemple WordNet ou PuMed, une expansion avec une génération automatique de thésaurus, et puis il y a aussi, bien sûr, des expansions de requêtes de l'ordre de la correction orthographique dont on ne parlera pas ici."
        },
        {
            "start": 3118,
            "end": 3128,
            "text": "Voilà, donc le principe, c'est que chaque terme de la requête va pouvoir être étendu avec des synonymes ou des termes qui sont sémantiquement proches en utilisant un thésaurus."
        },
        {
            "start": 3128,
            "end": 3135,
            "text": "Donc, on va voir justement comment on peut capter ces termes sémantiquement proches avec donc différentes approches."
        },
        {
            "start": 3135,
            "end": 3139,
            "text": "Donc, la notion de thésaurus, elle est multiple."
        },
        {
            "start": 3139,
            "end": 3148,
            "text": "Soit on a des thésaurus manuels qui sont maintenus par des thésaurus, soit on a des thésaurus manuels qui sont maintenus par des éditeurs, comme par exemple PuMed ou WordNet."
        },
        {
            "start": 3148,
            "end": 3156,
            "text": "Soit on peut dériver automatiquement des thésaurus à partir notamment de statistiques de co-occurrence entre mots sur une collection."
        },
        {
            "start": 3156,
            "end": 3159,
            "text": "Donc, on prend en compte aussi le contexte des mots dans une collection."
        },
        {
            "start": 3159,
            "end": 3167,
            "text": "Et on peut aussi, bien sûr, utiliser l'analyse des logs des requêtes et en faisant de la reformulation de requêtes en utilisant les requêtes qui ont été formulées par d'autres utilisateurs."
        },
        {
            "start": 3167,
            "end": 3205,
            "text": "Donc, si je pars d'un thésaurus existant, automatiquement, ce qui est fait dans le site PuMed, qui est un site qui permet d'accéder à des articles médicaux, ou voilà, si je fais une requête cancer, automatiquement, ma requête va être étendue avec les termes néoplasme et cancer, qui sont en fait des mots d'une ressource terminologique qui s'appelle MeSH, et qui sont donc des termes qui sont beaucoup plus médicaux."
        },
        {
            "start": 3205,
            "end": 3206,
            "text": "Je peux aussi utiliser WordNet."
        },
        {
            "start": 3206,
            "end": 3207,
            "text": "Alors, WordNet, c'est quoi ?"
        },
        {
            "start": 3207,
            "end": 3215,
            "text": "C'est une ressource lexicale, qui est certainement la ressource lexicale qui est la plus utilisée en traitement du langage naturel."
        },
        {
            "start": 3215,
            "end": 3218,
            "text": "Elle est développée à Princeton depuis 1985."
        },
        {
            "start": 3218,
            "end": 3228,
            "text": "Et en gros, elle est constituée de ce qu'on appelle un ensemble de synsets, qui est en fait un groupe de sens ou des synonymes."
        },
        {
            "start": 3228,
            "end": 3234,
            "text": "Et ces synsets, ils sont reliés entre eux par des relations lexicales et sémantico-conceptuelles."
        },
        {
            "start": 3234,
            "end": 3240,
            "text": "Donc, c'est une vraie grosse ressource lexicale qui est intéressante et qui a été portée en plusieurs langues."
        },
        {
            "start": 3240,
            "end": 3244,
            "text": "Et elle a aussi l'avantage d'être disponible dans NLTK."
        },
        {
            "start": 3244,
            "end": 3250,
            "text": "Donc voilà, par exemple, prenons une requête dog."
        },
        {
            "start": 3250,
            "end": 3255,
            "text": "Voilà, j'importe NLTK et j'importe WordNet."
        },
        {
            "start": 3255,
            "end": 3262,
            "text": "Et je demande finalement d'accéder à l'ensemble des synsets qui sont associés au terme dog."
        },
        {
            "start": 3262,
            "end": 3268,
            "text": "Voilà, on voit qu'il y en a un certain nombre de synsets qui sont associés au terme dog, dont tous ceux-là."
        },
        {
            "start": 3268,
            "end": 3271,
            "text": "Et on voit qu'on a une définition associée."
        },
        {
            "start": 3271,
            "end": 3277,
            "text": "Et donc, du coup, je peux tout à fait utiliser cette définition pour faire de l'expansion de requête."
        },
        {
            "start": 3277,
            "end": 3292,
            "text": "Typiquement, je peux aussi prendre un ordre dans les synsets qui me sont renvoyés, qui sont des ordres de fréquence, dans ce mécanisme d'expansion de requête."
        },
        {
            "start": 3292,
            "end": 3300,
            "text": "Je peux aussi vouloir créer mon propre thésaurus de co-occurrence en faisant de l'analyse de la distribution des mots dans un document."
        },
        {
            "start": 3300,
            "end": 3308,
            "text": "Typiquement, ça se base sur une similarité des mots qui est beaucoup plus contextuelle que réellement sémantique."
        },
        {
            "start": 3308,
            "end": 3314,
            "text": "C'est-à-dire qu'on va prendre en compte une similarité, on va considérer que deux mots sont similaires s'ils co-occurrent avec les mêmes mots."
        },
        {
            "start": 3314,
            "end": 3333,
            "text": "Typiquement, voiture et moto sont similaires parce qu'ils vont co-occurrer très souvent dans un corpus avec les mots route et essence, qui n'est pas tout à fait la même chose que la similarité quand ils co-occurrent avec la même relation grammaticale."
        },
        {
            "start": 3333,
            "end": 3348,
            "text": "Et donc, ce théausaurus de co-occurrence, en fait, on peut le construire avec des outils dont on a déjà parlé, notamment à partir de la matrice d'incidence terme document, ou WIJ, c'est le poids normalisé pour le terme TI dans le document DJI."
        },
        {
            "start": 3348,
            "end": 3367,
            "text": "Si je construis la matrice de co-occurrence C en faisant A fois la transformée de A, eh bien, j'obtiens donc ma matrice de co-occurrence et pour chaque terme TI, je peux prendre les termes qui sont maximum dans C, bien sûr en utilisant ce que j'obtiens avec les points."
        },
        {
            "start": 3367,
            "end": 3379,
            "text": "Et voilà, par exemple, ce que je peux obtenir sur un exemple donné, qui sont donc les termes qui co-occurrent avec un certain nombre de mots donnés en utilisant cette approche."
        },
        {
            "start": 3379,
            "end": 3387,
            "text": "Et typiquement, je pourrais du coup faire de l'expansion de requêtes en utilisant ces plus proches voisins dans mon théaurus de co-occurrence."
        },
        {
            "start": 3387,
            "end": 3392,
            "text": "Par exemple, lithogra, je pourrais l'étendre avec drawing, Picasso, Dali, etc."
        },
        {
            "start": 3392,
            "end": 3398,
            "text": "On voit que du coup, avec cette approche, la qualité des associations est souvent discutable."
        },
        {
            "start": 3398,
            "end": 3410,
            "text": "En plus de ça, on a souvent une matrice qui est fortement creuse, on avait déjà le problème avec la matrice terme incidence, et du coup, l'imbiguïté des termes peut quand même introduire de mauvaises associations entre nos termes."
        },
        {
            "start": 3410,
            "end": 3421,
            "text": "Et donc, on va essayer de trouver une nouvelle approche, et notamment, l'approche, elle va consister à essayer d'apprendre directement les relations entre les termes."
        },
        {
            "start": 3421,
            "end": 3425,
            "text": "Donc, revenons à notre problème de la relation entre termes."
        },
        {
            "start": 3425,
            "end": 3427,
            "text": "La représentation des termes."
        },
        {
            "start": 3427,
            "end": 3430,
            "text": "Nos termes, ils sont considérés comme des symboles atomiques."
        },
        {
            "start": 3430,
            "end": 3437,
            "text": "Chaque terme, c'est une dimension, et donc, on l'a vu avec une représentation de type ouanote."
        },
        {
            "start": 3437,
            "end": 3448,
            "text": "Voilà, prenons par exemple le terme motel et le terme hôtel, et leur représentation ouanote."
        },
        {
            "start": 3448,
            "end": 3462,
            "text": "Supposons que notre requête contienne le terme motel, et que les documents qui sont dans notre corpus ne parlent que de termes hôtel."
        },
        {
            "start": 3462,
            "end": 3483,
            "text": "Et bien, typiquement, c'est l'inverse ici, mais si j'ai une requête sur hôtel et que le document parle de motel, alors avec les principes de recherche qu'on a mis en œuvre, qui font appel, du coup, au produit scalaire, je vais forcément avoir une similarité qui va être nulle entre ma requête et mon document."
        },
        {
            "start": 3483,
            "end": 3492,
            "text": "Donc, c'est vraiment ce problème-là, en fait, qui est limitant et pour lequel on aimerait apporter une solution."
        },
        {
            "start": 3492,
            "end": 3497,
            "text": "Et typiquement, ce qu'on aimerait, c'est avoir une meilleure représentation de nos termes."
        },
        {
            "start": 3497,
            "end": 3514,
            "text": "Donc, l'idée, ça va être d'apprendre une représentation qui va être de plus petite dimension d'un mot donné, d'un terme, donc dans RD, et telle que cette représentation U, elle soit telle que UTV représente la similarité entre mots."
        },
        {
            "start": 3514,
            "end": 3521,
            "text": "Donc, le principe, ça va être de représenter chaque mot par ce qu'on appelle un vecteur distributionnel."
        },
        {
            "start": 3521,
            "end": 3523,
            "text": "Et donc, en gros, on va représenter un mot à l'aide de ses voisins."
        },
        {
            "start": 3523,
            "end": 3526,
            "text": "C'est pour ça qu'on appelle ça un vecteur distributionnel."
        },
        {
            "start": 3526,
            "end": 3541,
            "text": "Et donc, ça, ça utilise un principe qui est un principe qui date des années 50, qui a été énoncé par First, et qui dit qu'on peut connaître la compagnie, qu'on peut connaître, pardon, qu'on peut connaître un mot par la compagnie de ce mot-là."
        },
        {
            "start": 3541,
            "end": 3548,
            "text": "Voilà, donc on va aussi, du coup, mettre en place dans ce mécanisme de similarité distributionnelle de la similarité entre vecteurs."
        },
        {
            "start": 3548,
            "end": 3558,
            "text": "Et donc, l'hypothèse, c'est que le sens d'un mot inconnu, il va être devinable par son contexte, et que le contexte va bien sûr aider à caractériser le sens du mot."
        },
        {
            "start": 3558,
            "end": 3562,
            "text": "Et puis, la similarité de contexte va aider à caractériser la similarité de sens."
        },
        {
            "start": 3562,
            "end": 3568,
            "text": "Voilà, donc ça, c'est ce qu'on appelle la similarité distributionnelle, qui consiste à représenter un mot par ses voisins."
        },
        {
            "start": 3568,
            "end": 3571,
            "text": "Donc typiquement, l'idée, c'est ça."
        },
        {
            "start": 3571,
            "end": 3579,
            "text": "Si je veux caractériser banking, eh bien, je veux utiliser les voisins de banking pour caractériser justement le mot banking."
        },
        {
            "start": 3579,
            "end": 3586,
            "text": "Et inversement, je peux caractériser le contexte d'un mot à partir du mot du même."
        },
        {
            "start": 3586,
            "end": 3590,
            "text": "Ça, c'est vraiment une des idées clés pour les mots de la compagnie."
        },
        {
            "start": 3590,
            "end": 3610,
            "text": "Ça, c'est vraiment une des idées clés du traitement du langage naturel moderne, et c'est notamment ce qu'on appelle les techniques d'embedding de mots, type Word2Vec, GloVe, etc., et puis les modèles de langues plus récents, préentraînées, de type BERT, par exemple."
        },
        {
            "start": 3610,
            "end": 3614,
            "text": "Voilà, alors la question, c'est comment représenter un mot par ses voisins."
        },
        {
            "start": 3614,
            "end": 3618,
            "text": "Et donc, pour ça, on va utiliser une représentation dense de plus petite dimension."
        },
        {
            "start": 3618,
            "end": 3630,
            "text": "L'idée, c'est que le nombre de sujets couverts dans un corpus, il est petit, et l'idée, ça va être de stocker l'information la plus importante dans ce petit nombre de dimensions."
        },
        {
            "start": 3630,
            "end": 3634,
            "text": "Donc, on retombe sur un problème de réduction de la dimension."
        },
        {
            "start": 3634,
            "end": 3637,
            "text": "Alors, comment on peut représenter un mot par ses voisins ?"
        },
        {
            "start": 3637,
            "end": 3641,
            "text": "L'approche classique, c'est d'utiliser une matrice de co-occurrence."
        },
        {
            "start": 3641,
            "end": 3642,
            "text": "On l'a parlé juste avant."
        },
        {
            "start": 3642,
            "end": 3644,
            "text": "Après, il y a deux options."
        },
        {
            "start": 3644,
            "end": 3649,
            "text": "Soit je prends en compte tout le document, soit je prends une fenêtre autour de chaque mot."
        },
        {
            "start": 3649,
            "end": 3656,
            "text": "Si je prends en compte tout le document, je vais tomber sur des problèmes qui sont connus comme des problèmes d'analyse en sémantique latente."
        },
        {
            "start": 3656,
            "end": 3666,
            "text": "Et si je prends une fenêtre autour de chaque mot, ben, je suis typiquement dans ce qu'on fait en analyse distributionnelle."
        },
        {
            "start": 3666,
            "end": 3681,
            "text": "Prenons un petit exemple avec une fenêtre de taille A. Donc, j'ai un petit corpus qui est celui-là, donc avec un ensemble de termes qui sont I like, deep learning, NLP, enjoy flying, et puis le point."
        },
        {
            "start": 3681,
            "end": 3688,
            "text": "Et puis, comme j'ai une fenêtre de taille 1, ben, je vais construire du coup ma matrice de co-occurrence."
        },
        {
            "start": 3688,
            "end": 3697,
            "text": "Donc, I n'est jamais voisin de I. I est voisin de like deux fois."
        },
        {
            "start": 3697,
            "end": 3699,
            "text": "I like, I like."
        },
        {
            "start": 3699,
            "end": 3703,
            "text": "I est voisin de enjoy une fois."
        },
        {
            "start": 3703,
            "end": 3705,
            "text": "I n'est jamais voisin de deep, etc."
        },
        {
            "start": 3705,
            "end": 3713,
            "text": "Vous avez compris comment on construit cette matrice de co-occurrence avec un voisinage de taille 1."
        },
        {
            "start": 3713,
            "end": 3721,
            "text": "Donc, j'ai comme ça la représentation d'un mot par ses voisins, donc avec cette matrice de co-occurrence."
        },
        {
            "start": 3721,
            "end": 3732,
            "text": "Après, on peut se poser des questions sur cette représentation, notamment sur son passage à l'échelle, parce qu'on va avoir une taille de la matrice qui va croître avec le vocabulaire."
        },
        {
            "start": 3732,
            "end": 3743,
            "text": "J'ai une matrice qui est non dense, et donc l'idée, ça va être d'essayer de stocker l'information qui est contenue dans cette matrice dans un nombre fixé plus petit de dimensions."
        },
        {
            "start": 3743,
            "end": 3748,
            "text": "Notamment, on estime qu'entre 25 et 1000... 1000 dimensions, c'est très bien."
        },
        {
            "start": 3748,
            "end": 3754,
            "text": "Et donc on va essayer d'utiliser sur cette matrice de co-occurrence des techniques de réduction de la dimension."
        },
        {
            "start": 3754,
            "end": 3763,
            "text": "Alors, une technique de réduction de la dimension qui est assez adéquate pour ce problème, c'est la décomposition en valeur singulière."
        },
        {
            "start": 3763,
            "end": 3771,
            "text": "On sait que toute matrice A de dimension m fois n, avec m qui est supérieur à n, on peut la décomposer de la manière suivante."
        },
        {
            "start": 3771,
            "end": 3790,
            "text": "A, c'est U, sigma, transposé de V, avec U qui est de dimension m fois m unitaire, telle que U, T, U c'est la matrice identité, sigma qui est une matrice m fois n diagonale avec des coefficients réels positifs, donc les sigma 1 supérieur à sigma 2, etc."
        },
        {
            "start": 3790,
            "end": 3794,
            "text": "Et puis V qui est de dimension n fois n et qui est aussi unitaire."
        },
        {
            "start": 3794,
            "end": 3805,
            "text": "Et puis les sigma i, en fait, ce sont ce qu'on appelle les valeurs singulières de la matrice A. Voilà, donc une illustration de cette décomposition en valeur singulière."
        },
        {
            "start": 3805,
            "end": 3846,
            "text": "Pour une matrice X qui est ici de taille V fois V, cardinal de V étant la taille de notre vocabulaire, j'ai cette décomposition avec cette première matrice U de taille cardinal V fois cette matrice diagonale, avec les sigma 1 qui vont être les valeurs singulières, et puis donc la matrice V. Donc les valeurs singulières de X sont les racines carrées des valeurs propres de X, T, X. Les colonnes de V, les valeurs singulières droits de X, c'est les vecteurs propres de X, T, X."
        },
        {
            "start": 3846,
            "end": 3866,
            "text": "Et les colonnes de U, c'est les vecteurs propres de X, X, T. Voilà, cette décomposition en valeur singulière, on peut l'utiliser pour réduire la dimension en sélectionnant uniquement les cas premiers vecteurs singuliers."
        },
        {
            "start": 3866,
            "end": 3908,
            "text": "Je me contente ici de sélectionner les cas premiers vecteurs singuliers, donc je tronque ma matrice U et ma matrice V. Voilà, donc la réduction de la dimension avec la SVD, c'est étant donné un vocabulaire de terme V, je génère la matrice X de taille cardinal V fois cardinal V, j'applique la SVD pour obtenir U, S et V, et puis je choisis les cas premières colonnes de U pour avoir des vecteurs de mots de dimension K. Et ça, du coup, ces cas premières colonnes de U, c'est ce qu'on peut appeler des représentations distributionnelles de mémoire."
        },
        {
            "start": 3908,
            "end": 3921,
            "text": "Et puis on a aussi des informations statistiques qui indiquent comment le fait de choisir que les cas premières dimensions capturent ou pas de l'information."
        },
        {
            "start": 3921,
            "end": 3929,
            "text": "Voilà, reprenons notre petit exemple de tout à l'heure et donc appliquons ce principe de réduction de la dimension sur ce petit exemple-là."
        },
        {
            "start": 3929,
            "end": 3951,
            "text": "Donc j'ai mon ensemble de mots qui est celui-là, je fais appel au module linale de NumPy, et puis j'applique la SVD sur cette matrice X qui est donc ma matrice de co-occurrence telle que construite tout à l'heure, avec un voisinage de contexte, une fenêtre de contexte de taille 1."
        },
        {
            "start": 3951,
            "end": 3976,
            "text": "Je vais du coup, après, sélectionner les deux premières colonnes de U, donc les deux plus grandes valeurs singulières, ce que je fais avec ce code-là, et puis j'affiche du coup les mots obtenus, les représentations des mots obtenus, donc dans cet espace à deux dimensions."
        },
        {
            "start": 3976,
            "end": 3991,
            "text": "Et donc on voit que c'est intéressant, que j'ai peut-être effectivement capté une information un peu plus sémantique avec ce type de représentation, et notamment le fait que NLP soit proche de DEEP dans cet espace, c'est relativement pertinent."
        },
        {
            "start": 3991,
            "end": 3999,
            "text": "ENJOY et LIKE sont pas très loin non plus dans cet espace."
        },
        {
            "start": 3999,
            "end": 4009,
            "text": "Donc c'est intéressant, mais c'est bien sûr coûteux en termes de calcul, et puis il est difficile d'incorporer de nouveaux mots, de nouveaux documents."
        },
        {
            "start": 4009,
            "end": 4015,
            "text": "Juste ce qu'il faut retenir de cette approche, c'est qu'on va souhaiter représenter un mot par un vecteur dense."
        },
        {
            "start": 4015,
            "end": 4023,
            "text": "Voilà, typiquement ce qu'on souhaite c'est un mot associé à ce type de vecteur là, de petite dimension."
        },
        {
            "start": 4023,
            "end": 4032,
            "text": "Et donc cette représentation, en fait on peut la prendre, et notamment on peut la prendre avec des approches qu'utilisent des réseaux de neurones profonds."
        },
        {
            "start": 4032,
            "end": 4048,
            "text": "Donc c'est vraiment cette idée-là, apprendre directement la représentation dans ce démo, et ça c'est typiquement ce qui a été proposé par Mikolov en 2013 avec l'approche Word2Vec, où l'idée c'était de prédire le contexte des mots directement plutôt que de compter les co-occurrences."
        },
        {
            "start": 4048,
            "end": 4061,
            "text": "Donc après il y a eu une famille énorme d'algorithmes qui ont suivi, donc GloVe, BERT, qui est des modèles de langues un peu plus sophistiqués, mais il y a eu énormément d'extensions de cette idée."
        },
        {
            "start": 4061,
            "end": 4066,
            "text": "Donc si je reprends Word2Vec, il y a principalement deux algorithmes."
        },
        {
            "start": 4066,
            "end": 4080,
            "text": "L'algorithme qu'on appelle CEBO, donc Continuous Back of Word Model, qui prédit le mot cible étant donné son contexte, donc étant donné son voisinage, ou l'approche Skipgram qui elle, cherche à prédire le contexte étant donné le mot cible."
        },
        {
            "start": 4080,
            "end": 4088,
            "text": "Donc on va regarder l'approche Skipgram, donc on a des modèles de langues, des modèles de mots."
        },
        {
            "start": 4088,
            "end": 4110,
            "text": "Voilà, donc on a le mot banking qui est le mot central, et puis en fait je vais chercher à prédire le contexte, c'est-à-dire les mots précédents et les mots suivants, justement en essayant d'estimer la probabilité que tel mot soit le mot avant banking, que tel mot soit le mot après banking, etc."
        },
        {
            "start": 4110,
            "end": 4126,
            "text": "Donc j'ai mon mot central, j'ai donc mon fenêtrage de M mots, et puis l'objectif va être de prédire le contexte, c'est-à-dire les mots voisins dans cette fenêtre de taille M étant donné le mot cible."
        },
        {
            "start": 4126,
            "end": 4136,
            "text": "Et donc pour ça, je vais avoir une fonction objective qui va chercher à maximiser la log probabilité de chaque mot de contexte étant donné le mot cible."
        },
        {
            "start": 4136,
            "end": 4155,
            "text": "Donc j'ai ces probabilités d'un mot étant donné le mot cible, d'un mot de mot contexte, avec M qui est la taille de ma fenêtre, et puis je vais chercher à maximiser ça pour l'ensemble des mots à ma disposition, de mon corpus."
        },
        {
            "start": 4155,
            "end": 4166,
            "text": "Et donc ce que je cherche, c'est à trouver l'ensemble des variables qui vont me permettre de maximiser ça, et donc c'est ça que je cherche à optimiser."
        },
        {
            "start": 4166,
            "end": 4184,
            "text": "Donc ce qu'on fait généralement dans ces approches-là, c'est qu'on va transformer une valeur qui est dans RV à une distribution de probabilité au travers d'une fonction qui s'appelle une fonction softmax, et donc qui est définie de cette manière-là."
        },
        {
            "start": 4184,
            "end": 4200,
            "text": "Et donc si j'applique ça sur ce cadre-là, sur notre problème, je vais avoir une fonction softmax et donc une formulation pour notre problème qui va devenir celle-ci."
        },
        {
            "start": 4200,
            "end": 4206,
            "text": "Donc on voit qu'on prend bien en compte la similarité entre nos mots en faisant ça."
        },
        {
            "start": 4206,
            "end": 4215,
            "text": "Donc O et C ici, c'est les indices de mots de sortie et centraux, et puis U et V, c'est les U de O et V, c'est les vecteurs correspondants."
        },
        {
            "start": 4215,
            "end": 4224,
            "text": "Donc regardons plus en détail cette architecture d'apprentissage de représentation de mots par des approches neuronales."
        },
        {
            "start": 4224,
            "end": 4236,
            "text": "Donc j'ai la représentation de mon mot central, ici c'est l'entraînement système, donc représentation de type one-hot."
        },
        {
            "start": 4236,
            "end": 4245,
            "text": "J'ai une première matrice de taille D x V. D, c'est la taille de mon vocabulaire, c'est l'espèce de représentation de mes termes en one-hot."
        },
        {
            "start": 4245,
            "end": 4252,
            "text": "Et puis D, c'est la dimension que je souhaite pour mon vecteur dans mes digues."
        },
        {
            "start": 4252,
            "end": 4260,
            "text": "Donc avec des paramètres bien sûr que j'initialise, mais que je vais chercher à estimer."
        },
        {
            "start": 4260,
            "end": 4277,
            "text": "Et puis en sortie de la multiplication de cette représentation one-hot de mon mot et de la matrice, j'ai mon vecteur Vc, qui est mon vecteur dans mes digues que je cherche."
        },
        {
            "start": 4277,
            "end": 4288,
            "text": "Ce vecteur-là, je vais donc ensuite le remultiplier avec mes mots de contexte."
        },
        {
            "start": 4288,
            "end": 4302,
            "text": "Voilà, donc à nouveau j'ai une matrice de taille D x V, la taille de mon vocabulaire, donc avec ici les mots de mon contexte."
        },
        {
            "start": 4302,
            "end": 4330,
            "text": "J'en sorti le produit scalaire entre mon mot central et son mot de contexte, et je transforme ces valeurs-là en softmax, comme indiqué, qui me donne une estimation de la probabilité de x sachant c. Du fait que le mot x soit un mot de contexte de c, et puis que je peux mettre en relation avec ma vérité."
        },
        {
            "start": 4330,
            "end": 4360,
            "text": "Et donc avec le principe d'optimisation des réseaux de neurones, et notamment la descente de gradients, je vais pouvoir petit à petit apprendre les différentes points de ma matrice, et donc je vais pouvoir avoir en sortie la représentation distributionnelle, donc le plongement, le mot dans mes dignes, de mon mot de contexte, donc ici."
        },
        {
            "start": 4360,
            "end": 4374,
            "text": "Alors bien sûr, il y a plein d'applications de tout ça à l'AERI, notamment pour construire des représentations des requêtes et des textes selon ce formalisme, donc avec ces représentations de mots."
        },
        {
            "start": 4374,
            "end": 4390,
            "text": "L'idée c'est d'appliquer ça à chaque mot de la requête, chaque mot du texte, et puis après avec des fonctions d'agrégation, on obtient une représentation de la requête et une représentation du texte qu'on peut après mettre en correspondance avec tous les modèles qu'on a à notre disposition."
        },
        {
            "start": 4390,
            "end": 4394,
            "text": "Et puis il y a plein d'autres architectures qui utilisent ces mécanismes-là."
        },
        {
            "start": 4394,
            "end": 4406,
            "text": "Une slide qui montre l'ensemble des choses qui sont possibles, l'ensemble des architectures qui sont possibles et qui sont toutes plus complexes que les unes que les autres."
        },
        {
            "start": 4406,
            "end": 4412,
            "text": "Voilà, j'en ai fini sur ce cours, donc rapide bilan sur ce qui vous a été présenté."
        },
        {
            "start": 4412,
            "end": 4416,
            "text": "Donc un nouveau paradigme pour l'AERI au travers de cette approche Learning to Rank."
        },
        {
            "start": 4416,
            "end": 4435,
            "text": "Donc ça, j'avais déjà dit la dernière fois, des approches qui tentent d'exploiter toutes les informations à disposition, des résultats comparables à ceux des modèles probabilistes dans le cadre de collection classique et des résultats bien meilleurs quand on a des grosses collections pour lesquelles on est capable de construire des espaces d'attributs très riches."
        },
        {
            "start": 4435,
            "end": 4443,
            "text": "Et puis bien sûr, ce problème de disponibilité des données d'entrée, des données à noter pour mettre en place les techniques d'apprentissage."
        },
        {
            "start": 4443,
            "end": 4448,
            "text": "Voilà, des lectures conseillées pour compléter ce cours."
        },
        {
            "start": 4448,
            "end": 4466,
            "text": "Et puis je vous souhaite un bon lab qui vous demandera d'appliquer l'approche par paire d'une part et d'autre part, qui vous fera travailler justement sur cette partie d'ouverture, donc sur les représentations de mots par plongement lexico."
        }
    ],
    "text": "Bonjour, on attaque aujourd'hui la deuxième partie du cours d'apprentissage pour la recherche d'information. Je vais rapidement commencer par un rêve récapitulatif des notions introduites la dernière fois. La dernière fois, j'ai présenté un nouveau paradigme pour la recherche d'information qui est un paradigme basé sur de l'apprentissage qui s'appelle « Learning to Rank » où on a un jeu de données d'apprentissage qui est composé principalement de paires requêtes, documents, décrits caractérisés avec un vecteur caractéristique qu'il faut construire et puis des données de sortie, des labels qui sont des valeurs de pertinence. A partir de ces données d'apprentissage, on apprend une fonction qui va être une fonction d'ordonnancement ou un critère et puis cette fonction d'ordonnancement apprise, on l'utilise ensuite sur des données de test ou des données de production qui consistent uniquement en des données non labellisées. Bien sûr, on n'a pas la vérité de terrain pour ces données. Et puis sur ces données de test, on utilise la fonction F apprise pour prédire la pertinence et classer les résultats. En sortie, on obtient bien toujours une liste ordonnée de documents. Ce principe d'apprentissage pour l'AERI repose sur deux concepts principaux qui sont la notation des données et la représentation des couples requêtes-documents dans l'espace des caractéristiques. C'est vraiment une étape très importante qu'on appelle l'étape de description. Et puis la partie apprentissage en tant que telle avec une structure d'apprentissage classique en deux étapes. Une étape d'apprentissage de la fonction d'ordonnancement F, puis l'étape de test de production sur de nouvelles requêtes. On peut bien sûr aussi rajouter à ça une étape de validation qui, par exemple, pourrait consister à choisir les hyperparamètres du modèle. La dernière fois, il avait été aussi introduit le fait qu'il existait trois grandes familles d'approches dans ce paradigm learning to rank. L'approche par points, dont on a parlé la dernière fois, où les documents sont considérés de manière indépendante. L'approche par paire, dont on va parler aujourd'hui. Et l'approche par liste, qui va être aussi rapidement évoquée aujourd'hui. L'approche par points, c'est une approche qui consiste à transformer le problème de classement en un problème soit de classification, soit de régression, soit de régression ordinale. Selon le type des valeurs de pertinence qu'on a à disposition. Typiquement, si on a des valeurs de pertinence qui sont des nombres réels, on va se ramener à un problème de régression. Si on a des valeurs de pertinence qui sont des catégories, on va se ramener à un problème de classification. Et enfin, si on a des catégories ordonnées, on va se ramener à un problème de régression ordinaire. Donc voilà, on a notre vecteur caractéristique. Trois types de problèmes selon le type de valeur de sortie. On en déduit la fonction f2x, on apprend la fonction f2x, qui va être une fonction de classement. Ça c'est la phase d'apprentissage. Et pour la phase de classement en tant que telle, on a nos données qui sont décrites selon le même schéma de description. Et puis on va ordonner les vecteurs, les données, selon le score de cette fonction f. On va aujourd'hui introduire l'approche par paire, qui est une approche très développée, très utilisée dans le paradigme learning to rank, notamment parce qu'on va pouvoir facilement créer des jeux de données d'apprentissage, notamment pour les collections de type web. L'idée principale de l'approche par paire, c'est de travailler sur des paires de préférences. Cette idée, elle se base sur le fait que la notion de pertinence n'est pas une notion absolue. Plusieurs fois, tout au long du cours, on a évoqué cette difficulté à caractériser correctement, à définir correctement cette notion de pertinence, avec notamment d'ailleurs des définitions qui sont très dépendantes des modèles de recherche. Binaires pour le modèle booléen, probabilistes pour le modèle probabiliste, etc. Quand on a parlé de la partie évaluation des modèles de recherche, on a aussi évoqué le fait qu'il était difficile de juger de la pertinence d'un document, mais par contre qu'il était plus facile de juger de la pertinence relative de deux documents. Étant donné le résultat d'une recherche, la réponse d'un moteur de recherche à un besoin d'information, pour moi utilisateur, il va être plus facile de dire si le document N qui m'a été retourné est plus pertinent que le document N plus 1, que de juger de la pertinence de chacun des documents. C'est vraiment cette idée-là qui va être mise en œuvre dans l'approche par paire. On va travailler avec ce qu'on va appeler des jugements par préférence, et donc avec la notion de paire de préférence. Typiquement, ces paires de préférence vont exprimer le fait qu'un document va être préféré à un autre pour une requête donnée, pour un besoin d'information donnée. Ces jugements de préférence vont toujours être conditionnés par un contexte qui est la requête qu'on a soumise au moteur de recherche. Le principe, c'est de partir sur cette idée que les jugements par paire sont des jugements qui sont plus généraux, et donc d'exprimer ce jugement comme une préférence d'un document par rapport à un autre. Étant donné une requête Q, à chaque paire de documents DI, DJ, on va associer une valeur de préférence YIJ qui va être à valeur dans le moins 1. Et typiquement, on va dire que YIJ va être égal à 1 si XI est préféré à XJ pour la requête Q. Cette relation de préférence, on va la noter de cette manière-là, et donc typiquement, il faut lire cette équation comme XI est préféré à XJ pour la requête Q, toujours étant donné un contexte donné qui est ici notre requête Q. Voilà. Et donc, dans l'approche par paire, on va chercher à déterminer non plus le score de pertinence, mais quel document est plus pertinent qu'un autre. On va essayer de déterminer la préférence d'un document par rapport à un autre. Regardons de manière un peu plus détaillée comment on va pouvoir mettre ce principe en œuvre. L'élément fondamental, ça reste toujours ce couple, ou cette paire document-requête qu'on appelle XI, et donc on considère qu'on a N couples, N échantillons de paire document-requête. Ça, c'est notre ensemble d'apprentissage. Et ce qu'on souhaite trouver, c'est une fonction d'ordonnancement, c'est-à-dire qu'on souhaite trouver une fonction f qui va respecter l'ordre des X. Donc si XJ est préféré à XI, alors f de XJ doit être supérieur à f de XI. Donc, pour simplifier le développement, je vais considérer ici f qui est une fonction de classement linéaire, et donc que je vais pouvoir écrire comme ça. Ça, c'est le produit Scalar. En pratique, f, ça peut être tout type de fonction, mais vraiment pour plus facilement vous expliquer ce développement-là, on va considérer que f, c'est une fonction de classement linéaire. Pour f linéaire, j'ai donc, si f de XI est supérieur à f de XJ, alors j'ai bien cette relation d'équivalence. Donc ma fonction de classement linéaire, elle est positive dans ce cas-là pour la différence XI moins XJ. Donc pour f linéaire, j'ai bien cette relation d'équivalence. Je peux donc transformer mon problème de classement en un problème de classification binaire sur la différence des XI moins XJ. Et c'est comme ça, en fait, que va fonctionner l'approche par paire. Et ça, c'est ce qu'on appelle la transformation par paire. C'est-à-dire qu'on va former, à partir de nos données, des exemples d'apprentissage sous la forme de paires étiquetées en utilisant la différence entre deux couples, donc XI moins XJ. Et les étiquettes que je vais donner, typiquement, elles vont être binaires et je vais donner à une différence XI moins XJ la valeur de 1 si XI est préféré à XJ pour la requête Q. Et puis sinon, je lui donne la valeur moins 1. Voilà, donc j'ai bien ces relations d'équivalence, c'est-à-dire que si XI est préféré à XJ, alors YIJ est égal à plus 1. Et donc, j'ai bien ramené comme ça mon problème de classement en un problème de classification binaire. Donc, on va rapidement illustrer le principe de cette transformation par paire sur un petit exemple. Donc, on considère ici qu'on a deux requêtes. Donc ça, c'est les données qui correspondent à la requête 1 et ça, c'est les données qui correspondent à la requête 2. On a donc des données qui sont classées et qui sont classées selon une fonction de classement qu'on voit être linéaire. Voilà, typiquement, si on projette les données sur cette droite linéaire, sur cet hyperplan linéaire, on voit qu'on peut effectivement l'utiliser comme une fonction de classement. A partir de ces données, je vais donc appliquer ma transformée par paire en prenant donc l'ensemble des données associées à un contexte donné, donc à une requête donnée, et qui ont des rangs différents et en effectuant les différences par paire. Et donc là, typiquement, si je prends la paire X1, X2, alors je vais labelliser X1, X2 en plus 1 parce que X1 est préféré à X2 pour cette requête avec cette fonction de classement. Et de même, X2 va être préféré à X3 pour cette requête avec cette fonction de classement et donc je vais étiqueter X2 moins X3 à plus 1. Si maintenant je prends la paire X3, X1, je lui donnerai le label moins 1 parce que X3 n'est pas préféré à X1 pour cette requête avec cette fonction de classement. Et donc en appliquant cette fonction de transformation par paire à l'ensemble des données qui appartiennent à des rangs différents et à un même contexte, alors je transforme effectivement mon problème en un problème de classification binaire. Donc on voit ici, pour les mêmes données, le résultat de l'application de cette transformation. Donc on a bien ici nos instances positives et on a bien ici nos instances négatives et on voit sur cet exemple qu'on doit très certainement pouvoir trouver une solution à ce problème de classification en utilisant une technique de classification et notamment par exemple en utilisant des séparateurs linéaires. Voilà, donc juste des petites remarques, dans la constitution du jeu de données, on ne considère que les données d'un même groupe qui sont prises en compte pour les paires de différence et bien sûr, seules les données de rang différent dans ce même groupe sont prises en compte. Je ne fais pas, je ne construis pas de paire de différence en prenant des données qui sont de groupe différent, ça n'aurait pas de sens, c'est des données qui sont non comparables. Voilà, donc je vais juste terminer pour cette présentation de l'approche par paire en présentant une approche qui s'appelle Ranking SVM et qui se base sur les séparateurs à vaste marge pour proposer une solution à ce problème d'ordonnancement à l'aide de cette transformée par paire. Rapidement avant cela, je vais vous présenter ce que sont les séparateurs à vaste marge linéaires. J'avais rapidement commencé à présenter les SVM dans le cours précédent, notamment en présentant ces méthodes comme des méthodes de classification dites discriminantes. Donc on a des données d'apprentissage labellisées, donc X, Y et on va se placer dans un cadre de classification binaire, donc avec des labels qui peuvent prendre les valeurs moins 1 et plus 1. Et je cherche à construire à partir de cet ensemble d'apprentissage, donc une fonction de décision qui va donc de l'espace de représentation de mes données à moins 1 plus 1 et qui va permettre de prédire la classe moins 1 ou plus 1 d'un point X qui appartient à X, n'importe quel point X qui appartient à X. Voilà, ma fonction de décision, elle va de Rd dans R, Rd étant l'espace de description de mes données d'entrée. Et puis je peux utiliser le signe de cette fonction pour classer mes données. Donc typiquement, je vais affecter X à la classe moins 1 si f2x est inférieur à 0 et à la classe plus 1 si le signe de ma fonction de décision est supérieur à 0, appliqué à X bien sûr. Si on fait un bref rappel à la manière dont je vous ai présenté la théorie de l'apprentissage supervisé, j'avais évoqué le fait qu'on avait une classe d'hypothèses pour notre fonction f. Ici, cette classe d'hypothèses, c'est qu'on a des fonctions de décision qui sont linéaires et donc qui vont prendre cette forme analytique. Et ce que je vais chercher à déterminer, ce sont les paramètres de cette fonction, c'est-à-dire le vecteur W et B. Voilà, prenons un exemple simple, plaçons-nous dans R2 et prenons donc un problème de classification linéaire. Donc on a effectivement deux classes qui sont caractérisées ici par les croix rouges et les ronds bleus et je cherche effectivement une fonction de séparation dans cet espace R2 qui soit linéaire. On voit ici que les données, que le plan, je peux le séparer en deux par un hyperplan dont l'équation est WTX plus B. Si je prends le signe de cet hyperplan, ça me permet d'avoir une fonction qui va me permettre de classer mes différents points selon le signe que prend cette fonction quand je l'applique à mes données X. Ce qu'il est intéressant de voir, c'est que la distance d'un point à cet hyperplan, on peut l'exprimer avec cette équation. Notamment, on verra l'importance de cette notion-là un peu plus tard. Et puis la distance de l'hyperplan à l'origine, c'est la valeur absolue de B sur la norme de W. Si je reprends mon problème de séparation binaire dans un espace à deux dimensions, on voit qu'en fait j'ai plusieurs hyperplans qui sont possibles, plusieurs séparateurs qui peuvent être possibles. C'est-à-dire que cette droite-là va effectivement me permettre de séparer correctement mes données, celle-ci aussi et celle-ci aussi. Donc la question qu'il faut se poser ici, c'est quel est le séparateur qui va être optimal ? Le séparateur optimal, l'hyperplan optimal, ça va être celui qui va classifier correctement les données et qui se trouve le plus loin possible de tous les exemples. Et ça, c'est à des fins de généralisation. Cet hyperplan optimal, c'est l'hyperplan de marge maximale. La marge étant la distance minimale entre un exemple et l'hyperplan, et donc la surface de séparation. C'est donc cet hyperplan optimal que je vais chercher à déterminer. Voilà, juste quelques définitions. On parle de séparateur linéaire, donc il est nécessaire de définir ce que sont les données qui sont séparables linéairement. Et typiquement, on va dire que les couples XYI vont être linéairement séparables s'il existe un hyperplan qui permet de discriminer correctement cet ensemble de données. Dans le cas contraire, on va parler d'exemples qui ne sont pas séparables. Pour limiter l'espace des possibilités, on va considérer que les points les plus proches de l'hyperplan séparateur sont situés sur des hyperplans qu'on va appeler canoniques et qui sont définis par cette équation. L'équation WTX plus B est égale à 1 et WTX plus B est égale à moins 1. Dans ce cas, la marge, on peut la définir comme étant 2 sur la norme de W. Et d'autre part, les points vont être bien classés si, quels que soient I, donc pour tous les points de mon ensemble d'apprentissage, j'ai Y fois F de XI qui est supérieur à 1. Ça, c'est des contraintes, des conditions qui m'expriment que chaque point est bien classé par ma fonction F. Et en utilisant cette simplification, je peux cette fois-ci définir de manière beaucoup plus formelle ce que c'est que mon séparateur à vaste marge. Donc, étant donné un ensemble de points linéairement séparables et tiquetés, donc mon ensemble d'apprentissage qui contient N échantillons, l'objectif va être de trouver un hyperplan qui maximise la marge et qui discrimine correctement les points de D. Donc, la formulation mathématique du SVM, c'est celle-ci. Je cherche à minimiser selon WB 1 demi de la norme de W². Donc ça, c'est typiquement ce qui exprime le fait que je cherche à maximiser ma marge sous contrainte que l'ensemble de mes points de mon ensemble d'apprentissage soit bien classé. C'est ce qu'on exprime avec cette équation-là. Ça, c'est la formulation classique des séparateurs à vaste marge. Voilà, on a donc ici un problème de minimisation sous contrainte qu'on peut résoudre par des approches numériques comme de la programmation quadratique, par exemple en minimisant le carré de la norme. Je ne vais pas rentrer dans les détails de résolution de ce type de problème d'optimisation. Ce que je peux vous dire, c'est qu'en fait pour les SVM, on va faire un passage au lacrangé, c'est-à-dire qu'on va utiliser la forme duale de ce problème d'optimisation précédent. On sait qu'un problème d'optimisation, il possède une forme duale si la fonction objectif et les contraintes sont strictement convexes et alors dans ce cas là la solution du problème dual est la solution du problème original. Donc on utilise cette propriété là pour la résolution des séparateurs à vaste marge. Et notamment on va donc passer au lagrangien, en introduisant dans le problème d'optimisation des multiplicateurs de Lagrange αi qui sont donc associés aux différentes contraintes d'inégalité qui expriment que l'ensemble des points de mon ensemble d'apprentissage doivent être bien classés. Donc du coup j'introduis dans mon problème, dans la formulation de mon problème, n paramètres αi. Et donc la formulation de mon problème en passant au lagrangien ça devient celle-ci. Donc j'ai cette fonction objectif qui devient celle-ci avec donc les paramètres, le paramètre W, B, α et donc cette fonction objectif ici qui est donc je cherche à maximiser ma marge avec donc les contraintes que l'ensemble des données de mon ensemble d'apprentissage doivent être bien classées. J'exprime exactement la même chose. Donc j'ai une nouvelle formulation du problème en fait où la contrainte elle est directement intégrée dans la fonction objectif et donc ça devient intéressant. Voilà, pour la résolution des SVM il est important d'introduire des vecteurs particuliers qui sont ce qu'on appelle des vecteurs supports. Donc W1 je peux le définir comme étant la somme sur l'ensemble de mes données d'apprentissage de αi, yi, xi. Je sais que αi est nulle si yi fois Wtxi plus B est supérieur à 1. Donc W il n'est défini que par les points tels que j'ai cette équation là qui est égale à 1. Et ces points là c'est mes vecteurs supports, ce sont ces points là. Ces points qui finalement appartiennent au plan canonique qu'on a introduit plus en avant. Voilà, donc en pratique les SVM on calcule W, on cherche finalement les valeurs, on estime W en utilisant les données d'apprentissage pour résoudre le dual, donc le Lagrangien. Et en faisant ça on obtient les paramètres αi. A partir des αi j'en déduis donc l'estimation de mon vecteur W avec cette équation là. La somme pour l'ensemble de mes données d'apprentissage de αi, xi, yi, xi. Puis je peux du coup calculer B en prenant en compte le fait que les αi qui sont supérieurs à 0 correspondent aux points supports qui vérifient donc cette relation. Et donc je peux en déduire comme ça la valeur de B. En pratique je fais la moyenne de ces termes pour l'ensemble des vecteurs supports SV pour obtenir une valeur numérique qui est stable. Et donc j'obtiens ma fonction de décision que je peux exprimer comme ça, qui est donc la somme pour l'ensemble des vecteurs supports de αi, xi, xi, t, x. J'ai ici un produit scalaire en fait, je pourrais aussi l'exprimer avec l'autre notation des produits scalaires, plus B. Donc tout ce qu'on a vu c'est assez joli, mais ça ne marche que si on a des données qui sont séparables linéairement. Or dans la vraie vie les données elles sont rarement séparables linéairement. Il n'y a pas de raison qui fait que les données sont séparables linéairement pour énormément de problèmes. Et donc on va voir comment on peut étendre les séparateurs à basse de marge au cas non séparable. Donc typiquement comment on va pouvoir modifier la formulation quand justement l'hypothèse de séparabilité linéaire des points n'est pas vérifiée ? Voilà, typiquement dans ce genre de cas là, les points blancs qui sont ici et les carrés verts qui sont ici font qu'on n'a pas des données qui sont séparables linéairement. Dans ce cas là, on va relâcher les contraintes qui expriment le fait que les points sont bien classés. Donc ces contraintes là, et on va rajouter dans ces contraintes des variables de relâchement εi. Et puis bien sûr on va pénaliser ces relâchements dans la fonction objectif. Et donc on obtient une nouvelle formulation des SVM dans le cas non séparable qui est celle-ci. Donc on cherche toujours à maximiser notre marge, à trouver les valeurs des paramètres W et B qui maximisent notre marge, sous contrainte relâchée que les points sont bien classés. Donc là on introduit nos variables de relâchement qu'on pénalise dans la fonction objectif, ici. Et donc ce C là, c'est une contrainte de régularisation justement liée à cette pénalisation des variables de relâchement, qui est un hyperparamètre des SVM. Et puis on a encore un cas qui est un peu plus compliqué, qui est le cas où la séparation n'est pas linéaire. Et donc on voit bien qu'ici la droite qui sépare, la fonction qui sépare nos points, qui sont séparables, mais cette fonction là n'est clairement pas linéaire. Comment on peut traiter ce cas ? Donc on va prendre un exemple aussi joué, un exemple synthétique qui est celui-là. On voit qu'effectivement on a des données qui sont dans un espace en deux dimensions, qui ne sont pas séparables linéairement. Et pour traiter ce problème-là, avec les SVM, on va utiliser une astuce qu'on appelle l'astuce des noyaux. Typiquement, on va étendre notre problème à un cas où les données vont être séparables linéairement. Ça c'est une extension justement des SVM à des séparateurs non linéaires. Et pour ça, on va transposer les données dans un autre espace, dans lequel les données vont être cette fois-ci linéairement séparables. Donc on va appliquer à nos données une transformation qui va de Rd dans H, un espace de Hilbert. Cette transformation, c'est le phi ici, qui est telle qu'on part d'un espace de départ dans lequel les données ne sont pas séparables linéairement, vers un espace d'arrivée où elles le sont. Voilà, si on revient à notre exemple, on a bien un espace initial à deux dimensions dans lequel il n'est pas possible de séparer linéairement nos données. Et donc je dois choisir une transformation phi qui doit permettre une séparation linéaire dans un nouvel espace H. Ici, je peux par exemple prendre cette transformation phi, qui dépend donc de X1 et X2, et qui transforme mes données dans un espace à trois dimensions, avec X1, X2 et X1² plus X2². Si je trace mes données dans ce nouvel espace, qui est un espace à trois dimensions, qui est un espace de plus grande dimension que l'espace original, on voit qu'ici j'ai effectivement une possibilité de séparer mes données par un séparateur linéaire. On voit qu'on a effectivement un hyper-séparateur. C'est vraiment cette idée-là qu'on veut mettre en place pour utiliser les séparateurs à vaste marge quand on a des cas de séparation non linéaire. Ce qui est compliqué, c'est finalement le choix de cette transformation, le changement de représentation, comment je peux faire. On souhaite avoir un changement de représentation qui va permettre une séparation linéaire entre nos deux classes, tout en respectant bien sûr la vraie similarité entre les données. En général, ça veut dire que je dois trouver ce qu'on appelle un espace de redescription de plus grande dimension. Les questions, c'est comment je peux faire ça ? Je peux faire ça par exemple par un séparateur linéaire, je dois trouver ce qu'on appelle un espace de redescription de plus grande dimension. Les questions, c'est comment je peux trouver cet espace de redescription et comment je peux garantir la réalisation des calculs ? Pour ça, c'est là qu'il y a vraiment l'astuce des fonctions noyaux, qui fait qu'on va éviter de calculer explicitement la transformation Φ, et on va plutôt s'appuyer sur des fonctions particulières qui sont des fonctions noyaux. Plutôt qu'appliquer la transformation de changement de représentation, on va définir une fonction noyau K, telle que K de XI, XJ, c'est égal au produit scalaire de la transformée de XI et de la transformée de XJ. Ce produit scalaire dans l'espace de redescription. Je cherche une fonction K qui correspond au produit scalaire dans mon espace H, qui est mon espace de redescription. Il y a des travaux théoriques qui prouvent que de telles fonctions existent. C'est notamment le théorème de Mercer qui dit qu'une fonction noyau K continue symétrique et semi-définie positive peut s'exprimer comme un produit scalaire dans un espace de plus grande dimension. En utilisant cette fonction noyau, la fonction de décision dans l'espace d'origine devient celle-ci. La somme pour Y qui appartient au vecteur support de αI, YI, la fonction noyau appliquée à XI, X, plus P. On appelle la fonction noyau toute fonction K, qui va de mon espace originelle dans R, et qui peut être interprétée comme un produit scalaire dans un plongement Φ. Le gros avantage, c'est qu'on peut maintenant appliquer tous les algorithmes qu'on a vus précédemment de séparation optimale avec marge souple ou dure, donc avec les contraintes de relâchement, en remplaçant le produit scalaire entre XI et XJ par la fonction noyau K de XI, XJ. J'obtiens ainsi un classifieur exprimé comme ça, et qui est lui linéaire dans l'espace de plongement. Il existe énormément de travaux sur des fonctions noyaux, il existe énormément de fonctions noyaux, par exemple les noyaux polynomials, le noyau gaussien, le noyau sigmoïde, etc. Le choix du noyau est très important dans la mise en œuvre des SVM, parce qu'il doit maximiser les chances d'être dans le bon espace. Ça fait aussi partie des hyper paramètres des SVM, le choix du noyau. Enfin, si je veux en finir avec les SVM, je dois parler du cas où on a plusieurs classes. On n'a parlé ici que des SVM dans le cadre binaire, c'est un problème de classification binaire. Comment transformer tout ce qu'on a vu précédemment, ou comment l'adapter à un cas où j'ai plusieurs classes ? Ici, je n'ai plus deux classes, mais j'ai ces classes CI, et donc typiquement, telle que c'est, et plus grande que 2. Il y a plusieurs stratégies pour appliquer les SVM au cadre multiclasse. Il y a une stratégie qui s'appelle le one versus all. Ça consiste à prendre pour une classe CI ses exemples positifs, et de ramener un problème de classification binaire en prenant tous les exemples des autres classes CI différents de I qui valent moins 1. Je me ramène ainsi un problème de classification binaire. Je vais apprendre ces classifiers binaires. Pour faire mon classement, je vais retenir la classe qui a le plus fort score comme classe pour mes données. Une autre stratégie s'appelle le one versus one. Cette fois-ci, je vais prendre les exemples positifs d'une classe I1 et les exemples négatifs d'une classe I2. Je vais apprendre de cette manière ces fois-ci moins 1 sur 2 classifiers binaires. Il faut bien sûr que je fasse s'affronter mes différents classifiers. Je vais mettre en place un processus de tournoi et je vais voter pour chaque classifier. Une classe va gagner à chaque fois. En agrégeant mes votes, je vais obtenir le vainqueur et la classe que je vais pouvoir affecter à mes données. Un petit bilan sur les SVM. C'est une approche d'apprentissage qui est relativement puissante et qui est capable de trouver des motifs non linéaires. C'est intéressant avec deux idées principales. Cette maximisation de la marge entre la frontière de décision et les exemples les plus proches, qui sont les vecteurs supports. Et puis l'astuce des noyaux avec une redescription des observations dans un nouvel espace où une séparation linéaire sera possible dans le cas où elle ne l'est pas dans l'espace originel. Et puis pour finir, une extension facile au cas multiclasse. Après cette grosse parenthèse sur les SVM, je peux revenir à mon problème d'ordonnancement avec l'approche de transformer par paire. Et donc vous présenter la méthode ranking SVM. Typiquement, je peux directement utiliser cette méthode des SVM pour trouver un hyperplan séparateur de mes données générées en appliquant la transformée par paire. Mes données d'apprentissage, c'est ppaire x1, x2, labellisées comme présentées précédemment. La formulation de ce problème en utilisant les SVM devient celle-là. Je cherche à maximiser ma marge. Ici, c'est la formulation avec des marges souples, avec mes contraintes de relâchement. Sous contrainte que mes ppaires d'apprentissage, exprimées comme la différence de mes paires originelles, soient bien classées, avec mes contraintes de relâchement, etc. Je sais résoudre ce type de problème avec des techniques d'optimisation. La solution du problème me donne une solution optimale, qui est finalement l'estimation de W. Comment je peux classer ? Je sais que x' est préféré à x si et seulement si le signe du classifiaire est négatif. Si le signe de W étoile x-x' est négatif. Je pourrais classer en utilisant cette équation et ce mécanisme. On va directement utiliser le score du modèle qu'on vient d'apprendre. Cela répond aussi à la deuxième question, qui est comment trier les documents pour de nouvelles requêtes. Pour chaque requête, je vais considérer mon x' qui vaut le vecteur nul, et je vais trier le document sur le score obtenu directement par la fonction W étoile x-x'. Ce score obtenu est celui-là, avec x qui est toujours une paire document requête. Cela ne change pas, c'est toujours l'élément principal de ces approches Learning to Rank. Il y a bien sûr plein d'autres approches pour faire des stratégies Learning to Rank à partir de l'approche par paire, que je ne présenterai pas ici, mais juste pour résumer l'approche par paire. On a des données d'entrée qui sont des données ordonnées, mais de paire de vecteurs. On considère les documents par paire et pas les documents indépendamment comme dans l'approche par point. Je me ramène à un problème de classification binaire avec l'approche de transformer par paire. J'apprends ce classifieur qui, en utilisant son score, va me permettre de faire le classement. J'ai ici une fonction de coût paireoise de classification. Pour le classement, j'ai juste à trier les valeurs de sortie de mon classifieur. Je peux donc proposer à l'utilisateur une liste ordonnée de documents, que j'évalue avec les mesures d'évaluation classique d'ordonnancement. La dernière approche possible pour l'apprentissage par ordonnancement, c'est l'approche par liste. Le principe est simple, c'est de traiter directement les listes triées comme des exemples d'apprentissage. Directement d'apprendre à partir de listes triées. Pour ça, il y a deux types d'approches. Il y a des approches qui ont dans leur fonction objectif des éléments liés aux mesures d'évaluation. Par exemple, il y a une approche qui s'appelle SVM Map, qui utilise des vecteurs SVM. La fonction objectif est la borne supérieure de la mesure d'évaluation Map, le mean average precision, dont on a parlé pendant le cours d'évaluation. Il y a aussi des fonctions objectives qui sont directement définies sur des listes de documents. C'est compliqué ces mesures-là, parce qu'en général, on est sur des mesures d'évaluation non continues. On rentre dans des problématiques de différenciabilité et ça devient un peu compliqué. Je ne présenterai pas d'approche très détaillée sur cette approche par liste, parce que chaque approche nécessiterait de gros développements. Le petit bilan sur les approches par liste, avec un même mécanisme pour l'apprentissage et le classement. On fait une permutation sur cette fonction F, et on a donc une fonction de coût qui est la même pour l'apprentissage et le classement. Parce que typiquement, on s'appuie sur les mesures d'évaluation de classement pour construire cette fonction de coût. On a vu que quand on est dans des approches à base d'apprentissage, il est nécessaire d'avoir des données d'apprentissage. La question c'est, quelles sont les données d'apprentissage à disposition pour mettre en œuvre ce type d'approche ? Il existe un certain nombre de données de benchmark qui sont disponibles. Il y a des données qui sont annotées pour plusieurs collections, notamment les collections TREC, qui sont les challenges classiques en évaluation dans la recherche d'informations, clé pour tout ce qui est multilinguisme. NTCIR, c'est plutôt des données médicales. Les TOR, qui sont vraiment des données qui ont été mises à disposition pour les paradigmes Learning to Rank. Et puis, il y a Yahoo qui a aussi mis à disposition beaucoup de données. Pour les entreprises, c'est un peu plus compliqué parce qu'on n'a pas de telles données en général, et il faut pouvoir les constituer. Dans le cas du web, c'est un petit peu différent parce qu'on a une information très riche qui provient du clic des utilisateurs. Et à partir de cette information de clic, on peut inférer des préférences entre documents, et donc on peut inférer très facilement des paires de préférences. C'est pour ça que l'approche par paire est très développée dans les approches d'apprentissage pour l'ARI, et notamment dans le contexte du web. Alors, il faut faire attention bien sûr parce que les clics, ils ne fournissent pas de jugement de pertinence absolue mais relatif, et donc c'est ce qu'on veut pour l'approche par paire. Et donc typiquement, il y a énormément de stratégies qui peuvent être mises en place pour constituer ces données d'apprentissage. Donc considérons un ordre D1, Dn par exemple, et c'est un ensemble de documents cliqués. Alors, on pourrait par exemple utiliser cette stratégie pour construire un ordre de pertinence entre documents. Donc si un document Di appartient à C et que Di n'appartient pas à C, forcément Di est préféré pour la requête Q à Di. Voilà, si Di c'est le dernier document cliqué, et quel que soit J qui est inférieur à I, alors Di n'appartient pas à C, alors Di est préféré à Dj pour la requête Q. Et puis, etc etc. On peut mettre en place énormément de stratégies comme ça pour construire des ordres de pertinence entre documents. Voilà, alors il faut être quand même vigilant avec ça, et avec l'exploitation des clics comme substitut de pertinence, parce que c'est fortement biaisé. Voilà, typiquement prenons un exemple, avec la requête à Implicit Feedback in Information Retrieval, l'utilisateur clique sur le premier document. Est-ce que pour autant on peut dire que le premier document est plus pertinent que le deuxième pour ce besoin d'information ? C'est très discutable. Voilà, de même, un utilisateur ne clique pas sur un des premiers documents. Est-ce qu'on peut pour autant dire que le deuxième est beaucoup plus pertinent que le premier ? C'est pareil, c'est très discutable. Et c'est des choix d'interprétation des clics, qui sont des choix de conception. Le clic, ça peut être aussi un élément de pertinence très bruté. Par exemple, ici, j'ai toujours la même requête, Implicit Feedback in Information Retrieval, mais parce que mon moteur de recherche n'est pas très bon, il me renvoie cette liste d'images, je me demande pourquoi, ça m'interroge, ça attire ma curiosité, je clique. Prenons aussi un autre cas qui est difficile à interpréter, où cette fois-ci, ma requête, c'est la capitale de Londres. Donc, je vais me demander pourquoi, je vais me demander si je peux me faire un lien avec ce document, je vais me demander si je peux me faire un lien avec ce document, je vais me demander si je peux me faire un lien avec ce document, je vais me demander si je peux me faire un lien avec ce document, où cette fois-ci, ma requête, c'est la capitale de Londres. L'utilisateur, fois ces résultats-là, il quitte son aviateur. On pourrait interpréter ça comme, il n'est pas satisfait des résultats du moteur de recherche. Le problème, c'est qu'il va exactement avoir le même comportement pour cette requête-là et ces résultats-là. Pourquoi ? Parce qu'il a directement la réponse à sa question. Et donc, on voit bien toute la difficulté, finalement, qui est liée à l'analyse des clics et notamment à l'analyse des clics comme substitut de cette notion de pertinence. C'est juste des petits exemples pour vous montrer à quel point tout cela est forcément bruité et à quel point ça peut introduire des biais et même des erreurs dans l'exploitation des clics, justement pour l'amélioration des moteurs de recherche. Voilà, juste pour en finir sur les jeux de données, une rapide présentation du jeu de données Lettor, qui est un petit peu le jeu de données qui est devenu très standard pour l'évaluation des algorithmes d'ordonnancement. C'est un jeu de données qui a été proposé par Microsoft Research avec un certain nombre de collections proposées dans le jeu de données. Et puis, il y a eu énormément d'autres initiatives, notamment Yahoo qui a proposé un challenge autour de l'apprentissage pour l'ordonnancement, et puis ensuite Microsoft, avec des jeux de données à chaque fois de plus en plus gros. Voilà, donc juste des ordres de grandeur, donc Lettor, on a une dizaine de jeux de données avec à chaque fois un certain nombre de requêtes et pour chaque requête, un certain nombre de documents associés, soit exprimés sous paires, soit donnés comme une liste de documents pertinents ordonnés. Et puis aussi un certain nombre de variables descriptives des données. Voilà, typiquement dans Lettor, on a chaque paire de données requêtes documents et définies selon un certain nombre de variables, dont ces 37 là, donc qui sont typiquement les caractéristiques qu'on utilise, que vous avez essayé d'utiliser dans le Lab 1 pour caractériser aussi vos données d'apprentissage. Alors, il y a un problème dont on n'a pas vraiment trop parlé jusqu'à maintenant, qui est un problème de réduction de la dimension et qui est nettement lié au fait que l'ensemble de nos vecteurs caractéristiques sont décrits dans un espace de très grande dimension, un espace qui est engendré par le vocabulaire de termes, donc avec autant de termes dans le vocabulaire en fait que de dimensions dans l'espace de représentation. Et donc, il peut se poser un certain nombre de questions pour essayer de réduire cet espace de représentation. Et notamment, on peut faire ça en utilisant énormément de techniques de sélection de variables. Donc l'objectif, c'est de réduire la grande dimensionnalité de l'espace de représentation des documents. Avec plusieurs approches, il y a des approches qui consistent à faire du seuil sur la mesure des f, où typiquement on va supprimer les termes qui ont une faible fréquence dont on peut penser qu'ils ne sont pas informatifs pour une classe de données. Donc ça, c'est des choses qu'on va beaucoup utiliser quand on est dans un cadre, par exemple, de catégorisation de documents. Et puis, il y a d'autres mesures qui se basent plutôt sur des mesures d'estimation de l'information, avec notamment la mesure d'information mutuelle ponctuelle, qui consiste à estimer l'information que la présence d'un terme apporte à la classe C et apporte à la catégorisation de cette classe. Et puis, l'information mutuelle qui s'intéresse à la présence et l'absence de termes et ce qu'ils apportent sur la catégorisation de la classe. Donc, je ne détaillerai pas ces approches ici, mais vous avez une version détaillée des slides sur Edunao. Voilà, et j'aimerais juste terminer ce cours par une petite ouverture et justement, qui traite de cet aspect relatif à la représentation de l'information. Donc, on a utilisé jusqu'à maintenant des représentations vectorielles et donc sur un espace qui est engendré par le vocabulaire de termes, avec comme dimension la cardinalité du vocabulaire de termes. Donc, voilà, on peut représenter le document de manière binaire en termes de présence ou absence des termes de ce vocabulaire. On peut aussi représenter un terme de cette manière-là, c'est-à-dire que le terme sur l'espace engendré par le vocabulaire de termes, il a une représentation de l'espace. Il a une représentation one-hot, donc il y a 1 pour la dimension qui correspond au terme et 0 pour les autres dimensions. Et puis, bien sûr, tout ça, on peut le représenter avec de la pondération, en avis à quel point la pondération était importante en recherche d'informations. Voilà, alors il y a des grosses limitations à ce type de représentation et notamment, en fait, très liées à la compréhension, l'étude fine de la langue et ce qu'on pourrait en faire en recherche d'informations. Et notamment, il est très difficile de traiter des problèmes de polysémie et de synonymie avec ce type de représentation. Ce type de représentation, elles font toujours l'hypothèse que les mots sont indépendants, alors on sait bien que les mots ne sont pas indépendants. Et puis, finalement, ce ne sont pas des représentations qui arrivent à capter réellement la sémantique d'un mot. Voilà, et donc, on pourrait vouloir essayer d'améliorer ces représentations des mots et donc des documents en essayant de trouver des représentations qui portent un peu plus la sémantique des mots. Par exemple, pour faire de l'expansion de requêtes en prenant en compte cette sémantique. Supposons que vous cherchiez à faire une requête jaguar, est-ce qu'on parle de jaguar la voiture, est-ce qu'on parle de jaguar animal ? Voilà, c'est typiquement ce type de sémantique qu'on aimerait capter et associer aux mots. Donc, l'expansion de requêtes, c'est une technique de recherche d'informations qui a principalement comme objectif d'augmenter le rappel des systèmes de recherche. On va typiquement étendre la requête en utilisant un certain nombre de ressources globales qui sont non-dépendantes de la requête. Alors, il y a trois approches principales, des techniques d'expansion de requêtes avec des thésaurus existants, donc par exemple WordNet ou PuMed, une expansion avec une génération automatique de thésaurus, et puis il y a aussi, bien sûr, des expansions de requêtes de l'ordre de la correction orthographique dont on ne parlera pas ici. Voilà, donc le principe, c'est que chaque terme de la requête va pouvoir être étendu avec des synonymes ou des termes qui sont sémantiquement proches en utilisant un thésaurus. Donc, on va voir justement comment on peut capter ces termes sémantiquement proches avec donc différentes approches. Donc, la notion de thésaurus, elle est multiple. Soit on a des thésaurus manuels qui sont maintenus par des thésaurus, soit on a des thésaurus manuels qui sont maintenus par des éditeurs, comme par exemple PuMed ou WordNet. Soit on peut dériver automatiquement des thésaurus à partir notamment de statistiques de co-occurrence entre mots sur une collection. Donc, on prend en compte aussi le contexte des mots dans une collection. Et on peut aussi, bien sûr, utiliser l'analyse des logs des requêtes et en faisant de la reformulation de requêtes en utilisant les requêtes qui ont été formulées par d'autres utilisateurs. Donc, si je pars d'un thésaurus existant, automatiquement, ce qui est fait dans le site PuMed, qui est un site qui permet d'accéder à des articles médicaux, ou voilà, si je fais une requête cancer, automatiquement, ma requête va être étendue avec les termes néoplasme et cancer, qui sont en fait des mots d'une ressource terminologique qui s'appelle MeSH, et qui sont donc des termes qui sont beaucoup plus médicaux. Je peux aussi utiliser WordNet. Alors, WordNet, c'est quoi ? C'est une ressource lexicale, qui est certainement la ressource lexicale qui est la plus utilisée en traitement du langage naturel. Elle est développée à Princeton depuis 1985. Et en gros, elle est constituée de ce qu'on appelle un ensemble de synsets, qui est en fait un groupe de sens ou des synonymes. Et ces synsets, ils sont reliés entre eux par des relations lexicales et sémantico-conceptuelles. Donc, c'est une vraie grosse ressource lexicale qui est intéressante et qui a été portée en plusieurs langues. Et elle a aussi l'avantage d'être disponible dans NLTK. Donc voilà, par exemple, prenons une requête dog. Voilà, j'importe NLTK et j'importe WordNet. Et je demande finalement d'accéder à l'ensemble des synsets qui sont associés au terme dog. Voilà, on voit qu'il y en a un certain nombre de synsets qui sont associés au terme dog, dont tous ceux-là. Et on voit qu'on a une définition associée. Et donc, du coup, je peux tout à fait utiliser cette définition pour faire de l'expansion de requête. Typiquement, je peux aussi prendre un ordre dans les synsets qui me sont renvoyés, qui sont des ordres de fréquence, dans ce mécanisme d'expansion de requête. Je peux aussi vouloir créer mon propre thésaurus de co-occurrence en faisant de l'analyse de la distribution des mots dans un document. Typiquement, ça se base sur une similarité des mots qui est beaucoup plus contextuelle que réellement sémantique. C'est-à-dire qu'on va prendre en compte une similarité, on va considérer que deux mots sont similaires s'ils co-occurrent avec les mêmes mots. Typiquement, voiture et moto sont similaires parce qu'ils vont co-occurrer très souvent dans un corpus avec les mots route et essence, qui n'est pas tout à fait la même chose que la similarité quand ils co-occurrent avec la même relation grammaticale. Et donc, ce théausaurus de co-occurrence, en fait, on peut le construire avec des outils dont on a déjà parlé, notamment à partir de la matrice d'incidence terme document, ou WIJ, c'est le poids normalisé pour le terme TI dans le document DJI. Si je construis la matrice de co-occurrence C en faisant A fois la transformée de A, eh bien, j'obtiens donc ma matrice de co-occurrence et pour chaque terme TI, je peux prendre les termes qui sont maximum dans C, bien sûr en utilisant ce que j'obtiens avec les points. Et voilà, par exemple, ce que je peux obtenir sur un exemple donné, qui sont donc les termes qui co-occurrent avec un certain nombre de mots donnés en utilisant cette approche. Et typiquement, je pourrais du coup faire de l'expansion de requêtes en utilisant ces plus proches voisins dans mon théaurus de co-occurrence. Par exemple, lithogra, je pourrais l'étendre avec drawing, Picasso, Dali, etc. On voit que du coup, avec cette approche, la qualité des associations est souvent discutable. En plus de ça, on a souvent une matrice qui est fortement creuse, on avait déjà le problème avec la matrice terme incidence, et du coup, l'imbiguïté des termes peut quand même introduire de mauvaises associations entre nos termes. Et donc, on va essayer de trouver une nouvelle approche, et notamment, l'approche, elle va consister à essayer d'apprendre directement les relations entre les termes. Donc, revenons à notre problème de la relation entre termes. La représentation des termes. Nos termes, ils sont considérés comme des symboles atomiques. Chaque terme, c'est une dimension, et donc, on l'a vu avec une représentation de type ouanote. Voilà, prenons par exemple le terme motel et le terme hôtel, et leur représentation ouanote. Supposons que notre requête contienne le terme motel, et que les documents qui sont dans notre corpus ne parlent que de termes hôtel. Et bien, typiquement, c'est l'inverse ici, mais si j'ai une requête sur hôtel et que le document parle de motel, alors avec les principes de recherche qu'on a mis en œuvre, qui font appel, du coup, au produit scalaire, je vais forcément avoir une similarité qui va être nulle entre ma requête et mon document. Donc, c'est vraiment ce problème-là, en fait, qui est limitant et pour lequel on aimerait apporter une solution. Et typiquement, ce qu'on aimerait, c'est avoir une meilleure représentation de nos termes. Donc, l'idée, ça va être d'apprendre une représentation qui va être de plus petite dimension d'un mot donné, d'un terme, donc dans RD, et telle que cette représentation U, elle soit telle que UTV représente la similarité entre mots. Donc, le principe, ça va être de représenter chaque mot par ce qu'on appelle un vecteur distributionnel. Et donc, en gros, on va représenter un mot à l'aide de ses voisins. C'est pour ça qu'on appelle ça un vecteur distributionnel. Et donc, ça, ça utilise un principe qui est un principe qui date des années 50, qui a été énoncé par First, et qui dit qu'on peut connaître la compagnie, qu'on peut connaître, pardon, qu'on peut connaître un mot par la compagnie de ce mot-là. Voilà, donc on va aussi, du coup, mettre en place dans ce mécanisme de similarité distributionnelle de la similarité entre vecteurs. Et donc, l'hypothèse, c'est que le sens d'un mot inconnu, il va être devinable par son contexte, et que le contexte va bien sûr aider à caractériser le sens du mot. Et puis, la similarité de contexte va aider à caractériser la similarité de sens. Voilà, donc ça, c'est ce qu'on appelle la similarité distributionnelle, qui consiste à représenter un mot par ses voisins. Donc typiquement, l'idée, c'est ça. Si je veux caractériser banking, eh bien, je veux utiliser les voisins de banking pour caractériser justement le mot banking. Et inversement, je peux caractériser le contexte d'un mot à partir du mot du même. Ça, c'est vraiment une des idées clés pour les mots de la compagnie. Ça, c'est vraiment une des idées clés du traitement du langage naturel moderne, et c'est notamment ce qu'on appelle les techniques d'embedding de mots, type Word2Vec, GloVe, etc., et puis les modèles de langues plus récents, préentraînées, de type BERT, par exemple. Voilà, alors la question, c'est comment représenter un mot par ses voisins. Et donc, pour ça, on va utiliser une représentation dense de plus petite dimension. L'idée, c'est que le nombre de sujets couverts dans un corpus, il est petit, et l'idée, ça va être de stocker l'information la plus importante dans ce petit nombre de dimensions. Donc, on retombe sur un problème de réduction de la dimension. Alors, comment on peut représenter un mot par ses voisins ? L'approche classique, c'est d'utiliser une matrice de co-occurrence. On l'a parlé juste avant. Après, il y a deux options. Soit je prends en compte tout le document, soit je prends une fenêtre autour de chaque mot. Si je prends en compte tout le document, je vais tomber sur des problèmes qui sont connus comme des problèmes d'analyse en sémantique latente. Et si je prends une fenêtre autour de chaque mot, ben, je suis typiquement dans ce qu'on fait en analyse distributionnelle. Prenons un petit exemple avec une fenêtre de taille A. Donc, j'ai un petit corpus qui est celui-là, donc avec un ensemble de termes qui sont I like, deep learning, NLP, enjoy flying, et puis le point. Et puis, comme j'ai une fenêtre de taille 1, ben, je vais construire du coup ma matrice de co-occurrence. Donc, I n'est jamais voisin de I. I est voisin de like deux fois. I like, I like. I est voisin de enjoy une fois. I n'est jamais voisin de deep, etc. Vous avez compris comment on construit cette matrice de co-occurrence avec un voisinage de taille 1. Donc, j'ai comme ça la représentation d'un mot par ses voisins, donc avec cette matrice de co-occurrence. Après, on peut se poser des questions sur cette représentation, notamment sur son passage à l'échelle, parce qu'on va avoir une taille de la matrice qui va croître avec le vocabulaire. J'ai une matrice qui est non dense, et donc l'idée, ça va être d'essayer de stocker l'information qui est contenue dans cette matrice dans un nombre fixé plus petit de dimensions. Notamment, on estime qu'entre 25 et 1000... 1000 dimensions, c'est très bien. Et donc on va essayer d'utiliser sur cette matrice de co-occurrence des techniques de réduction de la dimension. Alors, une technique de réduction de la dimension qui est assez adéquate pour ce problème, c'est la décomposition en valeur singulière. On sait que toute matrice A de dimension m fois n, avec m qui est supérieur à n, on peut la décomposer de la manière suivante. A, c'est U, sigma, transposé de V, avec U qui est de dimension m fois m unitaire, telle que U, T, U c'est la matrice identité, sigma qui est une matrice m fois n diagonale avec des coefficients réels positifs, donc les sigma 1 supérieur à sigma 2, etc. Et puis V qui est de dimension n fois n et qui est aussi unitaire. Et puis les sigma i, en fait, ce sont ce qu'on appelle les valeurs singulières de la matrice A. Voilà, donc une illustration de cette décomposition en valeur singulière. Pour une matrice X qui est ici de taille V fois V, cardinal de V étant la taille de notre vocabulaire, j'ai cette décomposition avec cette première matrice U de taille cardinal V fois cette matrice diagonale, avec les sigma 1 qui vont être les valeurs singulières, et puis donc la matrice V. Donc les valeurs singulières de X sont les racines carrées des valeurs propres de X, T, X. Les colonnes de V, les valeurs singulières droits de X, c'est les vecteurs propres de X, T, X. Et les colonnes de U, c'est les vecteurs propres de X, X, T. Voilà, cette décomposition en valeur singulière, on peut l'utiliser pour réduire la dimension en sélectionnant uniquement les cas premiers vecteurs singuliers. Je me contente ici de sélectionner les cas premiers vecteurs singuliers, donc je tronque ma matrice U et ma matrice V. Voilà, donc la réduction de la dimension avec la SVD, c'est étant donné un vocabulaire de terme V, je génère la matrice X de taille cardinal V fois cardinal V, j'applique la SVD pour obtenir U, S et V, et puis je choisis les cas premières colonnes de U pour avoir des vecteurs de mots de dimension K. Et ça, du coup, ces cas premières colonnes de U, c'est ce qu'on peut appeler des représentations distributionnelles de mémoire. Et puis on a aussi des informations statistiques qui indiquent comment le fait de choisir que les cas premières dimensions capturent ou pas de l'information. Voilà, reprenons notre petit exemple de tout à l'heure et donc appliquons ce principe de réduction de la dimension sur ce petit exemple-là. Donc j'ai mon ensemble de mots qui est celui-là, je fais appel au module linale de NumPy, et puis j'applique la SVD sur cette matrice X qui est donc ma matrice de co-occurrence telle que construite tout à l'heure, avec un voisinage de contexte, une fenêtre de contexte de taille 1. Je vais du coup, après, sélectionner les deux premières colonnes de U, donc les deux plus grandes valeurs singulières, ce que je fais avec ce code-là, et puis j'affiche du coup les mots obtenus, les représentations des mots obtenus, donc dans cet espace à deux dimensions. Et donc on voit que c'est intéressant, que j'ai peut-être effectivement capté une information un peu plus sémantique avec ce type de représentation, et notamment le fait que NLP soit proche de DEEP dans cet espace, c'est relativement pertinent. ENJOY et LIKE sont pas très loin non plus dans cet espace. Donc c'est intéressant, mais c'est bien sûr coûteux en termes de calcul, et puis il est difficile d'incorporer de nouveaux mots, de nouveaux documents. Juste ce qu'il faut retenir de cette approche, c'est qu'on va souhaiter représenter un mot par un vecteur dense. Voilà, typiquement ce qu'on souhaite c'est un mot associé à ce type de vecteur là, de petite dimension. Et donc cette représentation, en fait on peut la prendre, et notamment on peut la prendre avec des approches qu'utilisent des réseaux de neurones profonds. Donc c'est vraiment cette idée-là, apprendre directement la représentation dans ce démo, et ça c'est typiquement ce qui a été proposé par Mikolov en 2013 avec l'approche Word2Vec, où l'idée c'était de prédire le contexte des mots directement plutôt que de compter les co-occurrences. Donc après il y a eu une famille énorme d'algorithmes qui ont suivi, donc GloVe, BERT, qui est des modèles de langues un peu plus sophistiqués, mais il y a eu énormément d'extensions de cette idée. Donc si je reprends Word2Vec, il y a principalement deux algorithmes. L'algorithme qu'on appelle CEBO, donc Continuous Back of Word Model, qui prédit le mot cible étant donné son contexte, donc étant donné son voisinage, ou l'approche Skipgram qui elle, cherche à prédire le contexte étant donné le mot cible. Donc on va regarder l'approche Skipgram, donc on a des modèles de langues, des modèles de mots. Voilà, donc on a le mot banking qui est le mot central, et puis en fait je vais chercher à prédire le contexte, c'est-à-dire les mots précédents et les mots suivants, justement en essayant d'estimer la probabilité que tel mot soit le mot avant banking, que tel mot soit le mot après banking, etc. Donc j'ai mon mot central, j'ai donc mon fenêtrage de M mots, et puis l'objectif va être de prédire le contexte, c'est-à-dire les mots voisins dans cette fenêtre de taille M étant donné le mot cible. Et donc pour ça, je vais avoir une fonction objective qui va chercher à maximiser la log probabilité de chaque mot de contexte étant donné le mot cible. Donc j'ai ces probabilités d'un mot étant donné le mot cible, d'un mot de mot contexte, avec M qui est la taille de ma fenêtre, et puis je vais chercher à maximiser ça pour l'ensemble des mots à ma disposition, de mon corpus. Et donc ce que je cherche, c'est à trouver l'ensemble des variables qui vont me permettre de maximiser ça, et donc c'est ça que je cherche à optimiser. Donc ce qu'on fait généralement dans ces approches-là, c'est qu'on va transformer une valeur qui est dans RV à une distribution de probabilité au travers d'une fonction qui s'appelle une fonction softmax, et donc qui est définie de cette manière-là. Et donc si j'applique ça sur ce cadre-là, sur notre problème, je vais avoir une fonction softmax et donc une formulation pour notre problème qui va devenir celle-ci. Donc on voit qu'on prend bien en compte la similarité entre nos mots en faisant ça. Donc O et C ici, c'est les indices de mots de sortie et centraux, et puis U et V, c'est les U de O et V, c'est les vecteurs correspondants. Donc regardons plus en détail cette architecture d'apprentissage de représentation de mots par des approches neuronales. Donc j'ai la représentation de mon mot central, ici c'est l'entraînement système, donc représentation de type one-hot. J'ai une première matrice de taille D x V. D, c'est la taille de mon vocabulaire, c'est l'espèce de représentation de mes termes en one-hot. Et puis D, c'est la dimension que je souhaite pour mon vecteur dans mes digues. Donc avec des paramètres bien sûr que j'initialise, mais que je vais chercher à estimer. Et puis en sortie de la multiplication de cette représentation one-hot de mon mot et de la matrice, j'ai mon vecteur Vc, qui est mon vecteur dans mes digues que je cherche. Ce vecteur-là, je vais donc ensuite le remultiplier avec mes mots de contexte. Voilà, donc à nouveau j'ai une matrice de taille D x V, la taille de mon vocabulaire, donc avec ici les mots de mon contexte. J'en sorti le produit scalaire entre mon mot central et son mot de contexte, et je transforme ces valeurs-là en softmax, comme indiqué, qui me donne une estimation de la probabilité de x sachant c. Du fait que le mot x soit un mot de contexte de c, et puis que je peux mettre en relation avec ma vérité. Et donc avec le principe d'optimisation des réseaux de neurones, et notamment la descente de gradients, je vais pouvoir petit à petit apprendre les différentes points de ma matrice, et donc je vais pouvoir avoir en sortie la représentation distributionnelle, donc le plongement, le mot dans mes dignes, de mon mot de contexte, donc ici. Alors bien sûr, il y a plein d'applications de tout ça à l'AERI, notamment pour construire des représentations des requêtes et des textes selon ce formalisme, donc avec ces représentations de mots. L'idée c'est d'appliquer ça à chaque mot de la requête, chaque mot du texte, et puis après avec des fonctions d'agrégation, on obtient une représentation de la requête et une représentation du texte qu'on peut après mettre en correspondance avec tous les modèles qu'on a à notre disposition. Et puis il y a plein d'autres architectures qui utilisent ces mécanismes-là. Une slide qui montre l'ensemble des choses qui sont possibles, l'ensemble des architectures qui sont possibles et qui sont toutes plus complexes que les unes que les autres. Voilà, j'en ai fini sur ce cours, donc rapide bilan sur ce qui vous a été présenté. Donc un nouveau paradigme pour l'AERI au travers de cette approche Learning to Rank. Donc ça, j'avais déjà dit la dernière fois, des approches qui tentent d'exploiter toutes les informations à disposition, des résultats comparables à ceux des modèles probabilistes dans le cadre de collection classique et des résultats bien meilleurs quand on a des grosses collections pour lesquelles on est capable de construire des espaces d'attributs très riches. Et puis bien sûr, ce problème de disponibilité des données d'entrée, des données à noter pour mettre en place les techniques d'apprentissage. Voilà, des lectures conseillées pour compléter ce cours. Et puis je vous souhaite un bon lab qui vous demandera d'appliquer l'approche par paire d'une part et d'autre part, qui vous fera travailler justement sur cette partie d'ouverture, donc sur les représentations de mots par plongement lexico."
}